#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarShop

#include "Basic.hpp"

#include "E_CarShopSections_structs.hpp"
#include "F_CarShop_DT_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "F_CarShopItem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_CarShop.WBP_CarShop_C.BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature, Param_Index) == 0x000000, "Member 'WBP_CarShop_C_BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function WBP_CarShop.WBP_CarShop_C.ChangeSelectedButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_CarShop_C_ChangeSelectedButton final
{
public:
	class FText                                   NewCategoryText;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_CarShopCategory_C*                 NewSelectedCategory;                               // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShop_C_ChangeSelectedButton) == 0x000008, "Wrong alignment on WBP_CarShop_C_ChangeSelectedButton");
static_assert(sizeof(WBP_CarShop_C_ChangeSelectedButton) == 0x000020, "Wrong size on WBP_CarShop_C_ChangeSelectedButton");
static_assert(offsetof(WBP_CarShop_C_ChangeSelectedButton, NewCategoryText) == 0x000000, "Member 'WBP_CarShop_C_ChangeSelectedButton::NewCategoryText' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ChangeSelectedButton, NewSelectedCategory) == 0x000018, "Member 'WBP_CarShop_C_ChangeSelectedButton::NewSelectedCategory' has a wrong offset!");

// Function WBP_CarShop.WBP_CarShop_C.CustomEvent
// 0x0004 (0x0004 - 0x0000)
struct WBP_CarShop_C_CustomEvent final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShop_C_CustomEvent) == 0x000004, "Wrong alignment on WBP_CarShop_C_CustomEvent");
static_assert(sizeof(WBP_CarShop_C_CustomEvent) == 0x000004, "Wrong size on WBP_CarShop_C_CustomEvent");
static_assert(offsetof(WBP_CarShop_C_CustomEvent, Param_Index) == 0x000000, "Member 'WBP_CarShop_C_CustomEvent::Param_Index' has a wrong offset!");

// Function WBP_CarShop.WBP_CarShop_C.ExecuteUbergraph_WBP_CarShop
// 0x0968 (0x0968 - 0x0000)
struct WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0060(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0078(0x0018)()
	int32                                         CallFunc_UpdateMoney_AmountOfMoney;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateMoney_AmountOfMoney_1;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewSelectedCategoryName;        // 0x0110(0x0018)()
	class UWBP_CarShopCategory_C*                 K2Node_CustomEvent_CarShopCategory;                // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_CarShopCategory_C*>         K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateMoney_AmountOfMoney_2;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShop_DT                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x01E0(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShopItem                         K2Node_MakeStruct_F_CarShopItem;                   // 0x0288(0x0058)(HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     K2Node_CustomEvent_PressedCarSlot;                 // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText Error_message)>    K2Node_CreateDelegate_OutputDelegate_7;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_ErrorMessage;                   // 0x0328(0x0018)()
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_CarShopSlot_C* UnhoveredSlot)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0350(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CarShopSlot_C* HoveredSlot)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0360(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CarShopSlot_C* CurrentCar)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateMoney_AmountOfMoney_3;              // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_3;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A6[0x2];                                      // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x03B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x03C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_4;                         // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x2];                                      // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_5;                         // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_436[0x2];                                      // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText NewSelectedCategoryName, class UWBP_CarShopCategory_C* CarShopCategory)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x043C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopCategory_C*                 CallFunc_Array_Get_Item_6;                         // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_7;                         // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShop_DT                          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0488(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShopItem                         K2Node_MakeStruct_F_CarShopItem_1;                 // 0x0530(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_8;                         // 0x0598(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x05A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShop_DT                          CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x05B0(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0651(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652[0x6];                                      // 0x0652(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShopItem                         K2Node_MakeStruct_F_CarShopItem_2;                 // 0x0658(0x0058)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_2;                 // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x06F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0700(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_9;                         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShop_DT                          CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0720(0x00A0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CarShopItem                         K2Node_MakeStruct_F_CarShopItem_3;                 // 0x07C8(0x0058)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_9;                // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CarShopSlot_C*>             K2Node_MakeArray_Array_1;                          // 0x0830(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UWBP_CarShopSlot_C* PressedCarSlot)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0840(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     K2Node_CustomEvent_CurrentCar;                     // 0x0850(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     K2Node_CustomEvent_HoveredSlot;                    // 0x0860(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     CallFunc_Array_Get_Item_10;                        // 0x0868(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0871(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0872(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0873(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_875[0x3];                                      // 0x0875(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x087C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_10;               // 0x087D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87E[0x2];                                      // 0x087E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CarShopSlot_C*                     K2Node_CustomEvent_UnhoveredSlot;                  // 0x0880(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0888(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListeningForInputAction_ReturnValue;    // 0x08C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C5[0x3];                                      // 0x08C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x08C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x08D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x08E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x08F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x08F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0900(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0908(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0910(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0918(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0920(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0930(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0940(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x0958(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_3;                 // 0x0960(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop) == 0x000008, "Wrong alignment on WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop");
static_assert(sizeof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop) == 0x000968, "Wrong size on WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, EntryPoint) == 0x000000, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000048, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_GetText_ReturnValue) == 0x000060, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_GetText_ReturnValue_1) == 0x000078, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_UpdateMoney_AmountOfMoney) == 0x000090, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_UpdateMoney_AmountOfMoney' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_GetOwningPlayer_ReturnValue) == 0x000098, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_DynamicCast_AsSurv_PC) == 0x0000A8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable_2) == 0x0000D4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable_3) == 0x0000D8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Loop_Counter_Variable_2) == 0x0000DC, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CustomEvent_Index) == 0x0000E0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_SwitchInteger_CmpSuccess) == 0x0000E4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue_2) == 0x0000EC, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable_4) == 0x0000F0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000F4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Loop_Counter_Variable_3) == 0x0000F8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_UpdateMoney_AmountOfMoney_1) == 0x0000FC, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_UpdateMoney_AmountOfMoney_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000100, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Add_IntInt_ReturnValue_3) == 0x000108, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CustomEvent_NewSelectedCategoryName) == 0x000110, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CustomEvent_NewSelectedCategoryName' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CustomEvent_CarShopCategory) == 0x000128, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CustomEvent_CarShopCategory' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_SwitchEnum_CmpSuccess_1) == 0x000140, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate_2) == 0x000144, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate_3) == 0x000154, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue_3) == 0x000164, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_UpdateMoney_AmountOfMoney_2) == 0x000168, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_UpdateMoney_AmountOfMoney_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000170, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000178, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate_4) == 0x00017C, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Get_Item) == 0x000190, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue_4) == 0x000198, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001A0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Loop_Counter_Variable_4) == 0x0001B0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Length_ReturnValue_5) == 0x0001B4, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001B8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_IsValid_ReturnValue_2) == 0x0001BC, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, Temp_int_Array_Index_Variable_5) == 0x0001C0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Conv_StringToName_ReturnValue) == 0x0001D0, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0001D8, "Member 'WBP_CarShop_C_ExecuteUbergraph_WBP_CarShop::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
