#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerName3DWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerName3DWidget.WBP_PlayerName3DWidget_C
// 0x00D0 (0x0350 - 0x0280)
class UWBP_PlayerName3DWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Label;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_67;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Chat;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Chat;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Label;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerName;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquadMember3D_C*                   WBP_SquadMember3D;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Context_Text;                                      // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASurvivalPlayer_Test_C*                 As_Survival_Player_Test;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Chat_Text_Is_Empty;                                // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_WBP_PlayerName3DWidget_C;                    // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Sender;                                            // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ToggleChat;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Aliases;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnColorPlayerName;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HaveName;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              Player_State;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ThreeDMemberVisibility();
	void Bind();
	void CheckStat();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerName3DWidget(int32 EntryPoint);
	void GetAliases(class FString* Result);
	void HideChat(class AActor* Actor);
	void IsHaveName(bool* Have);
	void OnColorPlayerName__DelegateSignature(bool IsSquad);
	void OnUpdateSquad();
	void SavePlayerState(class APS_TDB_C* PlayerState);
	void Set3DMember(int32 Param_Index);
	void SetAliases(const class FString& InString);
	void SetColor(bool Param_Index);
	void SetPlayerName(const class FText& InText);
	void Show_(bool Param_Show);
	void ShowChat(class AActor* Actor);
	void UpdateChat(const class FText& Chat_text, const class FText& Sender_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerName3DWidget_C">();
	}
	static class UWBP_PlayerName3DWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerName3DWidget_C>();
	}
};
static_assert(alignof(UWBP_PlayerName3DWidget_C) == 0x000008, "Wrong alignment on UWBP_PlayerName3DWidget_C");
static_assert(sizeof(UWBP_PlayerName3DWidget_C) == 0x000350, "Wrong size on UWBP_PlayerName3DWidget_C");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, UberGraphFrame) == 0x000280, "Member 'UWBP_PlayerName3DWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Show) == 0x000288, "Member 'UWBP_PlayerName3DWidget_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, HorizontalBox_Label) == 0x000290, "Member 'UWBP_PlayerName3DWidget_C::HorizontalBox_Label' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Image_67) == 0x000298, "Member 'UWBP_PlayerName3DWidget_C::Image_67' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, SizeBox_Chat) == 0x0002A0, "Member 'UWBP_PlayerName3DWidget_C::SizeBox_Chat' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Text_Chat) == 0x0002A8, "Member 'UWBP_PlayerName3DWidget_C::Text_Chat' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Text_Label) == 0x0002B0, "Member 'UWBP_PlayerName3DWidget_C::Text_Label' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Text_PlayerName) == 0x0002B8, "Member 'UWBP_PlayerName3DWidget_C::Text_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, WBP_SquadMember3D) == 0x0002C0, "Member 'UWBP_PlayerName3DWidget_C::WBP_SquadMember3D' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Context_Text) == 0x0002C8, "Member 'UWBP_PlayerName3DWidget_C::Context_Text' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, As_Survival_Player_Test) == 0x0002E0, "Member 'UWBP_PlayerName3DWidget_C::As_Survival_Player_Test' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Chat_Text_Is_Empty) == 0x0002E8, "Member 'UWBP_PlayerName3DWidget_C::Chat_Text_Is_Empty' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Index_WBP_PlayerName3DWidget_C) == 0x0002EC, "Member 'UWBP_PlayerName3DWidget_C::Index_WBP_PlayerName3DWidget_C' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Showed) == 0x0002F0, "Member 'UWBP_PlayerName3DWidget_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Sender) == 0x0002F8, "Member 'UWBP_PlayerName3DWidget_C::Sender' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, ToggleChat) == 0x000310, "Member 'UWBP_PlayerName3DWidget_C::ToggleChat' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Timer) == 0x000318, "Member 'UWBP_PlayerName3DWidget_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Aliases) == 0x000320, "Member 'UWBP_PlayerName3DWidget_C::Aliases' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, OnColorPlayerName) == 0x000330, "Member 'UWBP_PlayerName3DWidget_C::OnColorPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, HaveName) == 0x000340, "Member 'UWBP_PlayerName3DWidget_C::HaveName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerName3DWidget_C, Player_State) == 0x000348, "Member 'UWBP_PlayerName3DWidget_C::Player_State' has a wrong offset!");

}

