#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Crosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "BPE_Weapon_Type_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Crosshair.WBP_Crosshair_C
// 0x00B0 (0x0330 - 0x0280)
class UWBP_Crosshair_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Signing_Anim;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Aim;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_ReloadBar;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ReloadBar;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DotCrosshair_C*                    WBP_DotCrosshair;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RifleCrosshair_C*                  WBP_HuntingRifleCrosshair;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PistolCrosshair_C*                 WBP_PistolCrosshair;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HuntingRifleCrosshair_C*           WBP_RifleCrosshair;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ShotgunCrosshair_C*                WBP_ShotgunCrosshair;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      Player;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        ReloadDuration;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentReloadTime;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ReloadingMaterial;                                 // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReloading;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ReloadingTimer;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAiming;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Crosshair_C*                       OldCrossHair;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShooting;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CurrentCrosshair;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HideCrosshairTimer;                                // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Aiming(bool Aim);
	void Destruct();
	void ExecuteUbergraph_WBP_Crosshair(int32 EntryPoint);
	void GetCrosshaierByWeaponType(EBPE_Weapon_Type WeaponType, class UUserWidget** CrosshairWidget);
	void HideCrosshair();
	void Hitting();
	void Killing();
	void PreConstruct(bool IsDesignTime);
	void Reloading(double Duration);
	void SetReloadingProgress(double Percent);
	void Shooting();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TrailerAim(bool Aim, EBPE_Weapon_Type WeaponType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Crosshair_C">();
	}
	static class UWBP_Crosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Crosshair_C>();
	}
};
static_assert(alignof(UWBP_Crosshair_C) == 0x000008, "Wrong alignment on UWBP_Crosshair_C");
static_assert(sizeof(UWBP_Crosshair_C) == 0x000330, "Wrong size on UWBP_Crosshair_C");
static_assert(offsetof(UWBP_Crosshair_C, UberGraphFrame) == 0x000280, "Member 'UWBP_Crosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Signing_Anim) == 0x000288, "Member 'UWBP_Crosshair_C::Signing_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Canvas_Aim) == 0x000290, "Member 'UWBP_Crosshair_C::Canvas_Aim' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Canvas_ReloadBar) == 0x000298, "Member 'UWBP_Crosshair_C::Canvas_ReloadBar' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Image_Border) == 0x0002A0, "Member 'UWBP_Crosshair_C::Image_Border' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Image_ReloadBar) == 0x0002A8, "Member 'UWBP_Crosshair_C::Image_ReloadBar' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WBP_DotCrosshair) == 0x0002B0, "Member 'UWBP_Crosshair_C::WBP_DotCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WBP_HuntingRifleCrosshair) == 0x0002B8, "Member 'UWBP_Crosshair_C::WBP_HuntingRifleCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WBP_PistolCrosshair) == 0x0002C0, "Member 'UWBP_Crosshair_C::WBP_PistolCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WBP_RifleCrosshair) == 0x0002C8, "Member 'UWBP_Crosshair_C::WBP_RifleCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, WBP_ShotgunCrosshair) == 0x0002D0, "Member 'UWBP_Crosshair_C::WBP_ShotgunCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, Player) == 0x0002D8, "Member 'UWBP_Crosshair_C::Player' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, ReloadDuration) == 0x0002E0, "Member 'UWBP_Crosshair_C::ReloadDuration' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, CurrentReloadTime) == 0x0002E8, "Member 'UWBP_Crosshair_C::CurrentReloadTime' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, ReloadingMaterial) == 0x0002F0, "Member 'UWBP_Crosshair_C::ReloadingMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, IsReloading) == 0x0002F8, "Member 'UWBP_Crosshair_C::IsReloading' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, ReloadingTimer) == 0x000300, "Member 'UWBP_Crosshair_C::ReloadingTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, IsAiming) == 0x000308, "Member 'UWBP_Crosshair_C::IsAiming' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, OldCrossHair) == 0x000310, "Member 'UWBP_Crosshair_C::OldCrossHair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, IsShooting) == 0x000318, "Member 'UWBP_Crosshair_C::IsShooting' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, CurrentCrosshair) == 0x000320, "Member 'UWBP_Crosshair_C::CurrentCrosshair' has a wrong offset!");
static_assert(offsetof(UWBP_Crosshair_C, HideCrosshairTimer) == 0x000328, "Member 'UWBP_Crosshair_C::HideCrosshairTimer' has a wrong offset!");

}

