#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PerksInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PerksInfo.WBP_PerksInfo_C
// 0x0040 (0x02C0 - 0x0280)
class UWBP_PerksInfo_C final : public UUserWidget
{
public:
	class UTextBlock*                             Description;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconPerkInfo;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_216;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_900;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1012;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NamePerk;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PercentageChange;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatName;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PerksInfo_C">();
	}
	static class UWBP_PerksInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PerksInfo_C>();
	}
};
static_assert(alignof(UWBP_PerksInfo_C) == 0x000008, "Wrong alignment on UWBP_PerksInfo_C");
static_assert(sizeof(UWBP_PerksInfo_C) == 0x0002C0, "Wrong size on UWBP_PerksInfo_C");
static_assert(offsetof(UWBP_PerksInfo_C, Description) == 0x000280, "Member 'UWBP_PerksInfo_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, IconPerkInfo) == 0x000288, "Member 'UWBP_PerksInfo_C::IconPerkInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, Image_216) == 0x000290, "Member 'UWBP_PerksInfo_C::Image_216' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, Image_900) == 0x000298, "Member 'UWBP_PerksInfo_C::Image_900' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, Image_1012) == 0x0002A0, "Member 'UWBP_PerksInfo_C::Image_1012' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, NamePerk) == 0x0002A8, "Member 'UWBP_PerksInfo_C::NamePerk' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, PercentageChange) == 0x0002B0, "Member 'UWBP_PerksInfo_C::PercentageChange' has a wrong offset!");
static_assert(offsetof(UWBP_PerksInfo_C, StatName) == 0x0002B8, "Member 'UWBP_PerksInfo_C::StatName' has a wrong offset!");

}

