#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Objective

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Objective.WBP_Objective_C.ExecuteUbergraph_WBP_Objective
// 0x0088 (0x0088 - 0x0000)
struct WBP_Objective_C_ExecuteUbergraph_WBP_Objective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective) == 0x000008, "Wrong alignment on WBP_Objective_C_ExecuteUbergraph_WBP_Objective");
static_assert(sizeof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective) == 0x000088, "Wrong size on WBP_Objective_C_ExecuteUbergraph_WBP_Objective");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, EntryPoint) == 0x000000, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_IsValid_ReturnValue_2) == 0x000016, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_IsValid_ReturnValue_3) == 0x000030, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000040, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000068, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, CallFunc_IsValid_ReturnValue_4) == 0x000070, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ExecuteUbergraph_WBP_Objective, K2Node_CreateDelegate_OutputDelegate_2) == 0x000074, "Member 'WBP_Objective_C_ExecuteUbergraph_WBP_Objective::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.Init
// 0x0130 (0x0130 - 0x0000)
struct WBP_Objective_C_Init final
{
public:
	class FText                                   CallFunc_ParseText_TextObjective;                  // 0x0000(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(WBP_Objective_C_Init) == 0x000008, "Wrong alignment on WBP_Objective_C_Init");
static_assert(sizeof(WBP_Objective_C_Init) == 0x000130, "Wrong size on WBP_Objective_C_Init");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_ParseText_TextObjective) == 0x000000, "Member 'WBP_Objective_C_Init::CallFunc_ParseText_TextObjective' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_Objective_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_Objective_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_Map_Values_Values) == 0x000020, "Member 'WBP_Objective_C_Init::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'WBP_Objective_C_Init::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'WBP_Objective_C_Init::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_GetItemCountByName_ReturnedCount) == 0x000048, "Member 'WBP_Objective_C_Init::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_Objective_C_Init::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Objective_C_Init::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_SelectInt_ReturnValue) == 0x0000A4, "Member 'WBP_Objective_C_Init::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000A8, "Member 'WBP_Objective_C_Init::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_BooleanOR_ReturnValue) == 0x0000B0, "Member 'WBP_Objective_C_Init::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'WBP_Objective_C_Init::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_Objective_C_Init::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_Init, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_Objective_C_Init::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.IsObjectiveCompleted
// 0x0001 (0x0001 - 0x0000)
struct WBP_Objective_C_IsObjectiveCompleted final
{
public:
	bool                                          Param_bObjectiveCompleted;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C_IsObjectiveCompleted) == 0x000001, "Wrong alignment on WBP_Objective_C_IsObjectiveCompleted");
static_assert(sizeof(WBP_Objective_C_IsObjectiveCompleted) == 0x000001, "Wrong size on WBP_Objective_C_IsObjectiveCompleted");
static_assert(offsetof(WBP_Objective_C_IsObjectiveCompleted, Param_bObjectiveCompleted) == 0x000000, "Member 'WBP_Objective_C_IsObjectiveCompleted::Param_bObjectiveCompleted' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.ParseText
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_Objective_C_ParseText final
{
public:
	class FText                                   Param_TextObjective;                               // 0x0000(0x0018)(Parm, OutParm)
	class FString                                 TextString;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0050(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0088(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C_ParseText) == 0x000008, "Wrong alignment on WBP_Objective_C_ParseText");
static_assert(sizeof(WBP_Objective_C_ParseText) == 0x0002D0, "Wrong size on WBP_Objective_C_ParseText");
static_assert(offsetof(WBP_Objective_C_ParseText, Param_TextObjective) == 0x000000, "Member 'WBP_Objective_C_ParseText::Param_TextObjective' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, TextString) == 0x000018, "Member 'WBP_Objective_C_ParseText::TextString' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Replace_ReturnValue) == 0x000028, "Member 'WBP_Objective_C_ParseText::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_Objective_C_ParseText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Map_Values_Values) == 0x000050, "Member 'WBP_Objective_C_ParseText::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'WBP_Objective_C_ParseText::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'WBP_Objective_C_ParseText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'WBP_Objective_C_ParseText::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000088, "Member 'WBP_Objective_C_ParseText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002A8, "Member 'WBP_Objective_C_ParseText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0002B0, "Member 'WBP_Objective_C_ParseText::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_ParseText, CallFunc_Replace_ReturnValue_1) == 0x0002C0, "Member 'WBP_Objective_C_ParseText::CallFunc_Replace_ReturnValue_1' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.SetQuestObjectiveViewModel
// 0x0038 (0x0038 - 0x0000)
struct WBP_Objective_C_SetQuestObjectiveViewModel final
{
public:
	class UQuestObjectiveViewModel*               ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              K2Node_DynamicCast_AsMVVM_View;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C_SetQuestObjectiveViewModel) == 0x000008, "Wrong alignment on WBP_Objective_C_SetQuestObjectiveViewModel");
static_assert(sizeof(WBP_Objective_C_SetQuestObjectiveViewModel) == 0x000038, "Wrong size on WBP_Objective_C_SetQuestObjectiveViewModel");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, ViewModel) == 0x000000, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, K2Node_DynamicCast_AsMVVM_View) == 0x000010, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::K2Node_DynamicCast_AsMVVM_View' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000020, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C_SetQuestObjectiveViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000030, "Member 'WBP_Objective_C_SetQuestObjectiveViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.__45748789-469c-368a-47d1-d595f185b0da_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ConvertQuestResultToColor_ReturnValue;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest) == 0x000004, "Wrong alignment on WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest");
static_assert(sizeof(WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest) == 0x000020, "Wrong size on WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest");
static_assert(offsetof(WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest, ReturnValue) == 0x000000, "Member 'WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest, CallFunc_ConvertQuestResultToColor_ReturnValue) == 0x000010, "Member 'WBP_Objective_C___45748789Minus469cMinus368aMinus47d1Minusd595f185b0da_SourceToDest::CallFunc_ConvertQuestResultToColor_ReturnValue' has a wrong offset!");

// Function WBP_Objective.WBP_Objective_C.__ec0151ee-4afd-45c4-c3b1-1dafbd46bd63_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest) == 0x000004, "Wrong alignment on WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest");
static_assert(sizeof(WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest) == 0x000020, "Wrong size on WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest");
static_assert(offsetof(WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest, ReturnValue) == 0x000000, "Member 'WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'WBP_Objective_C___ec0151eeMinus4afdMinus45c4Minusc3b1Minus1dafbd46bd63_SourceToDest::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

}

