#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftCategory

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_EntryMode_structs.hpp"
#include "S_WorkbenchCraftCategory_structs.hpp"
#include "CraftItemCategories_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_CraftCategory.WBP_CraftCategory_C.Create Entry
// 0x0070 (0x0070 - 0x0000)
struct WBP_CraftCategory_C_Create_Entry final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_EntryMode                                   EntryMode;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFItemInfo& ItemData, bool bIsSketch)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_Create_Entry) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_Create_Entry");
static_assert(sizeof(WBP_CraftCategory_C_Create_Entry) == 0x000070, "Wrong size on WBP_CraftCategory_C_Create_Entry");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, ItemName) == 0x000000, "Member 'WBP_CraftCategory_C_Create_Entry::ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, EntryMode) == 0x000008, "Member 'WBP_CraftCategory_C_Create_Entry::EntryMode' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_CraftCategory_C_Create_Entry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_CraftCategory_C_Create_Entry::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000040, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_MakeStruct_Margin) == 0x00004C, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'WBP_CraftCategory_C_Create_Entry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Create_Entry, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'WBP_CraftCategory_C_Create_Entry::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.ExecuteUbergraph_WBP_CraftCategory
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_Empty;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_3;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_2;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef_1;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CraftStation_C*                     K2Node_CustomEvent_WorkbenchRef;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory");
static_assert(sizeof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory) == 0x0000A0, "Wrong size on WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, EntryPoint) == 0x000000, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_IsEmpty_Empty) == 0x000004, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_IsEmpty_Empty' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_WorkbenchRef_3) == 0x000018, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_WorkbenchRef_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000030, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_WorkbenchRef_2) == 0x000038, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_WorkbenchRef_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_WorkbenchRef_1) == 0x000040, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_WorkbenchRef_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_WorkbenchRef) == 0x000048, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_WorkbenchRef' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_Item_1) == 0x000058, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_Item) == 0x000060, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_CustomEvent_Item_2) == 0x000068, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_CustomEvent_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000078, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000080, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, CallFunc_PlayEvent2D_ReturnValue) == 0x000090, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory, K2Node_Event_IsDesignTime) == 0x000098, "Member 'WBP_CraftCategory_C_ExecuteUbergraph_WBP_CraftCategory::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.GetCategoryName
// 0x0030 (0x0030 - 0x0000)
struct WBP_CraftCategory_C_GetCategoryName final
{
public:
	class FText                                   CategoryName;                                      // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
static_assert(alignof(WBP_CraftCategory_C_GetCategoryName) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_GetCategoryName");
static_assert(sizeof(WBP_CraftCategory_C_GetCategoryName) == 0x000030, "Wrong size on WBP_CraftCategory_C_GetCategoryName");
static_assert(offsetof(WBP_CraftCategory_C_GetCategoryName, CategoryName) == 0x000000, "Member 'WBP_CraftCategory_C_GetCategoryName::CategoryName' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_GetCategoryName, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'WBP_CraftCategory_C_GetCategoryName::CallFunc_GetText_ReturnValue' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.Init
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_CraftCategory_C_Init final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WorkbenchCraftCategory              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ReferenceParm)
	ECraftItemCategories                          CallFunc_Array_Get_Item;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0080(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x01E0(0x00D0)()
};
static_assert(alignof(WBP_CraftCategory_C_Init) == 0x000010, "Wrong alignment on WBP_CraftCategory_C_Init");
static_assert(sizeof(WBP_CraftCategory_C_Init) == 0x0002B0, "Wrong size on WBP_CraftCategory_C_Init");
static_assert(offsetof(WBP_CraftCategory_C_Init, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_CraftCategory_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_CraftCategory_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_CraftCategory_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_CraftCategory_C_Init::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WBP_CraftCategory_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000050, "Member 'WBP_CraftCategory_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, Temp_int_Loop_Counter_Variable_1) == 0x000054, "Member 'WBP_CraftCategory_C_Init::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'WBP_CraftCategory_C_Init::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'WBP_CraftCategory_C_Init::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_CraftCategory_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Array_Get_Item_1) == 0x000074, "Member 'WBP_CraftCategory_C_Init::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_CraftCategory_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000080, "Member 'WBP_CraftCategory_C_Init::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0001D0, "Member 'WBP_CraftCategory_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x0001D1, "Member 'WBP_CraftCategory_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D2, "Member 'WBP_CraftCategory_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Array_Length_ReturnValue_1) == 0x0001D4, "Member 'WBP_CraftCategory_C_Init::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D8, "Member 'WBP_CraftCategory_C_Init::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0001E0, "Member 'WBP_CraftCategory_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.IsEmpty
// 0x000C (0x000C - 0x0000)
struct WBP_CraftCategory_C_IsEmpty final
{
public:
	bool                                          Empty;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_IsEmpty) == 0x000004, "Wrong alignment on WBP_CraftCategory_C_IsEmpty");
static_assert(sizeof(WBP_CraftCategory_C_IsEmpty) == 0x00000C, "Wrong size on WBP_CraftCategory_C_IsEmpty");
static_assert(offsetof(WBP_CraftCategory_C_IsEmpty, Empty) == 0x000000, "Member 'WBP_CraftCategory_C_IsEmpty::Empty' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_IsEmpty, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_CraftCategory_C_IsEmpty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_IsEmpty, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CraftCategory_C_IsEmpty::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.ItemCrafted
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_ItemCrafted final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_ItemCrafted) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_ItemCrafted");
static_assert(sizeof(WBP_CraftCategory_C_ItemCrafted) == 0x000008, "Wrong size on WBP_CraftCategory_C_ItemCrafted");
static_assert(offsetof(WBP_CraftCategory_C_ItemCrafted, Item) == 0x000000, "Member 'WBP_CraftCategory_C_ItemCrafted::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.ItemDismantled
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_ItemDismantled final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_ItemDismantled) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_ItemDismantled");
static_assert(sizeof(WBP_CraftCategory_C_ItemDismantled) == 0x000008, "Wrong size on WBP_CraftCategory_C_ItemDismantled");
static_assert(offsetof(WBP_CraftCategory_C_ItemDismantled, Item) == 0x000000, "Member 'WBP_CraftCategory_C_ItemDismantled::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.Need Update Model Event
// 0x0228 (0x0228 - 0x0000)
struct WBP_CraftCategory_C_Need_Update_Model_Event final
{
public:
	struct FFItemInfo                             NewModelInfo;                                      // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bIsSketch;                                         // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_Need_Update_Model_Event) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_Need_Update_Model_Event");
static_assert(sizeof(WBP_CraftCategory_C_Need_Update_Model_Event) == 0x000228, "Wrong size on WBP_CraftCategory_C_Need_Update_Model_Event");
static_assert(offsetof(WBP_CraftCategory_C_Need_Update_Model_Event, NewModelInfo) == 0x000000, "Member 'WBP_CraftCategory_C_Need_Update_Model_Event::NewModelInfo' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_Need_Update_Model_Event, bIsSketch) == 0x000220, "Member 'WBP_CraftCategory_C_Need_Update_Model_Event::bIsSketch' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnItemCrafted__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CraftCategory_C_OnItemCrafted__DelegateSignature final
{
public:
	class UWBP_CraftCategory_C*                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnItemCrafted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnItemCrafted__DelegateSignature");
static_assert(sizeof(WBP_CraftCategory_C_OnItemCrafted__DelegateSignature) == 0x000010, "Wrong size on WBP_CraftCategory_C_OnItemCrafted__DelegateSignature");
static_assert(offsetof(WBP_CraftCategory_C_OnItemCrafted__DelegateSignature, Category) == 0x000000, "Member 'WBP_CraftCategory_C_OnItemCrafted__DelegateSignature::Category' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_OnItemCrafted__DelegateSignature, Item) == 0x000008, "Member 'WBP_CraftCategory_C_OnItemCrafted__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnItemDismantled__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CraftCategory_C_OnItemDismantled__DelegateSignature final
{
public:
	class UWBP_CraftCategory_C*                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnItemDismantled__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnItemDismantled__DelegateSignature");
static_assert(sizeof(WBP_CraftCategory_C_OnItemDismantled__DelegateSignature) == 0x000010, "Wrong size on WBP_CraftCategory_C_OnItemDismantled__DelegateSignature");
static_assert(offsetof(WBP_CraftCategory_C_OnItemDismantled__DelegateSignature, Category) == 0x000000, "Member 'WBP_CraftCategory_C_OnItemDismantled__DelegateSignature::Category' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_OnItemDismantled__DelegateSignature, Item) == 0x000008, "Member 'WBP_CraftCategory_C_OnItemDismantled__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnNeedUpdateModel__DelegateSignature
// 0x0228 (0x0228 - 0x0000)
struct WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature final
{
public:
	struct FFItemInfo                             NewModelInfo;                                      // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          bIsSketch;                                         // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature");
static_assert(sizeof(WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature) == 0x000228, "Wrong size on WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature");
static_assert(offsetof(WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature, NewModelInfo) == 0x000000, "Member 'WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature::NewModelInfo' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature, bIsSketch) == 0x000220, "Member 'WBP_CraftCategory_C_OnNeedUpdateModel__DelegateSignature::bIsSketch' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnSelectedCategory__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature final
{
public:
	class UWBP_CraftCategory_C*                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature");
static_assert(sizeof(WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature) == 0x000008, "Wrong size on WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature");
static_assert(offsetof(WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature, Category) == 0x000000, "Member 'WBP_CraftCategory_C_OnSelectedCategory__DelegateSignature::Category' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnSelectedCategoryItem__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature final
{
public:
	class UWBP_CraftCategory_C*                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature");
static_assert(sizeof(WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature) == 0x000010, "Wrong size on WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature");
static_assert(offsetof(WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature, Category) == 0x000000, "Member 'WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature::Category' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature, Item) == 0x000008, "Member 'WBP_CraftCategory_C_OnSelectedCategoryItem__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.OnSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_OnSelectedItem final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_OnSelectedItem) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_OnSelectedItem");
static_assert(sizeof(WBP_CraftCategory_C_OnSelectedItem) == 0x000008, "Wrong size on WBP_CraftCategory_C_OnSelectedItem");
static_assert(offsetof(WBP_CraftCategory_C_OnSelectedItem, Item) == 0x000000, "Member 'WBP_CraftCategory_C_OnSelectedItem::Item' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CraftCategory_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CraftCategory_C_PreConstruct");
static_assert(sizeof(WBP_CraftCategory_C_PreConstruct) == 0x000001, "Wrong size on WBP_CraftCategory_C_PreConstruct");
static_assert(offsetof(WBP_CraftCategory_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CraftCategory_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.RemoveItem
// 0x0058 (0x0058 - 0x0000)
struct WBP_CraftCategory_C_RemoveItem final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_RemoveItem) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_RemoveItem");
static_assert(sizeof(WBP_CraftCategory_C_RemoveItem) == 0x000058, "Wrong size on WBP_CraftCategory_C_RemoveItem");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, Item) == 0x000000, "Member 'WBP_CraftCategory_C_RemoveItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, Param_Index) == 0x000008, "Member 'WBP_CraftCategory_C_RemoveItem::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_RemoveChild_ReturnValue) == 0x00000D, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_CraftCategory_C_RemoveItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000020, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_RemoveItem_ReturnValue) == 0x00002E, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Length_ReturnValue_2) == 0x000040, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Find_ReturnValue) == 0x000044, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_RemoveItem, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_CraftCategory_C_RemoveItem::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.SetScrollable
// 0x0001 (0x0001 - 0x0000)
struct WBP_CraftCategory_C_SetScrollable final
{
public:
	bool                                          Param_IsScrollable;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_SetScrollable) == 0x000001, "Wrong alignment on WBP_CraftCategory_C_SetScrollable");
static_assert(sizeof(WBP_CraftCategory_C_SetScrollable) == 0x000001, "Wrong size on WBP_CraftCategory_C_SetScrollable");
static_assert(offsetof(WBP_CraftCategory_C_SetScrollable, Param_IsScrollable) == 0x000000, "Member 'WBP_CraftCategory_C_SetScrollable::Param_IsScrollable' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.StartCraftSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_StartCraftSelected final
{
public:
	class ABP_CraftStation_C*                     WorkbenchRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_StartCraftSelected) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_StartCraftSelected");
static_assert(sizeof(WBP_CraftCategory_C_StartCraftSelected) == 0x000008, "Wrong size on WBP_CraftCategory_C_StartCraftSelected");
static_assert(offsetof(WBP_CraftCategory_C_StartCraftSelected, WorkbenchRef) == 0x000000, "Member 'WBP_CraftCategory_C_StartCraftSelected::WorkbenchRef' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.StartDismantleSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_StartDismantleSelected final
{
public:
	class ABP_CraftStation_C*                     WorkbenchRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_StartDismantleSelected) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_StartDismantleSelected");
static_assert(sizeof(WBP_CraftCategory_C_StartDismantleSelected) == 0x000008, "Wrong size on WBP_CraftCategory_C_StartDismantleSelected");
static_assert(offsetof(WBP_CraftCategory_C_StartDismantleSelected, WorkbenchRef) == 0x000000, "Member 'WBP_CraftCategory_C_StartDismantleSelected::WorkbenchRef' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.StopCraftSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_StopCraftSelected final
{
public:
	class ABP_CraftStation_C*                     WorkbenchRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_StopCraftSelected) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_StopCraftSelected");
static_assert(sizeof(WBP_CraftCategory_C_StopCraftSelected) == 0x000008, "Wrong size on WBP_CraftCategory_C_StopCraftSelected");
static_assert(offsetof(WBP_CraftCategory_C_StopCraftSelected, WorkbenchRef) == 0x000000, "Member 'WBP_CraftCategory_C_StopCraftSelected::WorkbenchRef' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.StopDismantleSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftCategory_C_StopDismantleSelected final
{
public:
	class ABP_CraftStation_C*                     WorkbenchRef;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_StopDismantleSelected) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_StopDismantleSelected");
static_assert(sizeof(WBP_CraftCategory_C_StopDismantleSelected) == 0x000008, "Wrong size on WBP_CraftCategory_C_StopDismantleSelected");
static_assert(offsetof(WBP_CraftCategory_C_StopDismantleSelected, WorkbenchRef) == 0x000000, "Member 'WBP_CraftCategory_C_StopDismantleSelected::WorkbenchRef' has a wrong offset!");

// Function WBP_CraftCategory.WBP_CraftCategory_C.UpdateCounts
// 0x0020 (0x0020 - 0x0000)
struct WBP_CraftCategory_C_UpdateCounts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftCategory_C_UpdateCounts) == 0x000008, "Wrong alignment on WBP_CraftCategory_C_UpdateCounts");
static_assert(sizeof(WBP_CraftCategory_C_UpdateCounts) == 0x000020, "Wrong size on WBP_CraftCategory_C_UpdateCounts");
static_assert(offsetof(WBP_CraftCategory_C_UpdateCounts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CraftCategory_C_UpdateCounts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_UpdateCounts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CraftCategory_C_UpdateCounts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftCategory_C_UpdateCounts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CraftCategory_C_UpdateCounts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
