#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCreate

#include "Basic.hpp"

#include "WE_BodyTypes_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "S_CharacterClasses_structs.hpp"
#include "S_StatInfo_structs.hpp"
#include "WS_CharaterPerks_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "WS_BodyFeatures_structs.hpp"
#include "WE_BodyFeatures_structs.hpp"
#include "Enum_WarningMessageType_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.Add Child Widgets (Color)
// 0x0118 (0x0118 - 0x0000)
struct WBP_CharacterCreate_C_Add_Child_Widgets__Color_ final
{
public:
	EWE_BodyFeatures                              BodyCategory;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RowCounter;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                      Curr_UniformGrid;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ColumnsCounter;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_ColorCell_C* CellActivated)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ColorCell_C*                         CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_BodyFeatures                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0088)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_Add_Child_Widgets__Color_");
static_assert(sizeof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_) == 0x000118, "Wrong size on WBP_CharacterCreate_C_Add_Child_Widgets__Color_");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, BodyCategory) == 0x000000, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::BodyCategory' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, RowCounter) == 0x000004, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::RowCounter' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, Curr_UniformGrid) == 0x000008, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::Curr_UniformGrid' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, ColumnsCounter) == 0x000010, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::ColumnsCounter' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, Temp_int_Variable) == 0x000014, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, K2Node_SwitchEnum_CmpSuccess) == 0x000024, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000026, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00002D, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, Temp_int_Variable_1) == 0x000030, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000034, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_IsValid_ReturnValue_2) == 0x000035, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Add_IntInt_ReturnValue_2) == 0x000048, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_Less_IntInt_ReturnValue) == 0x000109, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010A, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_Add_Child_Widgets__Color_, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000110, "Member 'WBP_CharacterCreate_C_Add_Child_Widgets__Color_::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.AddChildWidgets (Face)
// 0x0348 (0x0348 - 0x0000)
struct WBP_CharacterCreate_C_AddChildWidgets__Face_ final
{
public:
	EWE_BodyTypes                                 Param_BodyType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              BodyCategory;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumOfRowsInGrid;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        W_ChildrenOfGrid;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UUniformGridPanel*                      W_Grid;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<EWE_BodyFeatures, class UUniformGridPanel*> W_UIGrids;                                         // 0x0020(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Param_Index;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWS_BodyFeatures                       Features;                                          // 0x0078(0x0088)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          FunctionResult;                                    // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UW_BodyTypeCell_C* BodyTypeCell)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              Temp_byte_Variable;                                // 0x013C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              Temp_byte_Variable_1;                              // 0x0158(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWE_BodyFeatures, class UUniformGridPanel*> K2Node_MakeVariable_MakeVariableOutput;            // 0x0160(0x0050)(ContainsInstancedReference)
	EWE_BodyFeatures                              Temp_byte_Variable_2;                              // 0x01B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              Temp_byte_Variable_3;                              // 0x01E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              Temp_byte_Variable_4;                              // 0x01E1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BodyTypeCell_C*                      K2Node_DynamicCast_AsW_Body_Type_Cell;             // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridPanel*                      CallFunc_Map_Find_Value;                           // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0218(0x0010)(ReferenceParm, ContainsInstancedReference)
	EWE_BodyFeatures                              Temp_byte_Variable_5;                              // 0x0228(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_BodyTypeCell_C*                      CallFunc_Create_ReturnValue;                       // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BodyTypeCell_C*                      K2Node_DynamicCast_AsW_Body_Type_Cell_1;           // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UW_BodyTypeCell_C* CurrentCell)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWE_BodyFeatures                              Temp_byte_Variable_6;                              // 0x0295(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0298(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWS_BodyFeatures                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x02B0(0x0088)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_AddChildWidgets__Face_) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_AddChildWidgets__Face_");
static_assert(sizeof(WBP_CharacterCreate_C_AddChildWidgets__Face_) == 0x000348, "Wrong size on WBP_CharacterCreate_C_AddChildWidgets__Face_");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Param_BodyType) == 0x000000, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Param_BodyType' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, BodyCategory) == 0x000001, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::BodyCategory' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Result) == 0x000002, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, NumOfRowsInGrid) == 0x000004, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::NumOfRowsInGrid' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, W_ChildrenOfGrid) == 0x000008, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::W_ChildrenOfGrid' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, W_Grid) == 0x000018, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::W_Grid' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, W_UIGrids) == 0x000020, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::W_UIGrids' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Param_Index) == 0x000070, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Features) == 0x000078, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Features' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, FunctionResult) == 0x000100, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::FunctionResult' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_CreateDelegate_OutputDelegate) == 0x000104, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_CreateDelegate_OutputDelegate_2) == 0x00012C, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable) == 0x00013C, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Array_Index_Variable) == 0x000140, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000144, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Variable) == 0x00014C, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Add_IntInt_ReturnValue_1) == 0x000154, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_1) == 0x000158, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_MakeVariable_MakeVariableOutput) == 0x000160, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_2) == 0x0001B0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_LastIndex_ReturnValue) == 0x0001C0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Length_ReturnValue_1) == 0x0001C4, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001C8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C9, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Variable_1) == 0x0001CC, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetChildrenCount_ReturnValue) == 0x0001D0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Divide_IntInt_ReturnValue) == 0x0001D4, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001D8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Percent_IntInt_ReturnValue) == 0x0001DC, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_3) == 0x0001E0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_4) == 0x0001E1, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Get_Item_1) == 0x0001E8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_DynamicCast_AsW_Body_Type_Cell) == 0x0001F0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_DynamicCast_AsW_Body_Type_Cell' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001FC, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Map_Find_Value) == 0x000208, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Map_Find_ReturnValue) == 0x000210, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetAllChildren_ReturnValue) == 0x000218, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_5) == 0x000228, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetOwningPlayer_ReturnValue) == 0x000230, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Create_ReturnValue) == 0x000238, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Add_ReturnValue) == 0x000240, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000248, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Variable_2) == 0x000250, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_int_Variable_3) == 0x000254, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_bool_Variable) == 0x000258, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_Select_Default) == 0x00025C, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000260, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Get_Item_2) == 0x000268, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000270, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_DynamicCast_AsW_Body_Type_Cell_1) == 0x000278, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_DynamicCast_AsW_Body_Type_Cell_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_DynamicCast_bSuccess_1) == 0x000280, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_BooleanOR_ReturnValue) == 0x000281, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_IsValid_ReturnValue_1) == 0x000282, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000283, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, K2Node_CreateDelegate_OutputDelegate_3) == 0x000284, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_BooleanAND_ReturnValue) == 0x000294, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, Temp_byte_Variable_6) == 0x000295, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000298, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Get_Item_3) == 0x0002A8, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002B0, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000338, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_Length_ReturnValue_2) == 0x00033C, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Less_IntInt_ReturnValue_1) == 0x000340, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_AddChildWidgets__Face_, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000341, "Member 'WBP_CharacterCreate_C_AddChildWidgets__Face_::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BindedEvent_ActivateCell_Color
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color final
{
public:
	class UW_ColorCell_C*                         ColorCellActivated;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color");
static_assert(sizeof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color) == 0x000008, "Wrong size on WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color");
static_assert(offsetof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color, ColorCellActivated) == 0x000000, "Member 'WBP_CharacterCreate_C_BindedEvent_ActivateCell_Color::ColorCellActivated' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BindedEvent_ActivateCell_Type
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type final
{
public:
	class UW_BodyTypeCell_C*                      TypeCellActivated;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type");
static_assert(sizeof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type) == 0x000008, "Wrong size on WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type");
static_assert(offsetof(WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type, TypeCellActivated) == 0x000000, "Member 'WBP_CharacterCreate_C_BindedEvent_ActivateCell_Type::TypeCellActivated' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BlendViewCamera
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterCreate_C_BlendViewCamera final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_CloseCamera_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BlendViewCamera) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_BlendViewCamera");
static_assert(sizeof(WBP_CharacterCreate_C_BlendViewCamera) == 0x000038, "Wrong size on WBP_CharacterCreate_C_BlendViewCamera");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, BlendTime) == 0x000000, "Member 'WBP_CharacterCreate_C_BlendViewCamera::BlendTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, BlendFunc) == 0x000004, "Member 'WBP_CharacterCreate_C_BlendViewCamera::BlendFunc' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, BlendExp) == 0x000008, "Member 'WBP_CharacterCreate_C_BlendViewCamera::BlendExp' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'WBP_CharacterCreate_C_BlendViewCamera::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_CharacterCreate_C_BlendViewCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_CharacterCreate_C_BlendViewCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterCreate_C_BlendViewCamera::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCamera, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_CharacterCreate_C_BlendViewCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BlendViewCameraClose
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterCreate_C_BlendViewCameraClose final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_CloseCamera_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CreateCharacter_C*                  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BlendViewCameraClose) == 0x000008, "Wrong alignment on WBP_CharacterCreate_C_BlendViewCameraClose");
static_assert(sizeof(WBP_CharacterCreate_C_BlendViewCameraClose) == 0x000038, "Wrong size on WBP_CharacterCreate_C_BlendViewCameraClose");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, BlendTime) == 0x000000, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::BlendTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, BlendFunc) == 0x000004, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::BlendFunc' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, BlendExp) == 0x000008, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::BlendExp' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, CallFunc_GetActorOfClass_ReturnValue) == 0x000010, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreate_C_BlendViewCameraClose, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_CharacterCreate_C_BlendViewCameraClose::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BlockGlossMetallic
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterCreate_C_BlockGlossMetallic final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BlockGlossMetallic) == 0x000004, "Wrong alignment on WBP_CharacterCreate_C_BlockGlossMetallic");
static_assert(sizeof(WBP_CharacterCreate_C_BlockGlossMetallic) == 0x000004, "Wrong size on WBP_CharacterCreate_C_BlockGlossMetallic");
static_assert(offsetof(WBP_CharacterCreate_C_BlockGlossMetallic, Param_Index) == 0x000000, "Member 'WBP_CharacterCreate_C_BlockGlossMetallic::Param_Index' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BlockTattooDepthColor
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterCreate_C_BlockTattooDepthColor final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreate_C_BlockTattooDepthColor) == 0x000004, "Wrong alignment on WBP_CharacterCreate_C_BlockTattooDepthColor");
static_assert(sizeof(WBP_CharacterCreate_C_BlockTattooDepthColor) == 0x000004, "Wrong size on WBP_CharacterCreate_C_BlockTattooDepthColor");
static_assert(offsetof(WBP_CharacterCreate_C_BlockTattooDepthColor, Param_Index) == 0x000000, "Member 'WBP_CharacterCreate_C_BlockTattooDepthColor::Param_Index' has a wrong offset!");

// Function WBP_CharacterCreate.WBP_CharacterCreate_C.BndEvt__WBP_CharacterCreate_Slider_BeardColor_K2Node_ComponentBoundEvent_46_ButtonSlider__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCreate_C_BndEvt__WBP_CharacterCreate_Slider_BeardColor_K2Node_ComponentBoundEvent_46_ButtonSlider__DelegateSignature final
{
public:
