#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CoinIntro

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CoinIntro.WBP_CoinIntro_C
// 0x0030 (0x02B0 - 0x0280)
class UWBP_CoinIntro_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ExpandFntasticLogo;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLogo;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Fntastic;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MyTona;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Logo;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CoinIntro(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ShowLogo_Fntastic(bool bShow);
	void ShowLogo_MyTona(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CoinIntro_C">();
	}
	static class UWBP_CoinIntro_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CoinIntro_C>();
	}
};
static_assert(alignof(UWBP_CoinIntro_C) == 0x000008, "Wrong alignment on UWBP_CoinIntro_C");
static_assert(sizeof(UWBP_CoinIntro_C) == 0x0002B0, "Wrong size on UWBP_CoinIntro_C");
static_assert(offsetof(UWBP_CoinIntro_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CoinIntro_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CoinIntro_C, ExpandFntasticLogo) == 0x000288, "Member 'UWBP_CoinIntro_C::ExpandFntasticLogo' has a wrong offset!");
static_assert(offsetof(UWBP_CoinIntro_C, ShowLogo) == 0x000290, "Member 'UWBP_CoinIntro_C::ShowLogo' has a wrong offset!");
static_assert(offsetof(UWBP_CoinIntro_C, Image_Fntastic) == 0x000298, "Member 'UWBP_CoinIntro_C::Image_Fntastic' has a wrong offset!");
static_assert(offsetof(UWBP_CoinIntro_C, Image_MyTona) == 0x0002A0, "Member 'UWBP_CoinIntro_C::Image_MyTona' has a wrong offset!");
static_assert(offsetof(UWBP_CoinIntro_C, WidgetSwitcher_Logo) == 0x0002A8, "Member 'UWBP_CoinIntro_C::WidgetSwitcher_Logo' has a wrong offset!");

}

