#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarShopAcceptBuyWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarShopAcceptBuyWindow.WBP_CarShopAcceptBuyWindow_C
// 0x0098 (0x0318 - 0x0280)
class UWBP_CarShopAcceptBuyWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_DisconnectAccept;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_DisconnectDecline;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Message;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Message;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x02C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Title;                                             // 0x02D8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsNeededLeftButton;                               // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPressedConfirm;                                  // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressedCancel;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_CarShopAcceptBuyWindow_Button_DisconnectAccept_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__WBP_CarShopAcceptBuyWindow_Button_DisconnectDecline_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature();
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_WBP_CarShopAcceptBuyWindow(int32 EntryPoint);
	void Finished_8198FB3747FA0BEBD451A791D795F89C();
	void Finished_A6641B254C17F3983C3279B5196F0CCB();
	void OnCancel();
	void OnConfirm();
	void OnPressedCancel__DelegateSignature();
	void OnPressedConfirm__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarShopAcceptBuyWindow_C">();
	}
	static class UWBP_CarShopAcceptBuyWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarShopAcceptBuyWindow_C>();
	}
};
static_assert(alignof(UWBP_CarShopAcceptBuyWindow_C) == 0x000008, "Wrong alignment on UWBP_CarShopAcceptBuyWindow_C");
static_assert(sizeof(UWBP_CarShopAcceptBuyWindow_C) == 0x000318, "Wrong size on UWBP_CarShopAcceptBuyWindow_C");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CarShopAcceptBuyWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Show) == 0x000288, "Member 'UWBP_CarShopAcceptBuyWindow_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Button_DisconnectAccept) == 0x000290, "Member 'UWBP_CarShopAcceptBuyWindow_C::Button_DisconnectAccept' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Button_DisconnectDecline) == 0x000298, "Member 'UWBP_CarShopAcceptBuyWindow_C::Button_DisconnectDecline' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Image_BG) == 0x0002A0, "Member 'UWBP_CarShopAcceptBuyWindow_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Text_Message) == 0x0002A8, "Member 'UWBP_CarShopAcceptBuyWindow_C::Text_Message' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Text_Title) == 0x0002B0, "Member 'UWBP_CarShopAcceptBuyWindow_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, WidgetSwitcher_Message) == 0x0002B8, "Member 'UWBP_CarShopAcceptBuyWindow_C::WidgetSwitcher_Message' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Message) == 0x0002C0, "Member 'UWBP_CarShopAcceptBuyWindow_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, Title) == 0x0002D8, "Member 'UWBP_CarShopAcceptBuyWindow_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, bIsNeededLeftButton) == 0x0002F0, "Member 'UWBP_CarShopAcceptBuyWindow_C::bIsNeededLeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, OnPressedConfirm) == 0x0002F8, "Member 'UWBP_CarShopAcceptBuyWindow_C::OnPressedConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_CarShopAcceptBuyWindow_C, OnPressedCancel) == 0x000308, "Member 'UWBP_CarShopAcceptBuyWindow_C::OnPressedCancel' has a wrong offset!");

}

