#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialItemReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialItemReward.WBP_TutorialItemReward_C
// 0x0060 (0x02E0 - 0x0280)
class UWBP_TutorialItemReward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_ModalWindowButton_C*                 Button_Continue;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ScreenSpace;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_AdditionalContent;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemDescription;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemName;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemUsage;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyIcon_C*                         WBP_KeyIcon;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClosed;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_TutorialItemReward_Button_60_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_TutorialItemReward_Button_Continue_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void Close();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_TutorialItemReward(int32 EntryPoint);
	void Finished_DD7CD6344FFBE50AA8C988A6D2AB141C();
	void OnClosed__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetInfo(class FName SlideName);
	void SetInputButtonContent(class FName Input);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialItemReward_C">();
	}
	static class UWBP_TutorialItemReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialItemReward_C>();
	}
};
static_assert(alignof(UWBP_TutorialItemReward_C) == 0x000008, "Wrong alignment on UWBP_TutorialItemReward_C");
static_assert(sizeof(UWBP_TutorialItemReward_C) == 0x0002E0, "Wrong size on UWBP_TutorialItemReward_C");
static_assert(offsetof(UWBP_TutorialItemReward_C, UberGraphFrame) == 0x000280, "Member 'UWBP_TutorialItemReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, Show) == 0x000288, "Member 'UWBP_TutorialItemReward_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, Button_Continue) == 0x000290, "Member 'UWBP_TutorialItemReward_C::Button_Continue' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, Button_ScreenSpace) == 0x000298, "Member 'UWBP_TutorialItemReward_C::Button_ScreenSpace' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, Image_Icon) == 0x0002A0, "Member 'UWBP_TutorialItemReward_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, SizeBox_AdditionalContent) == 0x0002A8, "Member 'UWBP_TutorialItemReward_C::SizeBox_AdditionalContent' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, TextBlock_ItemDescription) == 0x0002B0, "Member 'UWBP_TutorialItemReward_C::TextBlock_ItemDescription' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, TextBlock_ItemName) == 0x0002B8, "Member 'UWBP_TutorialItemReward_C::TextBlock_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, TextBlock_ItemUsage) == 0x0002C0, "Member 'UWBP_TutorialItemReward_C::TextBlock_ItemUsage' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, WBP_KeyIcon) == 0x0002C8, "Member 'UWBP_TutorialItemReward_C::WBP_KeyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialItemReward_C, OnClosed) == 0x0002D0, "Member 'UWBP_TutorialItemReward_C::OnClosed' has a wrong offset!");

}

