#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BinocularsHint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BinocularsHint.WBP_BinocularsHint_C
// 0x0038 (0x02B8 - 0x0280)
class UWBP_BinocularsHint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowHint_Anim;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Hint;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyIcon_C*                         WBP_KeyIcon;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   MappingName;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      Survival_Player;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckBinocularsState();
	void Construct();
	void ExecuteUbergraph_WBP_BinocularsHint(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Show(bool Param_Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BinocularsHint_C">();
	}
	static class UWBP_BinocularsHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BinocularsHint_C>();
	}
};
static_assert(alignof(UWBP_BinocularsHint_C) == 0x000008, "Wrong alignment on UWBP_BinocularsHint_C");
static_assert(sizeof(UWBP_BinocularsHint_C) == 0x0002B8, "Wrong size on UWBP_BinocularsHint_C");
static_assert(offsetof(UWBP_BinocularsHint_C, UberGraphFrame) == 0x000280, "Member 'UWBP_BinocularsHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, ShowHint_Anim) == 0x000288, "Member 'UWBP_BinocularsHint_C::ShowHint_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, HorizontalBox_Hint) == 0x000290, "Member 'UWBP_BinocularsHint_C::HorizontalBox_Hint' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, WBP_KeyIcon) == 0x000298, "Member 'UWBP_BinocularsHint_C::WBP_KeyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, MappingName) == 0x0002A0, "Member 'UWBP_BinocularsHint_C::MappingName' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, Showed) == 0x0002A8, "Member 'UWBP_BinocularsHint_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularsHint_C, Survival_Player) == 0x0002B0, "Member 'UWBP_BinocularsHint_C::Survival_Player' has a wrong offset!");

}

