#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterRow.WBP_CharacterRow_C
// 0x0078 (0x02F8 - 0x0280)
class UWBP_CharacterRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ToggleFocus;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_83;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Delete;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Delete;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerIcon;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ButtonDelete;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DaysOfSurvival;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerName;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_144;                                     // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedDelete;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           OnHoverTimerHandle;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Focused;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterRow_Button_83_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterRow_Button_Delete_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterRow_Button_Edit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_CharacterRow(int32 EntryPoint);
	class FText GetNamePlayer();
	class FText GetValueDaysOfSurvival();
	void OnClickedDelete__DelegateSignature();
	void OnCreateHoverTimerHandler();
	void OnFocus(bool NewState);
	void OnHoverTimerHandler();
	void OnPlayAnimation(class UWidgetAnimation* Animation, bool NewState);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterRow_C">();
	}
	static class UWBP_CharacterRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterRow_C>();
	}
};
static_assert(alignof(UWBP_CharacterRow_C) == 0x000008, "Wrong alignment on UWBP_CharacterRow_C");
static_assert(sizeof(UWBP_CharacterRow_C) == 0x0002F8, "Wrong size on UWBP_CharacterRow_C");
static_assert(offsetof(UWBP_CharacterRow_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CharacterRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, ToggleFocus) == 0x000288, "Member 'UWBP_CharacterRow_C::ToggleFocus' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Button_83) == 0x000290, "Member 'UWBP_CharacterRow_C::Button_83' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Button_Delete) == 0x000298, "Member 'UWBP_CharacterRow_C::Button_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Image_Delete) == 0x0002A0, "Member 'UWBP_CharacterRow_C::Image_Delete' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Image_PlayerIcon) == 0x0002A8, "Member 'UWBP_CharacterRow_C::Image_PlayerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Image_Selected) == 0x0002B0, "Member 'UWBP_CharacterRow_C::Image_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, SizeBox_ButtonDelete) == 0x0002B8, "Member 'UWBP_CharacterRow_C::SizeBox_ButtonDelete' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Text_DaysOfSurvival) == 0x0002C0, "Member 'UWBP_CharacterRow_C::Text_DaysOfSurvival' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Text_PlayerName) == 0x0002C8, "Member 'UWBP_CharacterRow_C::Text_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, TextBlock_144) == 0x0002D0, "Member 'UWBP_CharacterRow_C::TextBlock_144' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, OnClickedDelete) == 0x0002D8, "Member 'UWBP_CharacterRow_C::OnClickedDelete' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, OnHoverTimerHandle) == 0x0002E8, "Member 'UWBP_CharacterRow_C::OnHoverTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Focused) == 0x0002F0, "Member 'UWBP_CharacterRow_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterRow_C, Value) == 0x0002F4, "Member 'UWBP_CharacterRow_C::Value' has a wrong offset!");

}

