#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CarGame.WBP_CarGame_C.BeginTimerTick
// 0x0020 (0x0020 - 0x0000)
struct WBP_CarGame_C_BeginTimerTick final
{
public:
	double                                        Temp_real_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_BeginTimerTick) == 0x000008, "Wrong alignment on WBP_CarGame_C_BeginTimerTick");
static_assert(sizeof(WBP_CarGame_C_BeginTimerTick) == 0x000020, "Wrong size on WBP_CarGame_C_BeginTimerTick");
static_assert(offsetof(WBP_CarGame_C_BeginTimerTick, Temp_real_Variable) == 0x000000, "Member 'WBP_CarGame_C_BeginTimerTick::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_BeginTimerTick, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_CarGame_C_BeginTimerTick::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_BeginTimerTick, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_CarGame_C_BeginTimerTick::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_BeginTimerTick, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_CarGame_C_BeginTimerTick::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.CheckRange
// 0x0020 (0x0020 - 0x0000)
struct WBP_CarGame_C_CheckRange final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_CheckRange) == 0x000008, "Wrong alignment on WBP_CarGame_C_CheckRange");
static_assert(sizeof(WBP_CarGame_C_CheckRange) == 0x000020, "Wrong size on WBP_CarGame_C_CheckRange");
static_assert(offsetof(WBP_CarGame_C_CheckRange, Value) == 0x000000, "Member 'WBP_CarGame_C_CheckRange::Value' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_CheckRange, Result) == 0x000008, "Member 'WBP_CarGame_C_CheckRange::Result' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_CheckRange, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_CarGame_C_CheckRange::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_CheckRange, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_CarGame_C_CheckRange::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.ExecuteUbergraph_WBP_CarGame
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRange_Result;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00F0(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0120(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0160(0x0018)()
	class UWBP_LifeIndicator_C*                   K2Node_DynamicCast_AsWBP_Life_Indicator;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           Temp_object_Variable;                              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Temp_object_Variable_1;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_Select_Default_1;                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x01B0(0x00D0)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0290(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LifeIndicator_C*                   K2Node_DynamicCast_AsWBP_Life_Indicator_1;         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CheckRange_Value_ImplicitCast;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinValue_InValue_ImplicitCast;         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMaxValue_InValue_ImplicitCast;         // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame) == 0x000010, "Wrong alignment on WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame");
static_assert(sizeof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame) == 0x0002F0, "Wrong size on WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, EntryPoint) == 0x000000, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_FTrunc_ReturnValue) == 0x000024, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_bool_Variable) == 0x000058, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_Event_IsDesignTime) == 0x000059, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_Event_MyGeometry) == 0x00005C, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_Event_InDeltaTime) == 0x000094, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x0000A0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetValue_ReturnValue) == 0x0000A4, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_CheckRange_Result) == 0x0000A8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_CheckRange_Result' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_BreakVector2D_X) == 0x0000B0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_BreakVector2D_Y) == 0x0000B8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000C8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000D0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_int_Variable) == 0x0000D8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_AsSurvival_Player) == 0x0000E0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_text_Variable) == 0x0000F0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000108, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_AsSurvival_Player_1) == 0x000110, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_AsSurvival_Player_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Subtract_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_text_Variable_1) == 0x000120, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_PlayAnimationForward_ReturnValue) == 0x000138, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerController_ReturnValue_3) == 0x000140, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetChildrenCount_ReturnValue) == 0x000148, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_bool_Variable_1) == 0x00014C, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000150, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetChildAt_ReturnValue) == 0x000158, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_Select_Default) == 0x000160, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_AsWBP_Life_Indicator) == 0x000178, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_AsWBP_Life_Indicator' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_object_Variable) == 0x000188, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, Temp_object_Variable_1) == 0x000190, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000198, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_Select_Default_1) == 0x0001A0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0001B0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000280, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000288, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetAllChildren_ReturnValue) == 0x000290, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Array_Get_Item) == 0x0002A0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0002A8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_AsWBP_Life_Indicator_1) == 0x0002B0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_AsWBP_Life_Indicator_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, K2Node_DynamicCast_bSuccess_3) == 0x0002B8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_BooleanAND_ReturnValue) == 0x0002B9, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Array_Length_ReturnValue) == 0x0002BC, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_Less_IntInt_ReturnValue) == 0x0002C0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_GetPlayerController_ReturnValue_4) == 0x0002C8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_K2_GetPawn_ReturnValue_1) == 0x0002D0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_CheckRange_Value_ImplicitCast) == 0x0002D8, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_CheckRange_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_SetMinValue_InValue_ImplicitCast) == 0x0002E0, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_SetMinValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame, CallFunc_SetMaxValue_InValue_ImplicitCast) == 0x0002E4, "Member 'WBP_CarGame_C_ExecuteUbergraph_WBP_CarGame::CallFunc_SetMaxValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.GenerateRangePosition
// 0x0030 (0x0030 - 0x0000)
struct WBP_CarGame_C_GenerateRangePosition final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_GenerateRangePosition) == 0x000008, "Wrong alignment on WBP_CarGame_C_GenerateRangePosition");
static_assert(sizeof(WBP_CarGame_C_GenerateRangePosition) == 0x000030, "Wrong size on WBP_CarGame_C_GenerateRangePosition");
static_assert(offsetof(WBP_CarGame_C_GenerateRangePosition, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'WBP_CarGame_C_GenerateRangePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_GenerateRangePosition, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_CarGame_C_GenerateRangePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_GenerateRangePosition, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_CarGame_C_GenerateRangePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_GenerateRangePosition, CallFunc_RandomFloatInRange_ReturnValue) == 0x000020, "Member 'WBP_CarGame_C_GenerateRangePosition::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_GenerateRangePosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WBP_CarGame_C_GenerateRangePosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CarGame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CarGame_C_PreConstruct");
static_assert(sizeof(WBP_CarGame_C_PreConstruct) == 0x000001, "Wrong size on WBP_CarGame_C_PreConstruct");
static_assert(offsetof(WBP_CarGame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CarGame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.Reset
// 0x0008 (0x0008 - 0x0000)
struct WBP_CarGame_C_Reset final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_Reset) == 0x000008, "Wrong alignment on WBP_CarGame_C_Reset");
static_assert(sizeof(WBP_CarGame_C_Reset) == 0x000008, "Wrong size on WBP_CarGame_C_Reset");
static_assert(offsetof(WBP_CarGame_C_Reset, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'WBP_CarGame_C_Reset::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.SliderTimerTick
// 0x0038 (0x0038 - 0x0000)
struct WBP_CarGame_C_SliderTimerTick final
{
public:
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_SliderTimerTick) == 0x000008, "Wrong alignment on WBP_CarGame_C_SliderTimerTick");
static_assert(sizeof(WBP_CarGame_C_SliderTimerTick) == 0x000038, "Wrong size on WBP_CarGame_C_SliderTimerTick");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_GetValue_ReturnValue) == 0x000000, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_GetValue_ReturnValue_1) == 0x000008, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_SliderTimerTick, CallFunc_SetValue_InValue_ImplicitCast) == 0x000030, "Member 'WBP_CarGame_C_SliderTimerTick::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.StartSliderTimer
// 0x0030 (0x0030 - 0x0000)
struct WBP_CarGame_C_StartSliderTimer final
{
public:
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_StartSliderTimer) == 0x000008, "Wrong alignment on WBP_CarGame_C_StartSliderTimer");
static_assert(sizeof(WBP_CarGame_C_StartSliderTimer) == 0x000030, "Wrong size on WBP_CarGame_C_StartSliderTimer");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_StartSliderTimer, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'WBP_CarGame_C_StartSliderTimer::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function WBP_CarGame.WBP_CarGame_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CarGame_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarGame_C_Tick) == 0x000004, "Wrong alignment on WBP_CarGame_C_Tick");
static_assert(sizeof(WBP_CarGame_C_Tick) == 0x00003C, "Wrong size on WBP_CarGame_C_Tick");
static_assert(offsetof(WBP_CarGame_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CarGame_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CarGame_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CarGame_C_Tick::InDeltaTime' has a wrong offset!");

}

