#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HuntingRifleCrosshair

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HuntingRifleCrosshair.WBP_HuntingRifleCrosshair_C
// 0x0038 (0x02B8 - 0x0280)
class UWBP_HuntingRifleCrosshair_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ready_Anim;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_dot;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Aim(bool Param_Aim);
	void ExecuteUbergraph_WBP_HuntingRifleCrosshair(int32 EntryPoint);
	void Hit();
	void Kill();
	void Shoot(bool Shooting, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HuntingRifleCrosshair_C">();
	}
	static class UWBP_HuntingRifleCrosshair_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HuntingRifleCrosshair_C>();
	}
};
static_assert(alignof(UWBP_HuntingRifleCrosshair_C) == 0x000008, "Wrong alignment on UWBP_HuntingRifleCrosshair_C");
static_assert(sizeof(UWBP_HuntingRifleCrosshair_C) == 0x0002B8, "Wrong size on UWBP_HuntingRifleCrosshair_C");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, UberGraphFrame) == 0x000280, "Member 'UWBP_HuntingRifleCrosshair_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Ready_Anim) == 0x000288, "Member 'UWBP_HuntingRifleCrosshair_C::Ready_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Image) == 0x000290, "Member 'UWBP_HuntingRifleCrosshair_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Image_2) == 0x000298, "Member 'UWBP_HuntingRifleCrosshair_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Image_3) == 0x0002A0, "Member 'UWBP_HuntingRifleCrosshair_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Image_4) == 0x0002A8, "Member 'UWBP_HuntingRifleCrosshair_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_HuntingRifleCrosshair_C, Image_dot) == 0x0002B0, "Member 'UWBP_HuntingRifleCrosshair_C::Image_dot' has a wrong offset!");

}

