#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkbenchCraft

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_WorkbenchTabTypes_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_NeedItems_structs.hpp"
#include "S_WorkbenchCraftCategory_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "S_CategoryData_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature final
{
public:
	struct FS_CategoryData                        CategoryData;                                      // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          All;                                               // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000050, "Wrong size on WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature, CategoryData) == 0x000000, "Member 'WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature::CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature, All) == 0x000048, "Member 'WBP_WorkbenchCraft_C_BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature::All' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.CanCraftItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorkbenchCraft_C_CanCraftItem final
{
public:
	class UWBP_CraftItem_C*                       ItemRef;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Add_or_Equip_Item_Return;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_CanCraftItem) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_CanCraftItem");
static_assert(sizeof(WBP_WorkbenchCraft_C_CanCraftItem) == 0x000028, "Wrong size on WBP_WorkbenchCraft_C_CanCraftItem");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, ItemRef) == 0x000000, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::ItemRef' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, Return) == 0x000008, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::Return' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, K2Node_DynamicCast_AsSurvival_Player) == 0x000018, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, CallFunc_Can_Add_or_Equip_Item_Return) == 0x000021, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::CallFunc_Can_Add_or_Equip_Item_Return' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_CanCraftItem, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'WBP_WorkbenchCraft_C_CanCraftItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.ChangeWeaponCounter
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorkbenchCraft_C_ChangeWeaponCounter final
{
public:
	class UWBP_CraftCategory_C*                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_ChangeWeaponCounter) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_ChangeWeaponCounter");
static_assert(sizeof(WBP_WorkbenchCraft_C_ChangeWeaponCounter) == 0x000010, "Wrong size on WBP_WorkbenchCraft_C_ChangeWeaponCounter");
static_assert(offsetof(WBP_WorkbenchCraft_C_ChangeWeaponCounter, Category) == 0x000000, "Member 'WBP_WorkbenchCraft_C_ChangeWeaponCounter::Category' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ChangeWeaponCounter, Item) == 0x000008, "Member 'WBP_WorkbenchCraft_C_ChangeWeaponCounter::Item' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.CraftItemSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkbenchCraft_C_CraftItemSelected final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_CraftItemSelected) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_CraftItemSelected");
static_assert(sizeof(WBP_WorkbenchCraft_C_CraftItemSelected) == 0x000008, "Wrong size on WBP_WorkbenchCraft_C_CraftItemSelected");
static_assert(offsetof(WBP_WorkbenchCraft_C_CraftItemSelected, Item) == 0x000000, "Member 'WBP_WorkbenchCraft_C_CraftItemSelected::Item' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.ExecuteUbergraph_WBP_WorkbenchCraft
// 0x0460 (0x0460 - 0x0000)
struct WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_6;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_CategoryData                        K2Node_ComponentBoundEvent_CategoryData;           // 0x0060(0x0048)(HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_All;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_5;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ShopCategoryButton_C*                CallFunc_GetCurrentButtonRef_ButtonRef;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CraftCategoryButton_C*               K2Node_DynamicCast_AsW_Craft_Category_Button;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCategoryName_CategoryName_;            // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_4;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCraftitem_Return;                      // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_107[0x1];                                      // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_3;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_2;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_WorkbenchTabTypes                           K2Node_CustomEvent_CurrentTab;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             K2Node_CustomEvent_NewModelInfo;                   // 0x0188(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsScetch;                      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftCategory_C*                   K2Node_CustomEvent_Category;                       // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       K2Node_CustomEvent_Item;                           // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_NeedItems>                   K2Node_CustomEvent_Ingredients;                    // 0x03C8(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  K2Node_CustomEvent_AvailableResources;             // 0x03D8(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftCategory_C*                   CallFunc_Array_Get_Item_1;                         // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item_2;                         // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_Image_0;                        // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_CustomEvent_VerticalBox_Info;               // 0x0418(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item_3;                         // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item_4;                         // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(E_WorkbenchTabTypes CurrentTab)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0450(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft");
static_assert(sizeof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft) == 0x000460, "Wrong size on WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, EntryPoint) == 0x000000, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_6) == 0x000020, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Not_PreBool_ReturnValue) == 0x00004C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000050, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000058, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_ComponentBoundEvent_CategoryData) == 0x000060, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_ComponentBoundEvent_CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_ComponentBoundEvent_All) == 0x0000A8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_ComponentBoundEvent_All' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_5) == 0x0000B0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_GetCurrentButtonRef_ButtonRef) == 0x0000B8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_GetCurrentButtonRef_ButtonRef' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_DynamicCast_AsW_Craft_Category_Button) == 0x0000D0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_DynamicCast_AsW_Craft_Category_Button' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_GetCategoryName_CategoryName_) == 0x0000DC, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_GetCategoryName_CategoryName_' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E4, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_4) == 0x0000F8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Array_Index_Variable) == 0x000100, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_IsValid_ReturnValue_2) == 0x000104, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_IsValid_ReturnValue_3) == 0x000105, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_CanCraftitem_Return) == 0x000106, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_CanCraftitem_Return' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_3) == 0x000108, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Not_PreBool_ReturnValue_1) == 0x000110, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Length_ReturnValue_1) == 0x000128, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Get_Item) == 0x000130, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_5) == 0x000138, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000148, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_6) == 0x000150, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_2) == 0x000160, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item_1) == 0x000168, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_CurrentTab) == 0x000170, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_CurrentTab' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000171, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000178, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000180, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_NewModelInfo) == 0x000188, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_NewModelInfo' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_bIsScetch) == 0x0003A8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_bIsScetch' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Loop_Counter_Variable_1) == 0x0003AC, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Less_IntInt_ReturnValue) == 0x0003B0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003B4, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Category) == 0x0003B8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Category' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Item) == 0x0003C0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Ingredients) == 0x0003C8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Ingredients' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_AvailableResources) == 0x0003D8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_AvailableResources' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Array_Index_Variable_1) == 0x0003E8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Length_ReturnValue_2) == 0x0003EC, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Get_Item_1) == 0x0003F0, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Get_Item_2) == 0x0003F8, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Length_ReturnValue_3) == 0x000400, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Less_IntInt_ReturnValue_1) == 0x000404, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_Image_0) == 0x000408, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_Image_0' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Loop_Counter_Variable_2) == 0x000410, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CustomEvent_VerticalBox_Info) == 0x000418, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CustomEvent_VerticalBox_Info' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Less_IntInt_ReturnValue_2) == 0x000420, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Add_IntInt_ReturnValue_2) == 0x000424, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Array_Index_Variable_2) == 0x000428, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Get_Item_3) == 0x000430, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Loop_Counter_Variable_3) == 0x000438, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, Temp_int_Array_Index_Variable_3) == 0x00043C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Array_Get_Item_4) == 0x000440, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Less_IntInt_ReturnValue_3) == 0x000448, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, CallFunc_Add_IntInt_ReturnValue_3) == 0x00044C, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft, K2Node_CreateDelegate_OutputDelegate_7) == 0x000450, "Member 'WBP_WorkbenchCraft_C_ExecuteUbergraph_WBP_WorkbenchCraft::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.GetCategoryByName
// 0x0060 (0x0060 - 0x0000)
struct WBP_WorkbenchCraft_C_GetCategoryByName final
{
public:
	class FText                                   CategoryName;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_CraftCategory_C*                   CategoryRef;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftCategory_C*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCategoryName_CategoryName;             // 0x0040(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_GetCategoryByName) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_GetCategoryByName");
static_assert(sizeof(WBP_WorkbenchCraft_C_GetCategoryByName) == 0x000060, "Wrong size on WBP_WorkbenchCraft_C_GetCategoryByName");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CategoryName) == 0x000000, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CategoryName' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CategoryRef) == 0x000018, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CategoryRef' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_GetCategoryName_CategoryName) == 0x000040, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_GetCategoryName_CategoryName' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_GetCategoryByName, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000058, "Member 'WBP_WorkbenchCraft_C_GetCategoryByName::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.Image_0_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkbenchCraft_C_Image_0_Event_0 final
{
public:
	class UImage*                                 Image_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_Image_0_Event_0) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_Image_0_Event_0");
static_assert(sizeof(WBP_WorkbenchCraft_C_Image_0_Event_0) == 0x000008, "Wrong size on WBP_WorkbenchCraft_C_Image_0_Event_0");
static_assert(offsetof(WBP_WorkbenchCraft_C_Image_0_Event_0, Image_0) == 0x000000, "Member 'WBP_WorkbenchCraft_C_Image_0_Event_0::Image_0' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.InitCategories
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorkbenchCraft_C_InitCategories final
{
public:
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0000(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_WorkbenchCraft_C_InitCategories) == 0x000008, "Wrong alignment on WBP_WorkbenchCraft_C_InitCategories");
static_assert(sizeof(WBP_WorkbenchCraft_C_InitCategories) == 0x000010, "Wrong size on WBP_WorkbenchCraft_C_InitCategories");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitCategories, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000000, "Member 'WBP_WorkbenchCraft_C_InitCategories::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");

// Function WBP_WorkbenchCraft.WBP_WorkbenchCraft_C.InitItems
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_WorkbenchCraft_C_InitItems final
{
public:
	class FName                                   CraftCategoryName;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CurrentItemWidget;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentItemName;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_WorkbenchCraftCategory              CategoryData;                                      // 0x0018(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bIsCategoryValid;                                  // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentColumn;                                     // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRow;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_WorkbenchCraftCategory              CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_CraftItem_C* Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0140(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CraftItem_C*                       CallFunc_Create_ReturnValue_2;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_2;      // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x02B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x02CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchCraft_C_InitItems) == 0x000010, "Wrong alignment on WBP_WorkbenchCraft_C_InitItems");
static_assert(sizeof(WBP_WorkbenchCraft_C_InitItems) == 0x0002E0, "Wrong size on WBP_WorkbenchCraft_C_InitItems");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CraftCategoryName) == 0x000000, "Member 'WBP_WorkbenchCraft_C_InitItems::CraftCategoryName' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CurrentItemWidget) == 0x000008, "Member 'WBP_WorkbenchCraft_C_InitItems::CurrentItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CurrentItemName) == 0x000010, "Member 'WBP_WorkbenchCraft_C_InitItems::CurrentItemName' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CategoryData) == 0x000018, "Member 'WBP_WorkbenchCraft_C_InitItems::CategoryData' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, bIsCategoryValid) == 0x000058, "Member 'WBP_WorkbenchCraft_C_InitItems::bIsCategoryValid' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CurrentColumn) == 0x00005C, "Member 'WBP_WorkbenchCraft_C_InitItems::CurrentColumn' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CurrentRow) == 0x000060, "Member 'WBP_WorkbenchCraft_C_InitItems::CurrentRow' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CallFunc_GetDataTableRowFromName_OutRow) == 0x000068, "Member 'WBP_WorkbenchCraft_C_InitItems::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A8, "Member 'WBP_WorkbenchCraft_C_InitItems::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'WBP_WorkbenchCraft_C_InitItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_WorkbenchCraft_C_InitItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WBP_WorkbenchCraft_C_InitItems::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, K2Node_MakeStruct_Margin) == 0x0000C0, "Member 'WBP_WorkbenchCraft_C_InitItems::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x0000D0, "Member 'WBP_WorkbenchCraft_C_InitItems::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, K2Node_MakeStruct_Margin_1) == 0x0000D8, "Member 'WBP_WorkbenchCraft_C_InitItems::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchCraft_C_InitItems, Temp_int_Loop_Counter_Variable) == 0x0000E8, "Member 'WBP_WorkbenchCraft_C_InitItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
