#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FurnitureShopSlot

#include "Basic.hpp"

#include "E_FurnitureShopSlot_structs.hpp"
#include "F_FurnitureUpgradeHouseInfo_structs.hpp"
#include "F_FurnitureShopItem_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.ExecuteUbergraph_WBP_FurnitureShopSlot
// 0x0050 (0x0050 - 0x0000)
struct WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot");
static_assert(sizeof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot) == 0x000050, "Wrong size on WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, EntryPoint) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000024, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000025, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000026, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, K2Node_Event_IsDesignTime) == 0x000027, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, K2Node_DynamicCast_AsSurv_PC) == 0x000030, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000039, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_GetIsBeginner_IsBeginner) == 0x00003A, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_PlayEvent2D_ReturnValue) == 0x000040, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000048, "Member 'WBP_FurnitureShopSlot_C_ExecuteUbergraph_WBP_FurnitureShopSlot::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.GetFurnitureSlotInfo
// 0x0098 (0x0098 - 0x0000)
struct WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo final
{
public:
	struct FF_FurnitureShopItem                   Param_InfoSlot;                                    // 0x0000(0x0098)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo");
static_assert(sizeof(WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo) == 0x000098, "Wrong size on WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo");
static_assert(offsetof(WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_GetFurnitureSlotInfo::Param_InfoSlot' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.GetHouseSlotInfo
// 0x0060 (0x0060 - 0x0000)
struct WBP_FurnitureShopSlot_C_GetHouseSlotInfo final
{
public:
	struct FF_FurnitureUpgradeHouseInfo           Param_InfoSlot;                                    // 0x0000(0x0060)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_GetHouseSlotInfo) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_GetHouseSlotInfo");
static_assert(sizeof(WBP_FurnitureShopSlot_C_GetHouseSlotInfo) == 0x000060, "Wrong size on WBP_FurnitureShopSlot_C_GetHouseSlotInfo");
static_assert(offsetof(WBP_FurnitureShopSlot_C_GetHouseSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_GetHouseSlotInfo::Param_InfoSlot' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.GetSlotStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_FurnitureShopSlot_C_GetSlotStatus final
{
public:
	E_FurnitureShopSlot                           Param_SlotStatus;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_GetSlotStatus) == 0x000001, "Wrong alignment on WBP_FurnitureShopSlot_C_GetSlotStatus");
static_assert(sizeof(WBP_FurnitureShopSlot_C_GetSlotStatus) == 0x000001, "Wrong size on WBP_FurnitureShopSlot_C_GetSlotStatus");
static_assert(offsetof(WBP_FurnitureShopSlot_C_GetSlotStatus, Param_SlotStatus) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_GetSlotStatus::Param_SlotStatus' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.OnHoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature final
{
public:
	class UWBP_FurnitureShopSlot_C*               HoveredSlot;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature, HoveredSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_OnHoveredSlot__DelegateSignature::HoveredSlot' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.OnSelectedSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature final
{
public:
	class UWBP_FurnitureShopSlot_C*               PressedFurnitureSlot;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature");
static_assert(sizeof(WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature");
static_assert(offsetof(WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature, PressedFurnitureSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_OnSelectedSlot__DelegateSignature::PressedFurnitureSlot' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.OnUnhoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature final
{
public:
	class UWBP_FurnitureShopSlot_C*               UnhoveredSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature, UnhoveredSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_OnUnhoveredSlot__DelegateSignature::UnhoveredSlot' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FurnitureShopSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FurnitureShopSlot_C_PreConstruct");
static_assert(sizeof(WBP_FurnitureShopSlot_C_PreConstruct) == 0x000001, "Wrong size on WBP_FurnitureShopSlot_C_PreConstruct");
static_assert(offsetof(WBP_FurnitureShopSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.ResetTextForDeutchLocalization
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
};
static_assert(alignof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization");
static_assert(sizeof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization) == 0x0000A0, "Wrong size on WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_GetText_ReturnValue_1) == 0x000018, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000040, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Replace_ReturnValue) == 0x000050, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Replace_ReturnValue_1) == 0x000060, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'WBP_FurnitureShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.SetHouseSlotInfo
// 0x0078 (0x0078 - 0x0000)
struct WBP_FurnitureShopSlot_C_SetHouseSlotInfo final
{
public:
	struct FF_FurnitureUpgradeHouseInfo           Param_InfoSlot;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(WBP_FurnitureShopSlot_C_SetHouseSlotInfo) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_SetHouseSlotInfo");
static_assert(sizeof(WBP_FurnitureShopSlot_C_SetHouseSlotInfo) == 0x000078, "Wrong size on WBP_FurnitureShopSlot_C_SetHouseSlotInfo");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetHouseSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_SetHouseSlotInfo::Param_InfoSlot' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetHouseSlotInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000060, "Member 'WBP_FurnitureShopSlot_C_SetHouseSlotInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C.SetSlotInfo
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_FurnitureShopSlot_C_SetSlotInfo final
{
public:
	struct FF_FurnitureShopItem                   Param_InfoSlot;                                    // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00A0(0x0018)()
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureShopSlot_C_SetSlotInfo) == 0x000008, "Wrong alignment on WBP_FurnitureShopSlot_C_SetSlotInfo");
static_assert(sizeof(WBP_FurnitureShopSlot_C_SetSlotInfo) == 0x0000C8, "Wrong size on WBP_FurnitureShopSlot_C_SetSlotInfo");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_FurnitureShopSlot_C_SetSlotInfo::Param_InfoSlot' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetSlotInfo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000098, "Member 'WBP_FurnitureShopSlot_C_SetSlotInfo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetSlotInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000A0, "Member 'WBP_FurnitureShopSlot_C_SetSlotInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetSlotInfo, K2Node_DynamicCast_AsPaper_Sprite) == 0x0000B8, "Member 'WBP_FurnitureShopSlot_C_SetSlotInfo::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureShopSlot_C_SetSlotInfo, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_FurnitureShopSlot_C_SetSlotInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

