#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputHints

#include "Basic.hpp"

#include "ENUM_ButtonHintType_structs.hpp"
#include "S_InputHints_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputHints.WBP_InputHints_C.ExecuteUbergraph_WBP_InputHints
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsBeginner_IsBeginner_1;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_2;                    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SlidesTutorial_C*                  CallFunc_GetTutorialSlidesWidget_Widget;           // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_GetKey_Key;                               // 0x0138(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_2;                     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SlidesTutorial_C*                  CallFunc_GetTutorialSlidesWidget_Widget_1;         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_3;                     // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_2;               // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SlidesTutorial_C*                  CallFunc_GetTutorialSlidesWidget_Widget_2;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints) == 0x000008, "Wrong alignment on WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints");
static_assert(sizeof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints) == 0x0001E8, "Wrong size on WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, EntryPoint) == 0x000000, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_bool_Variable) == 0x000004, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_byte_Variable) == 0x000005, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetIsBeginner_IsBeginner) == 0x000007, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetIsBeginner_IsBeginner' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_Select_Default) == 0x000008, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetPlayerController_ReturnValue_1) == 0x000018, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetHUD_ReturnValue) == 0x000020, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsSurv_PC) == 0x000028, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsBP_Game_HUD) == 0x000038, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsBP_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetIsBeginner_IsBeginner_1) == 0x000041, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetIsBeginner_IsBeginner_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetPlayerController_ReturnValue_2) == 0x000058, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_SelectFloat_ReturnValue) == 0x000060, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsSurv_PC_1) == 0x000068, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_bool_Has_Been_Initd_Variable) == 0x000071, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_bool_IsClosed_Variable) == 0x000072, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_byte_Variable_2) == 0x000073, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CustomEvent_Show) == 0x0000B0, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000B1, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_Event_IsDesignTime) == 0x0000B3, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B4, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000C4, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000D8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000E0, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_byte_Variable_3) == 0x0000E8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsSurv_PC_2) == 0x0000F0, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsSurv_PC_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetHUD_ReturnValue_1) == 0x000100, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_6) == 0x000108, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000118, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetTutorialSlidesWidget_Widget) == 0x000130, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetTutorialSlidesWidget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetKey_Key) == 0x000138, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetKey_Key' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000151, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_BooleanOR_ReturnValue) == 0x000152, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000153, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_SelectFloat_ReturnValue_1) == 0x000158, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, Temp_bool_Variable_1) == 0x000160, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_Select_Default_1) == 0x000161, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetHUD_ReturnValue_2) == 0x000168, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetHUD_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000170, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_5) == 0x000180, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetTutorialSlidesWidget_Widget_1) == 0x000188, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetTutorialSlidesWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetHUD_ReturnValue_3) == 0x000190, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetHUD_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_AsBPI_Game_HUD_2) == 0x000198, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_AsBPI_Game_HUD_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_DynamicCast_bSuccess_6) == 0x0001A8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_IsValid_ReturnValue_1) == 0x0001A9, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_GetTutorialSlidesWidget_Widget_2) == 0x0001B0, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_GetTutorialSlidesWidget_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_IsValid_ReturnValue_2) == 0x0001B8, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001BC, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001CC, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0001DC, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x0001E0, "Member 'WBP_InputHints_C_ExecuteUbergraph_WBP_InputHints::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_InputHints.WBP_InputHints_C.GetInputAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_InputHints_C_GetInputAction final
{
public:
	class FName                                   Param_Input_Action;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_GetInputAction) == 0x000004, "Wrong alignment on WBP_InputHints_C_GetInputAction");
static_assert(sizeof(WBP_InputHints_C_GetInputAction) == 0x000008, "Wrong size on WBP_InputHints_C_GetInputAction");
static_assert(offsetof(WBP_InputHints_C_GetInputAction, Param_Input_Action) == 0x000000, "Member 'WBP_InputHints_C_GetInputAction::Param_Input_Action' has a wrong offset!");

// Function WBP_InputHints.WBP_InputHints_C.HintByTutorialStageIndex
// 0x0148 (0x0148 - 0x0000)
struct WBP_InputHints_C_HintByTutorialStageIndex final
{
public:
	class FString                                 QuestStage;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	TMap<class FString, class FName>              InputByIndex;                                      // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, class FName>              K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BlackScreen_C*                       CallFunc_GetBlackScreenWidget_Widget;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGUIHidden_Hidden;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName BindInputActionForCatalog)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FurnitureShopButtons_C*            CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value;                           // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_HintByTutorialStageIndex) == 0x000008, "Wrong alignment on WBP_InputHints_C_HintByTutorialStageIndex");
static_assert(sizeof(WBP_InputHints_C_HintByTutorialStageIndex) == 0x000148, "Wrong size on WBP_InputHints_C_HintByTutorialStageIndex");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, QuestStage) == 0x000000, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::QuestStage' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, InputByIndex) == 0x000010, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::InputByIndex' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_MakeVariable_MakeVariableOutput) == 0x000060, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000B0, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_Not_PreBool_ReturnValue) == 0x0000B1, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_Contains_ReturnValue) == 0x0000B2, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x0000C8, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000E0, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_GetBlackScreenWidget_Widget) == 0x0000F8, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_GetBlackScreenWidget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_GetGUIHidden_Hidden) == 0x000100, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_GetGUIHidden_Hidden' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_IsValid_ReturnValue_1) == 0x000102, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_CreateDelegate_OutputDelegate_1) == 0x000104, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x000118, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_IsValid_ReturnValue_2) == 0x000129, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons) == 0x000130, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_IsValid_ReturnValue_3) == 0x000138, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_IsInViewport_ReturnValue) == 0x000139, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_Map_Find_Value) == 0x00013C, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_HintByTutorialStageIndex, CallFunc_Map_Find_ReturnValue) == 0x000144, "Member 'WBP_InputHints_C_HintByTutorialStageIndex::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_InputHints.WBP_InputHints_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputHints_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InputHints_C_PreConstruct");
static_assert(sizeof(WBP_InputHints_C_PreConstruct) == 0x000001, "Wrong size on WBP_InputHints_C_PreConstruct");
static_assert(offsetof(WBP_InputHints_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InputHints_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_InputHints.WBP_InputHints_C.SetInfo
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_InputHints_C_SetInfo final
{
public:
	class FName                                   InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InputHints                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FurnitureShopButtons_C*            CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ENUM_ButtonHintType                           Temp_byte_Variable_2;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0118(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0130(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0148(0x0018)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0168(0x0018)()
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0180(0x0010)(ReferenceParm)
	struct FKey                                   K2Node_Select_Default_3;                           // 0x0190(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_SetInfo) == 0x000008, "Wrong alignment on WBP_InputHints_C_SetInfo");
static_assert(sizeof(WBP_InputHints_C_SetInfo) == 0x0001A8, "Wrong size on WBP_InputHints_C_SetInfo");
static_assert(offsetof(WBP_InputHints_C_SetInfo, InputAction) == 0x000000, "Member 'WBP_InputHints_C_SetInfo::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_bool_Variable) == 0x000008, "Member 'WBP_InputHints_C_SetInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_name_Variable) == 0x00000C, "Member 'WBP_InputHints_C_SetInfo::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_bool_Variable_1) == 0x000014, "Member 'WBP_InputHints_C_SetInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_byte_Variable) == 0x000015, "Member 'WBP_InputHints_C_SetInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_InputHints_C_SetInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_bool_Variable_2) == 0x000017, "Member 'WBP_InputHints_C_SetInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_struct_Variable) == 0x000018, "Member 'WBP_InputHints_C_SetInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000030, "Member 'WBP_InputHints_C_SetInfo::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000038, "Member 'WBP_InputHints_C_SetInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'WBP_InputHints_C_SetInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_Select_Default) == 0x00005C, "Member 'WBP_InputHints_C_SetInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000064, "Member 'WBP_InputHints_C_SetInfo::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_InputHints_C_SetInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_InputHints_C_SetInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C8, "Member 'WBP_InputHints_C_SetInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_InputHints_C_SetInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_Select_Default_1) == 0x0000E8, "Member 'WBP_InputHints_C_SetInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000E9, "Member 'WBP_InputHints_C_SetInfo::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x0000F0, "Member 'WBP_InputHints_C_SetInfo::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_InputHints_C_SetInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'WBP_InputHints_C_SetInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons) == 0x000108, "Member 'WBP_InputHints_C_SetInfo::CallFunc_GetFurnitureCatalogRef_FurnitureShopButtons' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_byte_Variable_2) == 0x000110, "Member 'WBP_InputHints_C_SetInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_text_Variable) == 0x000118, "Member 'WBP_InputHints_C_SetInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_text_Variable_1) == 0x000130, "Member 'WBP_InputHints_C_SetInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, Temp_text_Variable_2) == 0x000148, "Member 'WBP_InputHints_C_SetInfo::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_GetInputSettings_ReturnValue) == 0x000160, "Member 'WBP_InputHints_C_SetInfo::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_Select_Default_2) == 0x000168, "Member 'WBP_InputHints_C_SetInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, CallFunc_GetActionMappingByName_OutMappings) == 0x000180, "Member 'WBP_InputHints_C_SetInfo::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(WBP_InputHints_C_SetInfo, K2Node_Select_Default_3) == 0x000190, "Member 'WBP_InputHints_C_SetInfo::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_InputHints.WBP_InputHints_C.Show
// 0x0001 (0x0001 - 0x0000)
struct WBP_InputHints_C_Show final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputHints_C_Show) == 0x000001, "Wrong alignment on WBP_InputHints_C_Show");
static_assert(sizeof(WBP_InputHints_C_Show) == 0x000001, "Wrong size on WBP_InputHints_C_Show");
static_assert(offsetof(WBP_InputHints_C_Show, Param_Show) == 0x000000, "Member 'WBP_InputHints_C_Show::Param_Show' has a wrong offset!");

}

