#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ChatType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ChatWindow.WBP_ChatWindow_C
// 0x00A8 (0x0328 - 0x0280)
class UWBP_ChatWindow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowChatEntryCareful;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowChatLog;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeChatLog;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowChatEntry;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowInput_Anim;                                    // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowChat_Anim;                                     // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_TogglrMicro;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ChatEntry;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ChatLog;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Input;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ChatBG;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ChatBG_1;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ChatEntry_C*                         W_ChatEntry;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_MicroState;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ChatShowed;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputShowed;                                       // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShowAfterMessageDuration;                          // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMessageSent;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Slot_1_occupied;                                   // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Slot_2_occupied;                                   // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Slot_3_occupied;                                   // 0x0313(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Slot_4_occupied;                                   // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ShowChatEntryFinished;                             // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__ChatWindow_Button_239_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ChatWindow_Button_TogglrMicro_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature(const class FText& Text, ETextCommit Commit_method);
	void CloseChat(bool ShowMessages);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_ChatWindow(int32 EntryPoint);
	void FadeLogSlot1();
	void FadeLogSlot2();
	void FadeLogSlot3();
	void FadeLogSlot4();
	void MaxLogChecking();
	void ParseText(const class FText& InText, class FString* Output_Get);
	void PreConstruct(bool IsDesignTime);
	void SetChatType();
	void ShowChat(bool Show);
	void ShowChatEntryFinished__DelegateSignature();
	void ShowInput(bool Show);
	void StartTimer();
	void UpdateChatWindow(const class FText& Sender, const class FText& Text, EChatType ChatType);
	void WidgetAnimationEvt_ShowChatEntry_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_ShowChatEntryCareful_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ChatWindow_C">();
	}
	static class UWBP_ChatWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ChatWindow_C>();
	}
};
static_assert(alignof(UWBP_ChatWindow_C) == 0x000008, "Wrong alignment on UWBP_ChatWindow_C");
static_assert(sizeof(UWBP_ChatWindow_C) == 0x000328, "Wrong size on UWBP_ChatWindow_C");
static_assert(offsetof(UWBP_ChatWindow_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ChatWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowChatEntryCareful) == 0x000288, "Member 'UWBP_ChatWindow_C::ShowChatEntryCareful' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowChatLog) == 0x000290, "Member 'UWBP_ChatWindow_C::ShowChatLog' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, FadeChatLog) == 0x000298, "Member 'UWBP_ChatWindow_C::FadeChatLog' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowChatEntry) == 0x0002A0, "Member 'UWBP_ChatWindow_C::ShowChatEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowInput_Anim) == 0x0002A8, "Member 'UWBP_ChatWindow_C::ShowInput_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowChat_Anim) == 0x0002B0, "Member 'UWBP_ChatWindow_C::ShowChat_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Button_Close) == 0x0002B8, "Member 'UWBP_ChatWindow_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Button_TogglrMicro) == 0x0002C0, "Member 'UWBP_ChatWindow_C::Button_TogglrMicro' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ChatEntry) == 0x0002C8, "Member 'UWBP_ChatWindow_C::ChatEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ChatLog) == 0x0002D0, "Member 'UWBP_ChatWindow_C::ChatLog' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, HorizontalBox_Input) == 0x0002D8, "Member 'UWBP_ChatWindow_C::HorizontalBox_Input' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Image_ChatBG) == 0x0002E0, "Member 'UWBP_ChatWindow_C::Image_ChatBG' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Image_ChatBG_1) == 0x0002E8, "Member 'UWBP_ChatWindow_C::Image_ChatBG_1' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, VerticalBox_Content) == 0x0002F0, "Member 'UWBP_ChatWindow_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, W_ChatEntry) == 0x0002F8, "Member 'UWBP_ChatWindow_C::W_ChatEntry' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, WidgetSwitcher_MicroState) == 0x000300, "Member 'UWBP_ChatWindow_C::WidgetSwitcher_MicroState' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ChatShowed) == 0x000308, "Member 'UWBP_ChatWindow_C::ChatShowed' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, InputShowed) == 0x000309, "Member 'UWBP_ChatWindow_C::InputShowed' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowAfterMessageDuration) == 0x00030C, "Member 'UWBP_ChatWindow_C::ShowAfterMessageDuration' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, bMessageSent) == 0x000310, "Member 'UWBP_ChatWindow_C::bMessageSent' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Slot_1_occupied) == 0x000311, "Member 'UWBP_ChatWindow_C::Slot_1_occupied' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Slot_2_occupied) == 0x000312, "Member 'UWBP_ChatWindow_C::Slot_2_occupied' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Slot_3_occupied) == 0x000313, "Member 'UWBP_ChatWindow_C::Slot_3_occupied' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, Slot_4_occupied) == 0x000314, "Member 'UWBP_ChatWindow_C::Slot_4_occupied' has a wrong offset!");
static_assert(offsetof(UWBP_ChatWindow_C, ShowChatEntryFinished) == 0x000318, "Member 'UWBP_ChatWindow_C::ShowChatEntryFinished' has a wrong offset!");

}

