#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialObjective.WBP_TutorialObjective_C
// 0x0220 (0x04A0 - 0x0280)
class UWBP_TutorialObjective_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Objective;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_QuestName;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Messages;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UQuestContext*                          Context;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Node_Index;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MessageText;                                       // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuestName;                                         // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<int32>                                   ExcludeFromDisaplayIndexes;                        // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<int32>                                   ExcludeFromDirectDisaplayIndexes;                  // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Current_Stage;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TSet<class FString>                           ExcludeFromDisaplayStages;                         // 0x03C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<class FString>                           ExcludeFromDirectDisaplayStages;                   // 0x0410(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MessageText_Old;                                   // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuestName_Old;                                     // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnTryShowNewTask;                                  // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckOpenedInventoryToShowObjective();
	void CheckWidgetStates();
	void Construct();
	void ExecuteUbergraph_WBP_TutorialObjective(int32 EntryPoint);
	void InstantHide();
	void IsEqualBothText(bool* IsEqual);
	void OnQuestContextCreated_Event(class UQuestComponent* QuestComponent, class UQuestContext* Param_Context);
	void OnTryShowNewTask__DelegateSignature(bool bIsShowed);
	void ParseButton(const class FText& OriginalText, class FText* ParsedText);
	void PreConstruct(bool IsDesignTime);
	void SetEqualBothText();
	void SetQuestText(bool* WasTextEmpty);
	void ShowByCachedInfo();
	void ShowGeneralObjective(bool Show, const class FText& Param_QuestName, const class FText& Param_MessageText);
	void ShowTutorialObjective(bool Show, const class FText& Param_QuestName, const class FText& Param_MessageText);
	void Unbind();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialObjective_C">();
	}
	static class UWBP_TutorialObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialObjective_C>();
	}
};
static_assert(alignof(UWBP_TutorialObjective_C) == 0x000008, "Wrong alignment on UWBP_TutorialObjective_C");
static_assert(sizeof(UWBP_TutorialObjective_C) == 0x0004A0, "Wrong size on UWBP_TutorialObjective_C");
static_assert(offsetof(UWBP_TutorialObjective_C, UberGraphFrame) == 0x000280, "Member 'UWBP_TutorialObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, HideAnim) == 0x000288, "Member 'UWBP_TutorialObjective_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, ShowAnim) == 0x000290, "Member 'UWBP_TutorialObjective_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, RichTextBlock_Objective) == 0x000298, "Member 'UWBP_TutorialObjective_C::RichTextBlock_Objective' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, SizeBox) == 0x0002A0, "Member 'UWBP_TutorialObjective_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Text_QuestName) == 0x0002A8, "Member 'UWBP_TutorialObjective_C::Text_QuestName' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Showed) == 0x0002B0, "Member 'UWBP_TutorialObjective_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Messages) == 0x0002B8, "Member 'UWBP_TutorialObjective_C::Messages' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, As_Surv_PC) == 0x0002C8, "Member 'UWBP_TutorialObjective_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Context) == 0x0002D0, "Member 'UWBP_TutorialObjective_C::Context' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Node_Index) == 0x0002D8, "Member 'UWBP_TutorialObjective_C::Node_Index' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, MessageText) == 0x0002E0, "Member 'UWBP_TutorialObjective_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, QuestName) == 0x0002F8, "Member 'UWBP_TutorialObjective_C::QuestName' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, ExcludeFromDisaplayIndexes) == 0x000310, "Member 'UWBP_TutorialObjective_C::ExcludeFromDisaplayIndexes' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, ExcludeFromDirectDisaplayIndexes) == 0x000360, "Member 'UWBP_TutorialObjective_C::ExcludeFromDirectDisaplayIndexes' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, Current_Stage) == 0x0003B0, "Member 'UWBP_TutorialObjective_C::Current_Stage' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, ExcludeFromDisaplayStages) == 0x0003C0, "Member 'UWBP_TutorialObjective_C::ExcludeFromDisaplayStages' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, ExcludeFromDirectDisaplayStages) == 0x000410, "Member 'UWBP_TutorialObjective_C::ExcludeFromDirectDisaplayStages' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, MessageText_Old) == 0x000460, "Member 'UWBP_TutorialObjective_C::MessageText_Old' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, QuestName_Old) == 0x000478, "Member 'UWBP_TutorialObjective_C::QuestName_Old' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialObjective_C, OnTryShowNewTask) == 0x000490, "Member 'UWBP_TutorialObjective_C::OnTryShowNewTask' has a wrong offset!");

}

