#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponCategory

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"


namespace SDK::Params
{

// Function WBP_WeaponCategory.WBP_WeaponCategory_C.ExecuteUbergraph_WBP_WeaponCategory
// 0x0360 (0x0360 - 0x0000)
struct WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponRow_C*                       CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponRow_C*                       CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_FindItems__Valid__Result;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CallFunc_FindItems__Valid__ValidItems;             // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_Array_Get_Item_3;                         // 0x0100(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class UWBP_WeaponRow_C*                       K2Node_DynamicCast_AsWBP_Weapon_Row;               // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedByUID_ReturnValue;              // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_WeaponRow_C*                       CallFunc_Array_Get_Item_4;                         // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0350(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory) == 0x000008, "Wrong alignment on WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory");
static_assert(sizeof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory) == 0x000360, "Wrong size on WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, EntryPoint) == 0x000000, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_AsSurvival_Player) == 0x000028, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_AsUser_Widget) == 0x000058, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_GetAllChildren_ReturnValue) == 0x000068, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_AddChild_ReturnValue) == 0x000078, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Loop_Counter_Variable_1) == 0x000080, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Array_Index_Variable_2) == 0x000084, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Add_IntInt_ReturnValue_2) == 0x00008C, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_CustomEvent_Index) == 0x000090, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_AddChild_ReturnValue_1) == 0x000098, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A1, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000A2, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Loop_Counter_Variable_2) == 0x0000A4, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000A8, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Loop_Counter_Variable_3) == 0x0000AC, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Variable) == 0x0000B0, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000B4, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Length_ReturnValue_2) == 0x0000C8, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000CC, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000D0, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_FindItems__Valid__Result) == 0x0000E0, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_FindItems__Valid__Result' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_FindItems__Valid__ValidItems) == 0x0000E8, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_FindItems__Valid__ValidItems' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Get_Item_3) == 0x000100, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_AsWBP_Weapon_Row) == 0x000320, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_AsWBP_Weapon_Row' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_DynamicCast_bSuccess_2) == 0x000328, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Length_ReturnValue_3) == 0x00032C, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_SwitchEnum_CmpSuccess) == 0x000330, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Less_IntInt_ReturnValue_3) == 0x000331, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_IsEquippedByUID_ReturnValue) == 0x000332, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_IsEquippedByUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000333, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, Temp_int_Array_Index_Variable_3) == 0x000334, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_Array_Get_Item_4) == 0x000338, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_AddChild_ReturnValue_2) == 0x000340, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, CallFunc_AddChild_ReturnValue_3) == 0x000348, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory, K2Node_CreateDelegate_OutputDelegate) == 0x000350, "Member 'WBP_WeaponCategory_C_ExecuteUbergraph_WBP_WeaponCategory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_WeaponCategory.WBP_WeaponCategory_C.FillListWithEmptySlots
// 0x0040 (0x0040 - 0x0000)
struct WBP_WeaponCategory_C_FillListWithEmptySlots final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_WeaponRow_C*                       CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCategory_C_FillListWithEmptySlots) == 0x000008, "Wrong alignment on WBP_WeaponCategory_C_FillListWithEmptySlots");
static_assert(sizeof(WBP_WeaponCategory_C_FillListWithEmptySlots) == 0x000040, "Wrong size on WBP_WeaponCategory_C_FillListWithEmptySlots");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, Temp_int_Variable) == 0x000000, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_FillListWithEmptySlots, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_WeaponCategory_C_FillListWithEmptySlots::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_WeaponCategory.WBP_WeaponCategory_C.SelectCategory
// 0x0004 (0x0004 - 0x0000)
struct WBP_WeaponCategory_C_SelectCategory final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCategory_C_SelectCategory) == 0x000004, "Wrong alignment on WBP_WeaponCategory_C_SelectCategory");
static_assert(sizeof(WBP_WeaponCategory_C_SelectCategory) == 0x000004, "Wrong size on WBP_WeaponCategory_C_SelectCategory");
static_assert(offsetof(WBP_WeaponCategory_C_SelectCategory, Param_Index) == 0x000000, "Member 'WBP_WeaponCategory_C_SelectCategory::Param_Index' has a wrong offset!");

// Function WBP_WeaponCategory.WBP_WeaponCategory_C.SetEntryPadding
// 0x0030 (0x0030 - 0x0000)
struct WBP_WeaponCategory_C_SetEntryPadding final
{
public:
	class UUserWidget*                            Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCategory_C_SetEntryPadding) == 0x000008, "Wrong alignment on WBP_WeaponCategory_C_SetEntryPadding");
static_assert(sizeof(WBP_WeaponCategory_C_SetEntryPadding) == 0x000030, "Wrong size on WBP_WeaponCategory_C_SetEntryPadding");
static_assert(offsetof(WBP_WeaponCategory_C_SetEntryPadding, Entry) == 0x000000, "Member 'WBP_WeaponCategory_C_SetEntryPadding::Entry' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_SetEntryPadding, CallFunc_HasAnyChildren_ReturnValue) == 0x000008, "Member 'WBP_WeaponCategory_C_SetEntryPadding::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_SetEntryPadding, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_WeaponCategory_C_SetEntryPadding::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_SetEntryPadding, K2Node_MakeStruct_Margin) == 0x000018, "Member 'WBP_WeaponCategory_C_SetEntryPadding::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_SetEntryPadding, K2Node_MakeStruct_Top_ImplicitCast) == 0x000028, "Member 'WBP_WeaponCategory_C_SetEntryPadding::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");

// Function WBP_WeaponCategory.WBP_WeaponCategory_C.ValidateWeaponRows
// 0x0048 (0x0048 - 0x0000)
struct WBP_WeaponCategory_C_ValidateWeaponRows final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponRow_C*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindItems__Valid__Result;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFItemInfo>                     CallFunc_FindItems__Valid__ValidItems;             // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCategory_C_ValidateWeaponRows) == 0x000008, "Wrong alignment on WBP_WeaponCategory_C_ValidateWeaponRows");
static_assert(sizeof(WBP_WeaponCategory_C_ValidateWeaponRows) == 0x000048, "Wrong size on WBP_WeaponCategory_C_ValidateWeaponRows");
static_assert(offsetof(WBP_WeaponCategory_C_ValidateWeaponRows, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_WeaponCategory_C_ValidateWeaponRows::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCategory_C_ValidateWeaponRows, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_WeaponCategory_C_ValidateWeaponRows::Temp_int_Loop_Counter_Variable' has a wrong offset!");
