#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestLogEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QuestLogEntry.WBP_QuestLogEntry_C
// 0x00A0 (0x0320 - 0x0280)
class UWBP_QuestLogEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UQuestContextViewModel*                 QuestContextViewModel;                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, RepSkip, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetSelected_Anim;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG_1;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CompleteIcon;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selected_1;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TrackIcon;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectButton;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_27;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatusText;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText_1;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText_2;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrackedText;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_EntryContent;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelect;                                          // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Empty;                                             // 0x0318(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bActivity;                                         // 0x0319(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__W_QuestLogEntry_SelectButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_QuestLogEntry_SelectButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_QuestLogEntry(int32 EntryPoint);
	void Init();
	void OnSelect__DelegateSignature(class UQuestContextViewModel* ViewModel, class UWBP_QuestLogEntry_C* WidgetRef);
	void PreConstruct(bool IsDesignTime);
	void SetQuestContextViewModel(class UQuestContextViewModel* ViewModel);
	void SetSelected(bool Selected);

	struct FLinearColor __55c4018aMinus4b0eMinus67d2Minus9036Minusa1b904a0c564_SourceToDest() const;
	class FText __d64ad29fMinus420eMinus874eMinusdd2cMinus42afad877602_SourceToDest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QuestLogEntry_C">();
	}
	static class UWBP_QuestLogEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QuestLogEntry_C>();
	}
};
static_assert(alignof(UWBP_QuestLogEntry_C) == 0x000008, "Wrong alignment on UWBP_QuestLogEntry_C");
static_assert(sizeof(UWBP_QuestLogEntry_C) == 0x000320, "Wrong size on UWBP_QuestLogEntry_C");
static_assert(offsetof(UWBP_QuestLogEntry_C, UberGraphFrame) == 0x000280, "Member 'UWBP_QuestLogEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Border_0) == 0x000288, "Member 'UWBP_QuestLogEntry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, QuestContextViewModel) == 0x000290, "Member 'UWBP_QuestLogEntry_C::QuestContextViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, SetSelected_Anim) == 0x000298, "Member 'UWBP_QuestLogEntry_C::SetSelected_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Image_BG_1) == 0x0002A0, "Member 'UWBP_QuestLogEntry_C::Image_BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Image_CompleteIcon) == 0x0002A8, "Member 'UWBP_QuestLogEntry_C::Image_CompleteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Image_Selected_1) == 0x0002B0, "Member 'UWBP_QuestLogEntry_C::Image_Selected_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Image_TrackIcon) == 0x0002B8, "Member 'UWBP_QuestLogEntry_C::Image_TrackIcon' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, SelectButton) == 0x0002C0, "Member 'UWBP_QuestLogEntry_C::SelectButton' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, SizeBox_27) == 0x0002C8, "Member 'UWBP_QuestLogEntry_C::SizeBox_27' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, StatusText) == 0x0002D0, "Member 'UWBP_QuestLogEntry_C::StatusText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, TitleText) == 0x0002D8, "Member 'UWBP_QuestLogEntry_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, TitleText_1) == 0x0002E0, "Member 'UWBP_QuestLogEntry_C::TitleText_1' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, TitleText_2) == 0x0002E8, "Member 'UWBP_QuestLogEntry_C::TitleText_2' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, TrackedText) == 0x0002F0, "Member 'UWBP_QuestLogEntry_C::TrackedText' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, VerticalBox_Content) == 0x0002F8, "Member 'UWBP_QuestLogEntry_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, WidgetSwitcher_EntryContent) == 0x000300, "Member 'UWBP_QuestLogEntry_C::WidgetSwitcher_EntryContent' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, OnSelect) == 0x000308, "Member 'UWBP_QuestLogEntry_C::OnSelect' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, Empty) == 0x000318, "Member 'UWBP_QuestLogEntry_C::Empty' has a wrong offset!");
static_assert(offsetof(UWBP_QuestLogEntry_C, bActivity) == 0x000319, "Member 'UWBP_QuestLogEntry_C::bActivity' has a wrong offset!");

}

