#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkbenchCraft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "E_WorkbenchTabTypes_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorkbenchCraft.WBP_WorkbenchCraft_C
// 0x01C8 (0x0448 - 0x0280)
class UWBP_WorkbenchCraft_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ChangeCategoriesAnim;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowNotification;                                  // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideTitle_Anim;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect_item;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_item;                                       // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InfoVisibility_Anim;                               // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show_Anim;                                         // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressDone_Anim;                                 // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Progress_Anim;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoResource;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                      Grid_Content;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Cost;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemRender;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Capacity;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Resources;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_CraftingProccess;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Hint;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ItemName;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Hint;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Slot;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Weight;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_CategoryList;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Info;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftCategorySelector_C*             W_CraftCategorySelector;                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient_1;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CraftIngredient_C*                   W_CraftIngredient_2;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DialoguePerks_C*                     W_DialoguePerks;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Close;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew_Craft;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CraftErrorMessage_C*               WBP_CraftErrorMessage;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       WBP_CraftItem;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_CraftCategory_C*>           Categories;                                        // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_CraftCategory_C*                   CurrentSelection;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Workbench_C*                       ParentWidgetRef;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnResourcesChanged;                                // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsMessageVisible_1;                                // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMessageVisible_2;                                // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AnimTimer;                                         // 0x03E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnNoResource;                                      // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_CraftItem_C*                       ItemToCraft;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CraftItem_C*                       CurrentItem;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeColor;                                       // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ChangerColor;                                      // 0x040C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FinishAnimShow;                                    // 0x041C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCraftingStarted;                                // 0x041D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CraftFlag;                                         // 0x041E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F[0x1];                                      // 0x041F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CraftItem_C*>               ItemsArray;                                        // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<bool>                                  AvailableResources;                                // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCraftNotificationWithCounter;                     // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_WorkbenchCraft_W_CraftCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature(const struct FS_CategoryData& CategoryData, bool All);
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_1_OnClickedCraft__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_4_OnClickedCraftCancel__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_6_OnClickedCraftMinus__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_7_OnClickedCraftPlus__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_8_OnClickedCraftCounter__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraft_W_DialoguePerks_K2Node_ComponentBoundEvent_9_OnClickedCraftCounterCancel__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftCategorySelector_W_HintButtonNew_Close_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftCategorySelector_W_HintButtonNew_Craft_K2Node_ComponentBoundEvent_0_OnReleased__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftCategorySelector_W_HintButtonNew_Craft_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void CanCraftItem(class UWBP_CraftItem_C* ItemRef, bool* Return);
	void ChangeWeaponCounter(class UWBP_CraftCategory_C* Category, class UWBP_CraftItem_C* Item);
	void CheackAllItemCanCraft();
	void Close();
	void Construct();
	void CraftItemSelected(class UWBP_CraftItem_C* Item);
	void ExecuteUbergraph_WBP_WorkbenchCraft(int32 EntryPoint);
	void Finished_9DC5B1D64B470BBC1A79BF8691E9AEBC();
	void GetCategoryByName(const class FText& CategoryName, class UWBP_CraftCategory_C** CategoryRef);
	void Image_0_Event_0(class UImage* Image_0);
	void InitCategories();
	void InitItemForNotification();
	void InitItems(class FName CraftCategoryName);
	void ItemsAnim();
	void ItemsAnimTick();
	void NotEnoughResources(bool Value);
	void NotEnoughSpace(bool Value);
	void OnCraftFinished(class UWBP_CraftItem_C* Item);
	void OnCraftingStarted();
	void OnCraftingStopped();
	void OnCraftNotEnoughResources(class UWBP_CraftItem_C* Item);
	void OnCraftNotEnoughtSpace(class UWBP_CraftItem_C* Item);
	void OnCraftStarted();
	void OnCraftStopped();
	void OnDismantlingFinished(class UWBP_CraftItem_C* Item);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyDownControl(const struct FKeyEvent& Input);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnNoResource__DelegateSignature();
	void OnResourcesChanged__DelegateSignature();
	void PlayFakeSwitchingAnim();
	void RebindKeys();
	void SelectFirstItem();
	void SetParentRef(class UWBP_Workbench_C* Ref);
	void ShowCraftNotification();
	void TabChangedEvent(E_WorkbenchTabTypes CurrentTab);
	void UnbindEvents(class UWBP_CraftItem_C* Item);
	void UnbindKeys();
	void UpdateCounts();
	void UpdateIngredients(const TArray<struct FS_NeedItems>& Ingredients, const TArray<bool>& Param_AvailableResources);
	void UpdateItem(const struct FFItemInfo& NewModelInfo, bool bIsScetch);
	void VerticalBox_Info_Event_0(class UVerticalBox* Param_VerticalBox_Info);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorkbenchCraft_C">();
	}
	static class UWBP_WorkbenchCraft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorkbenchCraft_C>();
	}
};
static_assert(alignof(UWBP_WorkbenchCraft_C) == 0x000008, "Wrong alignment on UWBP_WorkbenchCraft_C");
static_assert(sizeof(UWBP_WorkbenchCraft_C) == 0x000448, "Wrong size on UWBP_WorkbenchCraft_C");
static_assert(offsetof(UWBP_WorkbenchCraft_C, UberGraphFrame) == 0x000280, "Member 'UWBP_WorkbenchCraft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ChangeCategoriesAnim) == 0x000288, "Member 'UWBP_WorkbenchCraft_C::ChangeCategoriesAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ShowNotification) == 0x000290, "Member 'UWBP_WorkbenchCraft_C::ShowNotification' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, HideTitle_Anim) == 0x000298, "Member 'UWBP_WorkbenchCraft_C::HideTitle_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Deselect_item) == 0x0002A0, "Member 'UWBP_WorkbenchCraft_C::Deselect_item' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Select_item) == 0x0002A8, "Member 'UWBP_WorkbenchCraft_C::Select_item' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, InfoVisibility_Anim) == 0x0002B0, "Member 'UWBP_WorkbenchCraft_C::InfoVisibility_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Show_Anim) == 0x0002B8, "Member 'UWBP_WorkbenchCraft_C::Show_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ProgressDone_Anim) == 0x0002C0, "Member 'UWBP_WorkbenchCraft_C::ProgressDone_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Progress_Anim) == 0x0002C8, "Member 'UWBP_WorkbenchCraft_C::Progress_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, NoResource) == 0x0002D0, "Member 'UWBP_WorkbenchCraft_C::NoResource' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Grid_Content) == 0x0002D8, "Member 'UWBP_WorkbenchCraft_C::Grid_Content' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, HorizontalBox_Cost) == 0x0002E0, "Member 'UWBP_WorkbenchCraft_C::HorizontalBox_Cost' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Image_113) == 0x0002E8, "Member 'UWBP_WorkbenchCraft_C::Image_113' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Image_ItemRender) == 0x0002F0, "Member 'UWBP_WorkbenchCraft_C::Image_ItemRender' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Overlay_Capacity) == 0x0002F8, "Member 'UWBP_WorkbenchCraft_C::Overlay_Capacity' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Overlay_Resources) == 0x000300, "Member 'UWBP_WorkbenchCraft_C::Overlay_Resources' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ProgressBar_CraftingProccess) == 0x000308, "Member 'UWBP_WorkbenchCraft_C::ProgressBar_CraftingProccess' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, SizeBox_Hint) == 0x000310, "Member 'UWBP_WorkbenchCraft_C::SizeBox_Hint' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, SizeBox_ItemName) == 0x000318, "Member 'UWBP_WorkbenchCraft_C::SizeBox_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Text_Description) == 0x000320, "Member 'UWBP_WorkbenchCraft_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Text_Name) == 0x000328, "Member 'UWBP_WorkbenchCraft_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, TextBlock_Hint) == 0x000330, "Member 'UWBP_WorkbenchCraft_C::TextBlock_Hint' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, TextBlock_Slot) == 0x000338, "Member 'UWBP_WorkbenchCraft_C::TextBlock_Slot' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, TextBlock_Weight) == 0x000340, "Member 'UWBP_WorkbenchCraft_C::TextBlock_Weight' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, VerticalBox_CategoryList) == 0x000348, "Member 'UWBP_WorkbenchCraft_C::VerticalBox_CategoryList' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, VerticalBox_Content) == 0x000350, "Member 'UWBP_WorkbenchCraft_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, VerticalBox_Info) == 0x000358, "Member 'UWBP_WorkbenchCraft_C::VerticalBox_Info' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_CraftCategorySelector) == 0x000360, "Member 'UWBP_WorkbenchCraft_C::W_CraftCategorySelector' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_CraftIngredient) == 0x000368, "Member 'UWBP_WorkbenchCraft_C::W_CraftIngredient' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_CraftIngredient_1) == 0x000370, "Member 'UWBP_WorkbenchCraft_C::W_CraftIngredient_1' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_CraftIngredient_2) == 0x000378, "Member 'UWBP_WorkbenchCraft_C::W_CraftIngredient_2' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_DialoguePerks) == 0x000380, "Member 'UWBP_WorkbenchCraft_C::W_DialoguePerks' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_HintButtonNew_Close) == 0x000388, "Member 'UWBP_WorkbenchCraft_C::W_HintButtonNew_Close' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, W_HintButtonNew_Craft) == 0x000390, "Member 'UWBP_WorkbenchCraft_C::W_HintButtonNew_Craft' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, WBP_CraftErrorMessage) == 0x000398, "Member 'UWBP_WorkbenchCraft_C::WBP_CraftErrorMessage' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, WBP_CraftItem) == 0x0003A0, "Member 'UWBP_WorkbenchCraft_C::WBP_CraftItem' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, Categories) == 0x0003A8, "Member 'UWBP_WorkbenchCraft_C::Categories' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, CurrentSelection) == 0x0003B8, "Member 'UWBP_WorkbenchCraft_C::CurrentSelection' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ParentWidgetRef) == 0x0003C0, "Member 'UWBP_WorkbenchCraft_C::ParentWidgetRef' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, OnResourcesChanged) == 0x0003C8, "Member 'UWBP_WorkbenchCraft_C::OnResourcesChanged' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, IsMessageVisible_1) == 0x0003D8, "Member 'UWBP_WorkbenchCraft_C::IsMessageVisible_1' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, IsMessageVisible_2) == 0x0003D9, "Member 'UWBP_WorkbenchCraft_C::IsMessageVisible_2' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, AnimTimer) == 0x0003E0, "Member 'UWBP_WorkbenchCraft_C::AnimTimer' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, OnNoResource) == 0x0003E8, "Member 'UWBP_WorkbenchCraft_C::OnNoResource' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ItemToCraft) == 0x0003F8, "Member 'UWBP_WorkbenchCraft_C::ItemToCraft' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, CurrentItem) == 0x000400, "Member 'UWBP_WorkbenchCraft_C::CurrentItem' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ChangeColor) == 0x000408, "Member 'UWBP_WorkbenchCraft_C::ChangeColor' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ChangerColor) == 0x00040C, "Member 'UWBP_WorkbenchCraft_C::ChangerColor' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, FinishAnimShow) == 0x00041C, "Member 'UWBP_WorkbenchCraft_C::FinishAnimShow' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, bIsCraftingStarted) == 0x00041D, "Member 'UWBP_WorkbenchCraft_C::bIsCraftingStarted' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, CraftFlag) == 0x00041E, "Member 'UWBP_WorkbenchCraft_C::CraftFlag' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, ItemsArray) == 0x000420, "Member 'UWBP_WorkbenchCraft_C::ItemsArray' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, AvailableResources) == 0x000430, "Member 'UWBP_WorkbenchCraft_C::AvailableResources' has a wrong offset!");
static_assert(offsetof(UWBP_WorkbenchCraft_C, bCraftNotificationWithCounter) == 0x000440, "Member 'UWBP_WorkbenchCraft_C::bCraftNotificationWithCounter' has a wrong offset!");

}

