#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KilledByNotification

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_KilledByNotification.WBP_KilledByNotification_C.ExecuteUbergraph_WBP_KilledByNotification
// 0x0038 (0x0038 - 0x0000)
struct WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification) == 0x000008, "Wrong alignment on WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification");
static_assert(sizeof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification) == 0x000038, "Wrong size on WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, EntryPoint) == 0x000000, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, K2Node_CustomEvent_Show) == 0x000015, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, Temp_byte_Variable) == 0x000016, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000017, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, Temp_bool_Variable) == 0x00001A, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, K2Node_Select_Default) == 0x00001B, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_KilledByNotification_C_ExecuteUbergraph_WBP_KilledByNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_KilledByNotification.WBP_KilledByNotification_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_KilledByNotification_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KilledByNotification_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_KilledByNotification_C_PreConstruct");
static_assert(sizeof(WBP_KilledByNotification_C_PreConstruct) == 0x000001, "Wrong size on WBP_KilledByNotification_C_PreConstruct");
static_assert(offsetof(WBP_KilledByNotification_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_KilledByNotification_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_KilledByNotification.WBP_KilledByNotification_C.SetInfo
// 0x0150 (0x0150 - 0x0000)
struct WBP_KilledByNotification_C_SetInfo final
{
public:
	TSoftObjectPtr<class UPaperSprite>            Icon;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 Param_Name;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Param_bValid;                                      // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0080(0x00D0)()
};
static_assert(alignof(WBP_KilledByNotification_C_SetInfo) == 0x000010, "Wrong alignment on WBP_KilledByNotification_C_SetInfo");
static_assert(sizeof(WBP_KilledByNotification_C_SetInfo) == 0x000150, "Wrong size on WBP_KilledByNotification_C_SetInfo");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, Icon) == 0x000000, "Member 'WBP_KilledByNotification_C_SetInfo::Icon' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, Param_Name) == 0x000030, "Member 'WBP_KilledByNotification_C_SetInfo::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, Param_bValid) == 0x000040, "Member 'WBP_KilledByNotification_C_SetInfo::Param_bValid' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WBP_KilledByNotification_C_SetInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'WBP_KilledByNotification_C_SetInfo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, K2Node_DynamicCast_AsPaper_Sprite) == 0x000068, "Member 'WBP_KilledByNotification_C_SetInfo::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_KilledByNotification_C_SetInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_KilledByNotification_C_SetInfo, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000080, "Member 'WBP_KilledByNotification_C_SetInfo::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function WBP_KilledByNotification.WBP_KilledByNotification_C.ShowNotification
// 0x0001 (0x0001 - 0x0000)
struct WBP_KilledByNotification_C_ShowNotification final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KilledByNotification_C_ShowNotification) == 0x000001, "Wrong alignment on WBP_KilledByNotification_C_ShowNotification");
static_assert(sizeof(WBP_KilledByNotification_C_ShowNotification) == 0x000001, "Wrong size on WBP_KilledByNotification_C_ShowNotification");
static_assert(offsetof(WBP_KilledByNotification_C_ShowNotification, Param_Show) == 0x000000, "Member 'WBP_KilledByNotification_C_ShowNotification::Param_Show' has a wrong offset!");

}

