#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chat

#include "Basic.hpp"

#include "ChatType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Chat.WBP_Chat_C.AddText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Chat_C_AddText final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_AddText) == 0x000008, "Wrong alignment on WBP_Chat_C_AddText");
static_assert(sizeof(WBP_Chat_C_AddText) == 0x000018, "Wrong size on WBP_Chat_C_AddText");
static_assert(offsetof(WBP_Chat_C_AddText, Content) == 0x000000, "Member 'WBP_Chat_C_AddText::Content' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AddText, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WBP_Chat_C_AddText::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AddText, CallFunc_RemoveChildAt_ReturnValue) == 0x00000C, "Member 'WBP_Chat_C_AddText::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AddText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WBP_Chat_C_AddText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AddText, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_Chat_C_AddText::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.ExecuteUbergraph_WBP_Chat
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Chat_C_ExecuteUbergraph_WBP_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     K2Node_CustomEvent_ChatType;                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ChatLine_C*                        K2Node_DynamicCast_AsWBP_Chat_Line;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ChatLine_C*                        K2Node_DynamicCast_AsWBP_Chat_Line_1;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat) == 0x000008, "Wrong alignment on WBP_Chat_C_ExecuteUbergraph_WBP_Chat");
static_assert(sizeof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat) == 0x0000B8, "Wrong size on WBP_Chat_C_ExecuteUbergraph_WBP_Chat");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, EntryPoint) == 0x000000, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_CustomEvent_InVisibility) == 0x00001C, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_CustomEvent_ChatType) == 0x00001D, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_CustomEvent_ChatType' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_SwitchEnum_CmpSuccess) == 0x00001E, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_GetAllChildren_ReturnValue_1) == 0x000030, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_DynamicCast_AsWBP_Chat_Line) == 0x000050, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_DynamicCast_AsWBP_Chat_Line' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_DynamicCast_AsWBP_Chat_Line_1) == 0x000060, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_DynamicCast_AsWBP_Chat_Line_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Array_Length_ReturnValue_2) == 0x000090, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Loop_Counter_Variable_1) == 0x000094, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_GetSelectedIndex_ReturnValue) == 0x000098, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Add_IntInt_ReturnValue_1) == 0x00009C, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A1, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A4, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, Temp_int_Loop_Counter_Variable_2) == 0x0000A8, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_ExecuteUbergraph_WBP_Chat, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B0, "Member 'WBP_Chat_C_ExecuteUbergraph_WBP_Chat::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.OnPreviewKeyDown
// 0x0300 (0x0300 - 0x0000)
struct WBP_Chat_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable_1;                              // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              K2Node_DynamicCast_AsPS_TDB;                       // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     K2Node_Select_Default;                             // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0178(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x01A0(0x0018)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Copy_ReturnValue;                           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01E0(0x0018)()
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0238(0x00B8)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on WBP_Chat_C_OnPreviewKeyDown");
static_assert(sizeof(WBP_Chat_C_OnPreviewKeyDown) == 0x000300, "Wrong size on WBP_Chat_C_OnPreviewKeyDown");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'WBP_Chat_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_Chat_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, ReturnValue) == 0x000078, "Member 'WBP_Chat_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, Temp_int_Variable) == 0x000130, "Member 'WBP_Chat_C_OnPreviewKeyDown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000138, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, Temp_byte_Variable) == 0x000150, "Member 'WBP_Chat_C_OnPreviewKeyDown::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000151, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, Temp_byte_Variable_1) == 0x000152, "Member 'WBP_Chat_C_OnPreviewKeyDown::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, Temp_int_Variable_1) == 0x000154, "Member 'WBP_Chat_C_OnPreviewKeyDown::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000158, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetSelectedIndex_ReturnValue) == 0x000160, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, K2Node_DynamicCast_AsPS_TDB) == 0x000168, "Member 'WBP_Chat_C_OnPreviewKeyDown::K2Node_DynamicCast_AsPS_TDB' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_Chat_C_OnPreviewKeyDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, K2Node_Select_Default) == 0x000171, "Member 'WBP_Chat_C_OnPreviewKeyDown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetText_ReturnValue) == 0x000178, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Conv_TextToString_ReturnValue) == 0x000190, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetText_ReturnValue_1) == 0x0001A0, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Multiply_IntInt_ReturnValue) == 0x0001B8, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001C0, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, K2Node_Copy_ReturnValue) == 0x0001D0, "Member 'WBP_Chat_C_OnPreviewKeyDown::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetText_ReturnValue_2) == 0x0001E0, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Replace_ReturnValue) == 0x0001F8, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000208, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000218, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Len_ReturnValue) == 0x00021C, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000220, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Add_IntInt_ReturnValue) == 0x000224, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetOwningPlayer_ReturnValue) == 0x000228, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetPlayerControllerID_ReturnValue) == 0x000230, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000238, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_GetPlayerController_ReturnValue) == 0x0002F0, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_IsInputKeyDown_ReturnValue) == 0x0002F8, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_OnPreviewKeyDown, CallFunc_Not_PreBool_ReturnValue) == 0x0002F9, "Member 'WBP_Chat_C_OnPreviewKeyDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.Close Chat
// 0x0002 (0x0002 - 0x0000)
struct WBP_Chat_C_Close_Chat final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Param_ChatType;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_Close_Chat) == 0x000001, "Wrong alignment on WBP_Chat_C_Close_Chat");
static_assert(sizeof(WBP_Chat_C_Close_Chat) == 0x000002, "Wrong size on WBP_Chat_C_Close_Chat");
static_assert(offsetof(WBP_Chat_C_Close_Chat, InVisibility) == 0x000000, "Member 'WBP_Chat_C_Close_Chat::InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_Close_Chat, Param_ChatType) == 0x000001, "Member 'WBP_Chat_C_Close_Chat::Param_ChatType' has a wrong offset!");

}

