#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LeaveCurrentAreaEntry

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_LeaveCurrentAreaEntry.WBP_LeaveCurrentAreaEntry_C.ExecuteUbergraph_WBP_LeaveCurrentAreaEntry
// 0x0078 (0x0078 - 0x0000)
struct WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	bool                                          K2Node_CustomEvent_Accepted;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Accepted)>                K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Accepted)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry) == 0x000008, "Wrong alignment on WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry");
static_assert(sizeof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry) == 0x000078, "Wrong size on WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, EntryPoint) == 0x000000, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, K2Node_Event_IsDesignTime) == 0x000012, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, K2Node_CustomEvent_Accepted) == 0x000048, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::K2Node_CustomEvent_Accepted' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_SelectInt_ReturnValue) == 0x00005C, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WBP_LeaveCurrentAreaEntry_C_ExecuteUbergraph_WBP_LeaveCurrentAreaEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_LeaveCurrentAreaEntry.WBP_LeaveCurrentAreaEntry_C.OnAcceptTeleport
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport final
{
public:
	bool                                          Accepted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport) == 0x000001, "Wrong alignment on WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport");
static_assert(sizeof(WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport) == 0x000001, "Wrong size on WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport, Accepted) == 0x000000, "Member 'WBP_LeaveCurrentAreaEntry_C_OnAcceptTeleport::Accepted' has a wrong offset!");

// Function WBP_LeaveCurrentAreaEntry.WBP_LeaveCurrentAreaEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentAreaEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentAreaEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LeaveCurrentAreaEntry_C_PreConstruct");
static_assert(sizeof(WBP_LeaveCurrentAreaEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_LeaveCurrentAreaEntry_C_PreConstruct");
static_assert(offsetof(WBP_LeaveCurrentAreaEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LeaveCurrentAreaEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

