#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ShopModalWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ShopModalWindow.WBP_ShopModalWindow_C.ExecuteUbergraph_WBP_ShopModalWindow
// 0x0090 (0x0090 - 0x0000)
struct WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0078(0x0018)()
};
static_assert(alignof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow) == 0x000008, "Wrong alignment on WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow");
static_assert(sizeof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow) == 0x000090, "Wrong size on WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, EntryPoint) == 0x000000, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, Temp_bool_Variable) == 0x000004, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, Temp_text_Variable) == 0x000008, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, Temp_text_Variable_1) == 0x000028, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, Temp_text_Variable_2) == 0x000040, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, K2Node_Select_Default) == 0x000058, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000070, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow, K2Node_Select_Default_1) == 0x000078, "Member 'WBP_ShopModalWindow_C_ExecuteUbergraph_WBP_ShopModalWindow::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ShopModalWindow.WBP_ShopModalWindow_C.GetMaxCount_0
// 0x0038 (0x0038 - 0x0000)
struct WBP_ShopModalWindow_C_GetMaxCount_0 final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPocketContainer_Result;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSIContainer_C*                        CallFunc_GetPocketContainer_Container;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopModalWindow_C_GetMaxCount_0) == 0x000008, "Wrong alignment on WBP_ShopModalWindow_C_GetMaxCount_0");
static_assert(sizeof(WBP_ShopModalWindow_C_GetMaxCount_0) == 0x000038, "Wrong size on WBP_ShopModalWindow_C_GetMaxCount_0");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, K2Node_DynamicCast_AsSurvival_Player) == 0x000018, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_GetPocketContainer_Result) == 0x000021, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_GetPocketContainer_Result' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_GetPocketContainer_Container) == 0x000028, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_GetPocketContainer_Container' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopModalWindow_C_GetMaxCount_0, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_ShopModalWindow_C_GetMaxCount_0::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

