#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemInteractionActionButton.WBP_ItemInteractionActionButton_C
// 0x0040 (0x02C0 - 0x0280)
class UWBP_ItemInteractionActionButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Action;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_CraftProcess;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CraftState;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnActionButtonPressed;                             // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Enabled;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ItemInteractionActionButton_Button_Action_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionActionButton_Button_Action_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionActionButton_Button_Action_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void ButtonActionHover();
	void ButtonActionUnhover();
	void ExecuteUbergraph_WBP_ItemInteractionActionButton(int32 EntryPoint);
	void GetEnabled(bool* Param_Enabled);
	void OnActionButtonPressed__DelegateSignature();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetButtonEnable(bool Enable);
	void SetEnoughResouces(bool bEnough);
	void SetText(const class FText& Text, bool bDisabledText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemInteractionActionButton_C">();
	}
	static class UWBP_ItemInteractionActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemInteractionActionButton_C>();
	}
};
static_assert(alignof(UWBP_ItemInteractionActionButton_C) == 0x000008, "Wrong alignment on UWBP_ItemInteractionActionButton_C");
static_assert(sizeof(UWBP_ItemInteractionActionButton_C) == 0x0002C0, "Wrong size on UWBP_ItemInteractionActionButton_C");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ItemInteractionActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, Hover) == 0x000288, "Member 'UWBP_ItemInteractionActionButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, Button_Action) == 0x000290, "Member 'UWBP_ItemInteractionActionButton_C::Button_Action' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, ProgressBar_CraftProcess) == 0x000298, "Member 'UWBP_ItemInteractionActionButton_C::ProgressBar_CraftProcess' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, Text_CraftState) == 0x0002A0, "Member 'UWBP_ItemInteractionActionButton_C::Text_CraftState' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, OnActionButtonPressed) == 0x0002A8, "Member 'UWBP_ItemInteractionActionButton_C::OnActionButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, Enabled) == 0x0002B8, "Member 'UWBP_ItemInteractionActionButton_C::Enabled' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionActionButton_C, bHovered) == 0x0002B9, "Member 'UWBP_ItemInteractionActionButton_C::bHovered' has a wrong offset!");

}

