#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCreate_NavigationButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterCreate_NavigationButton.WBP_CharacterCreate_NavigationButton_C
// 0x00B8 (0x0338 - 0x0280)
class UWBP_CharacterCreate_NavigationButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Button_Content;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_433;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ArrowLeft;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ArrowRight;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ButtonText;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyIcon_C*                         WBP_KeyIcon_Left;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyIcon_C*                         WBP_KeyIcon_Right;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ContentLeft;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ContentRight;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOrientLeft;                                       // 0x02E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x02F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bShowButtonKey;                                    // 0x0318(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Key;                                               // 0x0320(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CharacterCreate_NavigationButton_ButtonBack_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_CharacterCreate_NavigationButton(int32 EntryPoint);
	void OnButtonPressed__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterCreate_NavigationButton_C">();
	}
	static class UWBP_CharacterCreate_NavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterCreate_NavigationButton_C>();
	}
};
static_assert(alignof(UWBP_CharacterCreate_NavigationButton_C) == 0x000008, "Wrong alignment on UWBP_CharacterCreate_NavigationButton_C");
static_assert(sizeof(UWBP_CharacterCreate_NavigationButton_C) == 0x000338, "Wrong size on UWBP_CharacterCreate_NavigationButton_C");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CharacterCreate_NavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Hover) == 0x000288, "Member 'UWBP_CharacterCreate_NavigationButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Button) == 0x000290, "Member 'UWBP_CharacterCreate_NavigationButton_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Button_Content) == 0x000298, "Member 'UWBP_CharacterCreate_NavigationButton_C::Button_Content' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Image) == 0x0002A0, "Member 'UWBP_CharacterCreate_NavigationButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Image_433) == 0x0002A8, "Member 'UWBP_CharacterCreate_NavigationButton_C::Image_433' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, SizeBox_ArrowLeft) == 0x0002B0, "Member 'UWBP_CharacterCreate_NavigationButton_C::SizeBox_ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, SizeBox_ArrowRight) == 0x0002B8, "Member 'UWBP_CharacterCreate_NavigationButton_C::SizeBox_ArrowRight' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, TextBlock_ButtonText) == 0x0002C0, "Member 'UWBP_CharacterCreate_NavigationButton_C::TextBlock_ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, WBP_KeyIcon_Left) == 0x0002C8, "Member 'UWBP_CharacterCreate_NavigationButton_C::WBP_KeyIcon_Left' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, WBP_KeyIcon_Right) == 0x0002D0, "Member 'UWBP_CharacterCreate_NavigationButton_C::WBP_KeyIcon_Right' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, WidgetSwitcher_ContentLeft) == 0x0002D8, "Member 'UWBP_CharacterCreate_NavigationButton_C::WidgetSwitcher_ContentLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, WidgetSwitcher_ContentRight) == 0x0002E0, "Member 'UWBP_CharacterCreate_NavigationButton_C::WidgetSwitcher_ContentRight' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, bOrientLeft) == 0x0002E8, "Member 'UWBP_CharacterCreate_NavigationButton_C::bOrientLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, ButtonText) == 0x0002F0, "Member 'UWBP_CharacterCreate_NavigationButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, OnButtonPressed) == 0x000308, "Member 'UWBP_CharacterCreate_NavigationButton_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, bShowButtonKey) == 0x000318, "Member 'UWBP_CharacterCreate_NavigationButton_C::bShowButtonKey' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, NewVar) == 0x000319, "Member 'UWBP_CharacterCreate_NavigationButton_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterCreate_NavigationButton_C, Key) == 0x000320, "Member 'UWBP_CharacterCreate_NavigationButton_C::Key' has a wrong offset!");

}

