#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewQuest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_NewQuest.WBP_NewQuest_C.ExecuteUbergraph_WBP_NewQuest
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UUMGSequencePlayer*               Temp_object_Variable;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UUMGSequencePlayer*               Temp_object_Variable_1;                            // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UUMGSequencePlayer*               Temp_object_Variable_2;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UUMGSequencePlayer*               Temp_object_Variable_3;                            // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UUMGSequencePlayer*               Temp_object_Variable_4;                            // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Objective_C*                        K2Node_CustomEvent_RootObjectiveCollection;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ObjCollection_C*                    K2Node_DynamicCast_AsBP_Obj_Collection;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Objective_C*                        CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Objective_C*                        K2Node_CustomEvent_Objective_1;                    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetObjectiveName_ObjectiveName;           // 0x0098(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0018)()
	class FText                                   CallFunc_FormatText_ReturnValue;                   // 0x00D0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00FC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Objective_C* Objective)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Objective_C*                        K2Node_CustomEvent_Objective;                      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ObjCollection_C*                    K2Node_DynamicCast_AsBP_Obj_Collection_1;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetObjectiveName_ObjectiveName_1;         // 0x0170(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_2;                         // 0x01C0(0x0018)()
	class FText                                   CallFunc_FormatText_ReturnValue_1;                 // 0x01D8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Objective_C* RootObjectiveCollection)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0274(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_Objective_C* Objective)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest) == 0x000008, "Wrong alignment on WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest");
static_assert(sizeof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest) == 0x0002A8, "Wrong size on WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, EntryPoint) == 0x000000, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_object_Variable) == 0x000018, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_object_Variable_1) == 0x000020, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_object_Variable_2) == 0x000028, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_object_Variable_3) == 0x000030, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_object_Variable_4) == 0x000038, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_bool_Variable) == 0x000040, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_bool_IsClosed_Variable) == 0x000058, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_bool_Has_Been_Initd_Variable) == 0x000059, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CustomEvent_RootObjectiveCollection) == 0x000060, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CustomEvent_RootObjectiveCollection' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_DynamicCast_AsBP_Obj_Collection) == 0x000068, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_DynamicCast_AsBP_Obj_Collection' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CustomEvent_Objective_1) == 0x000088, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CustomEvent_Objective_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_GetObjectiveName_ObjectiveName) == 0x000098, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_GetObjectiveName_ObjectiveName' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_FormatText_ReturnValue) == 0x0000D0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_FormatText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x0000E8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x0000F0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_Event_MyGeometry) == 0x0000FC, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_Event_InDeltaTime) == 0x000134, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, Temp_int_Loop_Counter_Variable) == 0x000138, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_2) == 0x00013C, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CustomEvent_Objective) == 0x000158, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CustomEvent_Objective' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_DynamicCast_AsBP_Obj_Collection_1) == 0x000160, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_DynamicCast_AsBP_Obj_Collection_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_GetObjectiveName_ObjectiveName_1) == 0x000170, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_GetObjectiveName_ObjectiveName_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_TextIsEmpty_ReturnValue) == 0x000188, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_3) == 0x00018C, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_Select_Default) == 0x0001A0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Add_ReturnValue_1) == 0x0001B8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Get_Item_2) == 0x0001C0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_FormatText_ReturnValue_1) == 0x0001D8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_FormatText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x0001F0, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x0001F8, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Length_ReturnValue_1) == 0x000204, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Greater_IntInt_ReturnValue) == 0x000208, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Length_ReturnValue_2) == 0x00020C, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000210, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_4) == 0x000214, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_5) == 0x000224, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000238, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000240, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_IsValid_ReturnValue_2) == 0x000248, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000250, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000258, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x000260, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x000268, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_IsValid_ReturnValue_3) == 0x000270, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_IsValid_ReturnValue_4) == 0x000271, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_MakeStruct_LinearColor) == 0x000274, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, CallFunc_Array_Add_ReturnValue_2) == 0x000284, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_6) == 0x000288, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest, K2Node_CreateDelegate_OutputDelegate_7) == 0x000298, "Member 'WBP_NewQuest_C_ExecuteUbergraph_WBP_NewQuest::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.FormatText
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_NewQuest_C_FormatText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 FinishString;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ConvertedText;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00A0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_FormatText) == 0x000008, "Wrong alignment on WBP_NewQuest_C_FormatText");
static_assert(sizeof(WBP_NewQuest_C_FormatText) == 0x0000E8, "Wrong size on WBP_NewQuest_C_FormatText");
static_assert(offsetof(WBP_NewQuest_C_FormatText, Text) == 0x000000, "Member 'WBP_NewQuest_C_FormatText::Text' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, ReturnValue) == 0x000018, "Member 'WBP_NewQuest_C_FormatText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, FinishString) == 0x000030, "Member 'WBP_NewQuest_C_FormatText::FinishString' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, ConvertedText) == 0x000040, "Member 'WBP_NewQuest_C_FormatText::ConvertedText' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_NewQuest_C_FormatText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000068, "Member 'WBP_NewQuest_C_FormatText::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_TextToUpper_ReturnValue) == 0x0000A0, "Member 'WBP_NewQuest_C_FormatText::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'WBP_NewQuest_C_FormatText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D0, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FormatText, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_NewQuest_C_FormatText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.FreezeUI
// 0x0040 (0x0040 - 0x0000)
struct WBP_NewQuest_C_FreezeUI final
{
public:
	bool                                          Freeze;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_FreezeUI) == 0x000008, "Wrong alignment on WBP_NewQuest_C_FreezeUI");
static_assert(sizeof(WBP_NewQuest_C_FreezeUI) == 0x000040, "Wrong size on WBP_NewQuest_C_FreezeUI");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Freeze) == 0x000000, "Member 'WBP_NewQuest_C_FreezeUI::Freeze' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_bool_Variable) == 0x000001, "Member 'WBP_NewQuest_C_FreezeUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_NewQuest_C_FreezeUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_NewQuest_C_FreezeUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_NewQuest_C_FreezeUI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_NewQuest_C_FreezeUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_byte_Variable) == 0x00001C, "Member 'WBP_NewQuest_C_FreezeUI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003D, "Member 'WBP_NewQuest_C_FreezeUI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, Temp_byte_Variable_1) == 0x00003E, "Member 'WBP_NewQuest_C_FreezeUI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_FreezeUI, K2Node_Select_Default) == 0x00003F, "Member 'WBP_NewQuest_C_FreezeUI::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.OnObjectiveActivated
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewQuest_C_OnObjectiveActivated final
{
public:
	class UBP_Objective_C*                        Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_OnObjectiveActivated) == 0x000008, "Wrong alignment on WBP_NewQuest_C_OnObjectiveActivated");
static_assert(sizeof(WBP_NewQuest_C_OnObjectiveActivated) == 0x000008, "Wrong size on WBP_NewQuest_C_OnObjectiveActivated");
static_assert(offsetof(WBP_NewQuest_C_OnObjectiveActivated, Objective) == 0x000000, "Member 'WBP_NewQuest_C_OnObjectiveActivated::Objective' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.OnObjectiveCompleted
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewQuest_C_OnObjectiveCompleted final
{
public:
	class UBP_Objective_C*                        Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_OnObjectiveCompleted) == 0x000008, "Wrong alignment on WBP_NewQuest_C_OnObjectiveCompleted");
static_assert(sizeof(WBP_NewQuest_C_OnObjectiveCompleted) == 0x000008, "Wrong size on WBP_NewQuest_C_OnObjectiveCompleted");
static_assert(offsetof(WBP_NewQuest_C_OnObjectiveCompleted, Objective) == 0x000000, "Member 'WBP_NewQuest_C_OnObjectiveCompleted::Objective' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.OnQuestActivated
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewQuest_C_OnQuestActivated final
{
public:
	class UBP_Objective_C*                        RootObjectiveCollection;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_OnQuestActivated) == 0x000008, "Wrong alignment on WBP_NewQuest_C_OnQuestActivated");
static_assert(sizeof(WBP_NewQuest_C_OnQuestActivated) == 0x000008, "Wrong size on WBP_NewQuest_C_OnQuestActivated");
static_assert(offsetof(WBP_NewQuest_C_OnQuestActivated, RootObjectiveCollection) == 0x000000, "Member 'WBP_NewQuest_C_OnQuestActivated::RootObjectiveCollection' has a wrong offset!");

// Function WBP_NewQuest.WBP_NewQuest_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_NewQuest_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewQuest_C_Tick) == 0x000004, "Wrong alignment on WBP_NewQuest_C_Tick");
static_assert(sizeof(WBP_NewQuest_C_Tick) == 0x00003C, "Wrong size on WBP_NewQuest_C_Tick");
static_assert(offsetof(WBP_NewQuest_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_NewQuest_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NewQuest_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_NewQuest_C_Tick::InDeltaTime' has a wrong offset!");

}

