#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionValueChangeButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C.ExecuteUbergraph_WBP_ItemInteractionValueChangeButton
// 0x0040 (0x0040 - 0x0000)
struct WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0024(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x002C(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton) == 0x000008, "Wrong alignment on WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton");
static_assert(sizeof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton) == 0x000040, "Wrong size on WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, EntryPoint) == 0x000000, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, Temp_int_Variable) == 0x000004, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, Temp_int_Variable_1) == 0x000008, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, K2Node_Event_InFocusEvent_1) == 0x000024, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, K2Node_Event_InFocusEvent) == 0x00002C, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, Temp_bool_Variable) == 0x000034, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, K2Node_Select_Default) == 0x000038, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton, CallFunc_HasAnyUserFocus_ReturnValue) == 0x00003C, "Member 'WBP_ItemInteractionValueChangeButton_C_ExecuteUbergraph_WBP_ItemInteractionValueChangeButton::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ItemInteractionValueChangeButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ItemInteractionValueChangeButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionValueChangeButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionValueChangeButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemInteractionValueChangeButton_C_PreConstruct");
static_assert(sizeof(WBP_ItemInteractionValueChangeButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemInteractionValueChangeButton_C_PreConstruct");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemInteractionValueChangeButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C.SetButtonEnabled
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled) == 0x000008, "Wrong alignment on WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled");
static_assert(sizeof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled) == 0x000018, "Wrong size on WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled, Enable) == 0x000000, "Member 'WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled::Enable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000014, "Member 'WBP_ItemInteractionValueChangeButton_C_SetButtonEnabled::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

