#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuBarShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_MenuBarShopCategory_structs.hpp"
#include "F_MenuBarShopItem_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuBarShop.WBP_MenuBarShop_C
// 0x0158 (0x03D8 - 0x0280)
class UWBP_MenuBarShop_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowNotif;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewOpem;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowErrorMessage;                                  // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwipeCategory;                                     // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_124;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Close;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_E;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Q;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ModalBG;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Content;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Content;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WarningMessageText;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_1;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_195;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainCategorySelector_C*            WBP_MainCategorySelector;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuBarShopCategory_C*             WBP_MenuBarShopCategory;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuBarShopCategory_C*             WBP_MenuBarShopCategory_1;                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuBarShopCategory_C*             WBP_MenuBarShopCategory_2;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalWindow_C*                     WBP_ModalWindow;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerTotalStats_C*                WBP_PlayerTotalStats;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller_84;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvPC_C*                              CachedController;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            PlayerStatsComponent_Ref;                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateStats_Timer;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuBarShopCategory_C*             SelectedCategory;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MenuBarShopCategory_C*>     Categories;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FF_MenuBarShopItem>             AllMenuBar;                                        // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Row;                                               // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MenuBarShopSlot_C*>         MenuBarSlots;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bIsSlotEmpty;                                      // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MenuBarShopSlot_C*                 SelectedSlot;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCloseShop;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSelectedSlot;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_MenuBarShop_Button_124_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_MenuBarShop_Button_Close_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void BndEvt__WBP_MenuBarShop_WBP_ModalWindow_K2Node_ComponentBoundEvent_1_OnAccept__DelegateSignature();
	void ChangeSelectedButton(const class FText& NewCategoryText, class UWBP_MenuBarShopCategory_C* NewSelectedCategory);
	void CloseShop();
	void CloseShopBind();
	void Construct();
	void ExecuteUbergraph_WBP_MenuBarShop(int32 EntryPoint);
	void Finished_1164BAD94E5FDCC4A59CA6BA0A62389B();
	void Finished_B322082E4A71206831C60DAFDE4D1502();
	void Finished_D0D28BE04B78FA29BBE7B79B7EA81DDF();
	void OnChangeCategory(const class FText& NewSelectedCategoryName, class UWBP_MenuBarShopCategory_C* MenuBarShopCategory);
	void OnChangeSelectedSlot(class UWBP_MenuBarShopSlot_C* PressedMenuBarSlot);
	void OnCloseShop__DelegateSignature();
	void OnConfirmNotEnoughMoneyNotif();
	void OnSelectedSlot__DelegateSignature(class UWBP_MenuBarShopSlot_C* CurrentSelectedSlot);
	void OnShowErrorMessage(const class FText& ErrorMessage);
	void SortMenuBy(E_MenuBarShopCategory SortCategory);
	void UpdateStats_Func();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuBarShop_C">();
	}
	static class UWBP_MenuBarShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuBarShop_C>();
	}
};
static_assert(alignof(UWBP_MenuBarShop_C) == 0x000008, "Wrong alignment on UWBP_MenuBarShop_C");
static_assert(sizeof(UWBP_MenuBarShop_C) == 0x0003D8, "Wrong size on UWBP_MenuBarShop_C");
static_assert(offsetof(UWBP_MenuBarShop_C, UberGraphFrame) == 0x000280, "Member 'UWBP_MenuBarShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, ShowNotif) == 0x000288, "Member 'UWBP_MenuBarShop_C::ShowNotif' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, NewOpem) == 0x000290, "Member 'UWBP_MenuBarShop_C::NewOpem' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Close) == 0x000298, "Member 'UWBP_MenuBarShop_C::Close' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, ShowErrorMessage) == 0x0002A0, "Member 'UWBP_MenuBarShop_C::ShowErrorMessage' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, SwipeCategory) == 0x0002A8, "Member 'UWBP_MenuBarShop_C::SwipeCategory' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Open) == 0x0002B0, "Member 'UWBP_MenuBarShop_C::Open' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Button_124) == 0x0002B8, "Member 'UWBP_MenuBarShop_C::Button_124' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Button_Close) == 0x0002C0, "Member 'UWBP_MenuBarShop_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Button_E) == 0x0002C8, "Member 'UWBP_MenuBarShop_C::Button_E' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Button_Q) == 0x0002D0, "Member 'UWBP_MenuBarShop_C::Button_Q' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Image_ModalBG) == 0x0002D8, "Member 'UWBP_MenuBarShop_C::Image_ModalBG' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, ScrollBox_Content) == 0x0002E0, "Member 'UWBP_MenuBarShop_C::ScrollBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, SizeBox_Content) == 0x0002E8, "Member 'UWBP_MenuBarShop_C::SizeBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, TextBlock_WarningMessageText) == 0x0002F0, "Member 'UWBP_MenuBarShop_C::TextBlock_WarningMessageText' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, UMG_LabelText) == 0x0002F8, "Member 'UWBP_MenuBarShop_C::UMG_LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, UMG_LabelText_1) == 0x000300, "Member 'UWBP_MenuBarShop_C::UMG_LabelText_1' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, UniformGridPanel_195) == 0x000308, "Member 'UWBP_MenuBarShop_C::UniformGridPanel_195' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, VerticalBox_Content) == 0x000310, "Member 'UWBP_MenuBarShop_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_MainCategorySelector) == 0x000318, "Member 'UWBP_MenuBarShop_C::WBP_MainCategorySelector' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_MenuBarShopCategory) == 0x000320, "Member 'UWBP_MenuBarShop_C::WBP_MenuBarShopCategory' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_MenuBarShopCategory_1) == 0x000328, "Member 'UWBP_MenuBarShop_C::WBP_MenuBarShopCategory_1' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_MenuBarShopCategory_2) == 0x000330, "Member 'UWBP_MenuBarShop_C::WBP_MenuBarShopCategory_2' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_ModalWindow) == 0x000338, "Member 'UWBP_MenuBarShop_C::WBP_ModalWindow' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_PlayerTotalStats) == 0x000340, "Member 'UWBP_MenuBarShop_C::WBP_PlayerTotalStats' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, WBP_Scroller_84) == 0x000348, "Member 'UWBP_MenuBarShop_C::WBP_Scroller_84' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, CachedController) == 0x000350, "Member 'UWBP_MenuBarShop_C::CachedController' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, PlayerStatsComponent_Ref) == 0x000358, "Member 'UWBP_MenuBarShop_C::PlayerStatsComponent_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, UpdateStats_Timer) == 0x000360, "Member 'UWBP_MenuBarShop_C::UpdateStats_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, SelectedCategory) == 0x000368, "Member 'UWBP_MenuBarShop_C::SelectedCategory' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Categories) == 0x000370, "Member 'UWBP_MenuBarShop_C::Categories' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, AllMenuBar) == 0x000380, "Member 'UWBP_MenuBarShop_C::AllMenuBar' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Row) == 0x000390, "Member 'UWBP_MenuBarShop_C::Row' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, Column) == 0x000394, "Member 'UWBP_MenuBarShop_C::Column' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, MenuBarSlots) == 0x000398, "Member 'UWBP_MenuBarShop_C::MenuBarSlots' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, bIsSlotEmpty) == 0x0003A8, "Member 'UWBP_MenuBarShop_C::bIsSlotEmpty' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, SelectedSlot) == 0x0003B0, "Member 'UWBP_MenuBarShop_C::SelectedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, OnCloseShop) == 0x0003B8, "Member 'UWBP_MenuBarShop_C::OnCloseShop' has a wrong offset!");
static_assert(offsetof(UWBP_MenuBarShop_C, OnSelectedSlot) == 0x0003C8, "Member 'UWBP_MenuBarShop_C::OnSelectedSlot' has a wrong offset!");

}

