#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPSJournal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPSJournal.WBP_GPSJournal_C
// 0x0090 (0x0310 - 0x0280)
class UWBP_GPSJournal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowQuesDetails;                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowQuestsList;                               // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Entries;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GPSQuestDetails_C*                 WBP_GPSQuestDetails;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UQuest*, class UWBP_GPSJournal_Entry_C*> ActiveWidgets;                                     // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bInit;                                             // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocked;                                           // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_0_OnDecline__DelegateSignature(class UQuest* Quest);
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_1_OnCancel__DelegateSignature();
	void BndEvt__WBP_GPSJournal_WBP_GPSQuestDetails_K2Node_ComponentBoundEvent_3_OnAccept__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GPSJournal(int32 EntryPoint);
	void ExpandQuestDetails(class UQuest* Quest);
	void Finished_0C4085A24A0B592619AB01A031135766();
	void Finished_3CC307364274DD90BE084485F794D11E();
	void Finished_734C62D54D5178651997FE9247EA68FD();
	void Finished_B4E7AB5042A03E6EE685638D2B925BCB();
	void Init();
	void InitQuestList();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetLocked(bool Param_bLocked);
	void ShowDetails(class UQuest* Quest);
	void ShowQuestList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPSJournal_C">();
	}
	static class UWBP_GPSJournal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPSJournal_C>();
	}
};
static_assert(alignof(UWBP_GPSJournal_C) == 0x000008, "Wrong alignment on UWBP_GPSJournal_C");
static_assert(sizeof(UWBP_GPSJournal_C) == 0x000310, "Wrong size on UWBP_GPSJournal_C");
static_assert(offsetof(UWBP_GPSJournal_C, UberGraphFrame) == 0x000280, "Member 'UWBP_GPSJournal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, Anim_ShowQuesDetails) == 0x000288, "Member 'UWBP_GPSJournal_C::Anim_ShowQuesDetails' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, Anim_ShowQuestsList) == 0x000290, "Member 'UWBP_GPSJournal_C::Anim_ShowQuestsList' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, VerticalBox_Entries) == 0x000298, "Member 'UWBP_GPSJournal_C::VerticalBox_Entries' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, WBP_GPSQuestDetails) == 0x0002A0, "Member 'UWBP_GPSJournal_C::WBP_GPSQuestDetails' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, WidgetSwitcher_Content) == 0x0002A8, "Member 'UWBP_GPSJournal_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, As_Surv_PC) == 0x0002B0, "Member 'UWBP_GPSJournal_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, ActiveWidgets) == 0x0002B8, "Member 'UWBP_GPSJournal_C::ActiveWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, bInit) == 0x000308, "Member 'UWBP_GPSJournal_C::bInit' has a wrong offset!");
static_assert(offsetof(UWBP_GPSJournal_C, bLocked) == 0x000309, "Member 'UWBP_GPSJournal_C::bLocked' has a wrong offset!");

}

