#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewLocationBanner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "F_DialogueNodeInfo_structs.hpp"
#include "UMG_classes.hpp"
#include "E_NewLocation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NewLocationBanner.WBP_NewLocationBanner_C
// 0x0148 (0x03C8 - 0x0280)
class UWBP_NewLocationBanner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_185;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Location;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogueSubtitles_C*               WBP_DialogueSubtitles;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFMODEventInstance                     PhrasePlaying;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FF_DialogueNodeInfo                    DialogueInfo;                                      // 0x02C0(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_NewLocationBanner(int32 EntryPoint);
	void Finished_383EF3A7462D2E48A29C1D8DDEBE9BA4();
	void HideBanner();
	void Play_Phrase();
	void ShowBanner(E_NewLocation Location);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NewLocationBanner_C">();
	}
	static class UWBP_NewLocationBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NewLocationBanner_C>();
	}
};
static_assert(alignof(UWBP_NewLocationBanner_C) == 0x000008, "Wrong alignment on UWBP_NewLocationBanner_C");
static_assert(sizeof(UWBP_NewLocationBanner_C) == 0x0003C8, "Wrong size on UWBP_NewLocationBanner_C");
static_assert(offsetof(UWBP_NewLocationBanner_C, UberGraphFrame) == 0x000280, "Member 'UWBP_NewLocationBanner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, Hide) == 0x000288, "Member 'UWBP_NewLocationBanner_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, Show) == 0x000290, "Member 'UWBP_NewLocationBanner_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, Image_185) == 0x000298, "Member 'UWBP_NewLocationBanner_C::Image_185' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, Text_Location) == 0x0002A0, "Member 'UWBP_NewLocationBanner_C::Text_Location' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, Text_Title) == 0x0002A8, "Member 'UWBP_NewLocationBanner_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, WBP_DialogueSubtitles) == 0x0002B0, "Member 'UWBP_NewLocationBanner_C::WBP_DialogueSubtitles' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, PhrasePlaying) == 0x0002B8, "Member 'UWBP_NewLocationBanner_C::PhrasePlaying' has a wrong offset!");
static_assert(offsetof(UWBP_NewLocationBanner_C, DialogueInfo) == 0x0002C0, "Member 'UWBP_NewLocationBanner_C::DialogueInfo' has a wrong offset!");

}

