#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionValueChangeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemInteractionValueChangeButton.WBP_ItemInteractionValueChangeButton_C
// 0x0080 (0x0300 - 0x0280)
class UWBP_ItemInteractionValueChangeButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_ChangeCount;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DecreaseCount;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_IncreaseCount;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ButtonType;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnChangeValueButtonPressed;                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIncreaseValue;                                    // 0x02D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDisabled;                                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHovered;                                          // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnReleased;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_ItemInteractionValueChangeButton_Button_ChangeCount_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionValueChangeButton_Button_ChangeCount_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionValueChangeButton_Button_ChangeCount_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ItemInteractionValueChangeButton_Button_ChangeCount_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void ButtonActionHover();
	void ButtonActionUnhover();
	void ExecuteUbergraph_WBP_ItemInteractionValueChangeButton(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnChangeValueButtonPressed__DelegateSignature();
	void OnDisabled__DelegateSignature();
	void OnReleased__DelegateSignature();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void SetButtonEnabled(bool Enable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemInteractionValueChangeButton_C">();
	}
	static class UWBP_ItemInteractionValueChangeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemInteractionValueChangeButton_C>();
	}
};
static_assert(alignof(UWBP_ItemInteractionValueChangeButton_C) == 0x000008, "Wrong alignment on UWBP_ItemInteractionValueChangeButton_C");
static_assert(sizeof(UWBP_ItemInteractionValueChangeButton_C) == 0x000300, "Wrong size on UWBP_ItemInteractionValueChangeButton_C");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ItemInteractionValueChangeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Hover) == 0x000288, "Member 'UWBP_ItemInteractionValueChangeButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Button_ChangeCount) == 0x000290, "Member 'UWBP_ItemInteractionValueChangeButton_C::Button_ChangeCount' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Image_BG) == 0x000298, "Member 'UWBP_ItemInteractionValueChangeButton_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Image_Hover) == 0x0002A0, "Member 'UWBP_ItemInteractionValueChangeButton_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Text_DecreaseCount) == 0x0002A8, "Member 'UWBP_ItemInteractionValueChangeButton_C::Text_DecreaseCount' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Text_IncreaseCount) == 0x0002B0, "Member 'UWBP_ItemInteractionValueChangeButton_C::Text_IncreaseCount' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, WidgetSwitcher_ButtonType) == 0x0002B8, "Member 'UWBP_ItemInteractionValueChangeButton_C::WidgetSwitcher_ButtonType' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, OnChangeValueButtonPressed) == 0x0002C0, "Member 'UWBP_ItemInteractionValueChangeButton_C::OnChangeValueButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, bIncreaseValue) == 0x0002D0, "Member 'UWBP_ItemInteractionValueChangeButton_C::bIncreaseValue' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, Enabled) == 0x0002D1, "Member 'UWBP_ItemInteractionValueChangeButton_C::Enabled' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, OnDisabled) == 0x0002D8, "Member 'UWBP_ItemInteractionValueChangeButton_C::OnDisabled' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, bHovered) == 0x0002E8, "Member 'UWBP_ItemInteractionValueChangeButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UWBP_ItemInteractionValueChangeButton_C, OnReleased) == 0x0002F0, "Member 'UWBP_ItemInteractionValueChangeButton_C::OnReleased' has a wrong offset!");

}

