#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionContainerEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.ButtonHover
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_ButtonHover final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWithAnim;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_ButtonHover) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_ButtonHover");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_ButtonHover) == 0x000010, "Wrong size on WBP_ItemInteractionContainerEntry_C_ButtonHover");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, bHovered) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::bHovered' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, bWithAnim) == 0x000001, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::bWithAnim' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, Temp_byte_Variable) == 0x000002, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, Temp_bool_Variable) == 0x000004, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, K2Node_Select_Default) == 0x000005, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ButtonHover, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionContainerEntry_C_ButtonHover::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.ExecuteUbergraph_WBP_ItemInteractionContainerEntry
// 0x0030 (0x0030 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry) == 0x000030, "Wrong size on WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, EntryPoint) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, CallFunc_PlayEvent2D_ReturnValue) == 0x000018, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000028, "Member 'WBP_ItemInteractionContainerEntry_C_ExecuteUbergraph_WBP_ItemInteractionContainerEntry::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.GetCustomLock
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_GetCustomLock final
{
public:
	bool                                          Param_bCustomLock;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_GetCustomLock) == 0x000001, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_GetCustomLock");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_GetCustomLock) == 0x000001, "Wrong size on WBP_ItemInteractionContainerEntry_C_GetCustomLock");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_GetCustomLock, Param_bCustomLock) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_GetCustomLock::Param_bCustomLock' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.GetItemInfo
// 0x0220 (0x0220 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_GetItemInfo final
{
public:
	struct FFItemInfo                             Param_ItemInfo;                                    // 0x0000(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_GetItemInfo) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_GetItemInfo");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_GetItemInfo) == 0x000220, "Wrong size on WBP_ItemInteractionContainerEntry_C_GetItemInfo");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_GetItemInfo, Param_ItemInfo) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_GetItemInfo::Param_ItemInfo' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.GetItemName
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_GetItemName final
{
public:
	class FName                                   CraftItemName;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_GetItemName) == 0x000004, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_GetItemName");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_GetItemName) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_GetItemName");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_GetItemName, CraftItemName) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_GetItemName::CraftItemName' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.Init
// 0x0340 (0x0340 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_Init final
{
public:
	struct FFItemInfo                             Item;                                              // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0228(0x0018)()
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0260(0x00D0)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_Init) == 0x000010, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_Init");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_Init) == 0x000340, "Wrong size on WBP_ItemInteractionContainerEntry_C_Init");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, Item) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_Init::Item' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_Greater_IntInt_ReturnValue) == 0x000220, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000228, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000240, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000248, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, K2Node_DynamicCast_AsPaper_Sprite) == 0x000250, "Member 'WBP_ItemInteractionContainerEntry_C_Init::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'WBP_ItemInteractionContainerEntry_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000260, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x000330, "Member 'WBP_ItemInteractionContainerEntry_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_ItemInteractionContainerEntry_C*   Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature, Ref) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnHovered__DelegateSignature::Ref' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnInstantCraft__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature final
{
public:
	class UWBP_ItemInteractionContainerEntry_C*   Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature, Entry) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnInstantCraft__DelegateSignature::Entry' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnMouseButtonDown
// 0x0228 (0x0228 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0170(0x00B8)()
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown) == 0x000228, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000168, "Member 'WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000170, "Member 'WBP_ItemInteractionContainerEntry_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature final
{
public:
	class UWBP_ItemInteractionContainerEntry_C*   ItemWidgetRef;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature, ItemWidgetRef) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnSelected__DelegateSignature::ItemWidgetRef' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_ItemInteractionContainerEntry_C*   Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature, Ref) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_OnUnhovered__DelegateSignature::Ref' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_PreConstruct");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemInteractionContainerEntry_C_PreConstruct");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.SetBGItemIcon
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_SetBGItemIcon final
{
public:
	class UWBP_ItemInteractionContainerEntry_C*   Ref;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_SetBGItemIcon");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon) == 0x000018, "Wrong size on WBP_ItemInteractionContainerEntry_C_SetBGItemIcon");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, Ref) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::Ref' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, Temp_byte_Variable) == 0x000008, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, Temp_bool_Variable) == 0x00000A, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, K2Node_Select_Default) == 0x00000B, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetBGItemIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_ItemInteractionContainerEntry_C_SetBGItemIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.SetCanUseAction
// 0x0048 (0x0048 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_SetCanUseAction final
{
public:
	bool                                          CanCraft;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            K2Node_Select_Default_1;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_SetCanUseAction");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction) == 0x000048, "Wrong size on WBP_ItemInteractionContainerEntry_C_SetCanUseAction");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, CanCraft) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::CanCraft' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_byte_Variable) == 0x000001, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_bool_Variable) == 0x000003, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, K2Node_Select_Default) == 0x000010, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, K2Node_MakeStruct_Margin) == 0x000014, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, CallFunc_SelectFloat_ReturnValue_1) == 0x000038, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, K2Node_MakeStruct_Top_ImplicitCast) == 0x000040, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCanUseAction, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000044, "Member 'WBP_ItemInteractionContainerEntry_C_SetCanUseAction::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.SetCustomLock
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_SetCustomLock final
{
public:
	bool                                          Lock;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_SetCustomLock) == 0x000001, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_SetCustomLock");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_SetCustomLock) == 0x000001, "Wrong size on WBP_ItemInteractionContainerEntry_C_SetCustomLock");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetCustomLock, Lock) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_SetCustomLock::Lock' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.SetItemIconSize
// 0x0030 (0x0030 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_SetItemIconSize final
{
public:
	int32                                         Size_Y;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Size_X;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize) == 0x000008, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_SetItemIconSize");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize) == 0x000030, "Wrong size on WBP_ItemInteractionContainerEntry_C_SetItemIconSize");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, Size_Y) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::Size_Y' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, Size_X) == 0x000004, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::Size_X' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00000A, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00000B, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x00000E, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x00000F, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x000010, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x000011, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BooleanAND_ReturnValue_2) == 0x000012, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BooleanAND_ReturnValue_3) == 0x000013, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x000014, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_EqualEqual_IntInt_ReturnValue_9) == 0x000015, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_EqualEqual_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BooleanAND_ReturnValue_4) == 0x000016, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_FTrunc_ReturnValue) == 0x000028, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetItemIconSize, CallFunc_FTrunc_ReturnValue_1) == 0x00002C, "Member 'WBP_ItemInteractionContainerEntry_C_SetItemIconSize::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function WBP_ItemInteractionContainerEntry.WBP_ItemInteractionContainerEntry_C.SetSelected
// 0x0030 (0x0030 - 0x0000)
struct WBP_ItemInteractionContainerEntry_C_SetSelected final
{
public:
	bool                                          Param_Selected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionContainerEntry_C_SetSelected) == 0x000004, "Wrong alignment on WBP_ItemInteractionContainerEntry_C_SetSelected");
static_assert(sizeof(WBP_ItemInteractionContainerEntry_C_SetSelected) == 0x000030, "Wrong size on WBP_ItemInteractionContainerEntry_C_SetSelected");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetSelected, Param_Selected) == 0x000000, "Member 'WBP_ItemInteractionContainerEntry_C_SetSelected::Param_Selected' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionContainerEntry_C_SetSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_ItemInteractionContainerEntry_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
