#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameNotifications

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameNotifications.WBP_IngameNotifications_C.ExecuteUbergraph_WBP_IngameNotifications
// 0x0360 (0x0360 - 0x0000)
struct WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x01B0(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0220(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_17;                             // 0x0290(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0320(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0330(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0348(0x0018)()
};
static_assert(alignof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications) == 0x000008, "Wrong alignment on WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications");
static_assert(sizeof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications) == 0x000360, "Wrong size on WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, EntryPoint) == 0x000000, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable) == 0x000008, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_1) == 0x000020, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_2) == 0x000038, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_3) == 0x000050, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_4) == 0x000068, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_5) == 0x000080, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_6) == 0x000098, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_bool_Variable) == 0x0000D0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_byte_Variable) == 0x0000D1, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_byte_Variable_1) == 0x0000D2, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_int_Variable) == 0x0000D4, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_7) == 0x0000D8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_8) == 0x0000F0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_9) == 0x000108, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_10) == 0x000120, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_11) == 0x000138, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_12) == 0x000150, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_13) == 0x000168, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_14) == 0x000180, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_15) == 0x000198, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_16) == 0x0001B0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_Event_IsDesignTime) == 0x0001C8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_Concat_StrStr_ReturnValue) == 0x0001D0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_IsEmpty_ReturnValue) == 0x0001E0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_SelectString_ReturnValue) == 0x0001E8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_Conv_StringToText_ReturnValue) == 0x0001F8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000210, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000218, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_MakeStruct_FormatArgumentData) == 0x000220, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_IsValid_ReturnValue) == 0x000270, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000278, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000280, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_IsValid_ReturnValue_1) == 0x000288, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_text_Variable_17) == 0x000290, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, Temp_int_Variable_1) == 0x0002A8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002AC, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_Select_Default) == 0x0002B0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_Select_Default_1) == 0x0002C8, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002D0, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_MakeArray_Array) == 0x000320, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, CallFunc_Format_ReturnValue) == 0x000330, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications, K2Node_Select_Default_2) == 0x000348, "Member 'WBP_IngameNotifications_C_ExecuteUbergraph_WBP_IngameNotifications::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_IngameNotifications.WBP_IngameNotifications_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameNotifications_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameNotifications_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_IngameNotifications_C_PreConstruct");
static_assert(sizeof(WBP_IngameNotifications_C_PreConstruct) == 0x000001, "Wrong size on WBP_IngameNotifications_C_PreConstruct");
static_assert(offsetof(WBP_IngameNotifications_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_IngameNotifications_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

