#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LeaveCurrentAreaEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LeaveCurrentAreaEntry.WBP_LeaveCurrentAreaEntry_C
// 0x0040 (0x02C0 - 0x0280)
class UWBP_LeaveCurrentAreaEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CircleRevolving;                                   // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerIndex;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerName;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ReadyState;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              PlayerState;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Busy_;                                             // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Destruct();
	void ExecuteUbergraph_WBP_LeaveCurrentAreaEntry(int32 EntryPoint);
	void OnAcceptTeleport(bool Accepted);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LeaveCurrentAreaEntry_C">();
	}
	static class UWBP_LeaveCurrentAreaEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LeaveCurrentAreaEntry_C>();
	}
};
static_assert(alignof(UWBP_LeaveCurrentAreaEntry_C) == 0x000008, "Wrong alignment on UWBP_LeaveCurrentAreaEntry_C");
static_assert(sizeof(UWBP_LeaveCurrentAreaEntry_C) == 0x0002C0, "Wrong size on UWBP_LeaveCurrentAreaEntry_C");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, UberGraphFrame) == 0x000280, "Member 'UWBP_LeaveCurrentAreaEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, CircleRevolving) == 0x000288, "Member 'UWBP_LeaveCurrentAreaEntry_C::CircleRevolving' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, Text_PlayerIndex) == 0x000290, "Member 'UWBP_LeaveCurrentAreaEntry_C::Text_PlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, Text_PlayerName) == 0x000298, "Member 'UWBP_LeaveCurrentAreaEntry_C::Text_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, WidgetSwitcher_ReadyState) == 0x0002A0, "Member 'UWBP_LeaveCurrentAreaEntry_C::WidgetSwitcher_ReadyState' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, PlayerIndex) == 0x0002A8, "Member 'UWBP_LeaveCurrentAreaEntry_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, PlayerState) == 0x0002B0, "Member 'UWBP_LeaveCurrentAreaEntry_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_LeaveCurrentAreaEntry_C, Busy_) == 0x0002B8, "Member 'UWBP_LeaveCurrentAreaEntry_C::Busy_' has a wrong offset!");

}

