#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarShopAcceptBuyWindow

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_CarShopAcceptBuyWindow.WBP_CarShopAcceptBuyWindow_C.ExecuteUbergraph_WBP_CarShopAcceptBuyWindow
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow) == 0x000008, "Wrong alignment on WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow");
static_assert(sizeof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow) == 0x0000A0, "Wrong size on WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, EntryPoint) == 0x000000, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_PlayEvent2D_ReturnValue) == 0x000048, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000050, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000070, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000078, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000088, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000090, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'WBP_CarShopAcceptBuyWindow_C_ExecuteUbergraph_WBP_CarShopAcceptBuyWindow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CarShopAcceptBuyWindow.WBP_CarShopAcceptBuyWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CarShopAcceptBuyWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CarShopAcceptBuyWindow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CarShopAcceptBuyWindow_C_PreConstruct");
static_assert(sizeof(WBP_CarShopAcceptBuyWindow_C_PreConstruct) == 0x000001, "Wrong size on WBP_CarShopAcceptBuyWindow_C_PreConstruct");
static_assert(offsetof(WBP_CarShopAcceptBuyWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CarShopAcceptBuyWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

