#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftErrorMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CraftErrorMessage.WBP_CraftErrorMessage_C
// 0x0050 (0x02D0 - 0x0280)
class UWBP_CraftErrorMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide_Anim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowWarningMessage_Anim;                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_38;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_145;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_148;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_337;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_37;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Message;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CraftErrorMessage(int32 EntryPoint);
	void HideErrorMessage();
	void SetText(const class FText& Text);
	void ShowErrorMessage(const class FText& MessageText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CraftErrorMessage_C">();
	}
	static class UWBP_CraftErrorMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CraftErrorMessage_C>();
	}
};
static_assert(alignof(UWBP_CraftErrorMessage_C) == 0x000008, "Wrong alignment on UWBP_CraftErrorMessage_C");
static_assert(sizeof(UWBP_CraftErrorMessage_C) == 0x0002D0, "Wrong size on UWBP_CraftErrorMessage_C");
static_assert(offsetof(UWBP_CraftErrorMessage_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CraftErrorMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Hide_Anim) == 0x000288, "Member 'UWBP_CraftErrorMessage_C::Hide_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, ShowWarningMessage_Anim) == 0x000290, "Member 'UWBP_CraftErrorMessage_C::ShowWarningMessage_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Image_38) == 0x000298, "Member 'UWBP_CraftErrorMessage_C::Image_38' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Image_87) == 0x0002A0, "Member 'UWBP_CraftErrorMessage_C::Image_87' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Image_145) == 0x0002A8, "Member 'UWBP_CraftErrorMessage_C::Image_145' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Image_148) == 0x0002B0, "Member 'UWBP_CraftErrorMessage_C::Image_148' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Image_337) == 0x0002B8, "Member 'UWBP_CraftErrorMessage_C::Image_337' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, SizeBox_37) == 0x0002C0, "Member 'UWBP_CraftErrorMessage_C::SizeBox_37' has a wrong offset!");
static_assert(offsetof(UWBP_CraftErrorMessage_C, Text_Message) == 0x0002C8, "Member 'UWBP_CraftErrorMessage_C::Text_Message' has a wrong offset!");

}

