#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_inviteHomeOffer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_inviteHomeOffer.WBP_inviteHomeOffer_C.AcceptInvide__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature final
{
public:
	class APS_TDB_C*                              NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature) == 0x000008, "Wrong alignment on WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature");
static_assert(sizeof(WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature) == 0x000008, "Wrong size on WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature");
static_assert(offsetof(WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature, NewParam) == 0x000000, "Member 'WBP_inviteHomeOffer_C_AcceptInvide__DelegateSignature::NewParam' has a wrong offset!");

// Function WBP_inviteHomeOffer.WBP_inviteHomeOffer_C.ExecuteUbergraph_WBP_inviteHomeOffer
// 0x0048 (0x0048 - 0x0000)
struct WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer) == 0x000008, "Wrong alignment on WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer");
static_assert(sizeof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer) == 0x000048, "Wrong size on WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer");
static_assert(offsetof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer, EntryPoint) == 0x000000, "Member 'WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000018, "Member 'WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_inviteHomeOffer_C_ExecuteUbergraph_WBP_inviteHomeOffer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_inviteHomeOffer.WBP_inviteHomeOffer_C.GetFocused
// 0x0001 (0x0001 - 0x0000)
struct WBP_inviteHomeOffer_C_GetFocused final
{
public:
	bool                                          Focused;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_inviteHomeOffer_C_GetFocused) == 0x000001, "Wrong alignment on WBP_inviteHomeOffer_C_GetFocused");
static_assert(sizeof(WBP_inviteHomeOffer_C_GetFocused) == 0x000001, "Wrong size on WBP_inviteHomeOffer_C_GetFocused");
static_assert(offsetof(WBP_inviteHomeOffer_C_GetFocused, Focused) == 0x000000, "Member 'WBP_inviteHomeOffer_C_GetFocused::Focused' has a wrong offset!");

// Function WBP_inviteHomeOffer.WBP_inviteHomeOffer_C.SetFocused
// 0x0002 (0x0002 - 0x0000)
struct WBP_inviteHomeOffer_C_SetFocused final
{
public:
	bool                                          NewFocus;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_inviteHomeOffer_C_SetFocused) == 0x000001, "Wrong alignment on WBP_inviteHomeOffer_C_SetFocused");
static_assert(sizeof(WBP_inviteHomeOffer_C_SetFocused) == 0x000002, "Wrong size on WBP_inviteHomeOffer_C_SetFocused");
static_assert(offsetof(WBP_inviteHomeOffer_C_SetFocused, NewFocus) == 0x000000, "Member 'WBP_inviteHomeOffer_C_SetFocused::NewFocus' has a wrong offset!");
static_assert(offsetof(WBP_inviteHomeOffer_C_SetFocused, Success) == 0x000001, "Member 'WBP_inviteHomeOffer_C_SetFocused::Success' has a wrong offset!");

}

