#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TipsUI1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TipsUI1.WBP_TipsUI1_C.ExecuteUbergraph_WBP_TipsUI1
// 0x0040 (0x0040 - 0x0000)
struct WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_TipName;                        // 0x0008(0x0018)()
	class FText                                   K2Node_CustomEvent_ActualTip;                      // 0x0020(0x0018)()
	float                                         K2Node_CustomEvent_Duration;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1) == 0x000008, "Wrong alignment on WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1");
static_assert(sizeof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1) == 0x000040, "Wrong size on WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1");
static_assert(offsetof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1, EntryPoint) == 0x000000, "Member 'WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1, K2Node_CustomEvent_TipName) == 0x000008, "Member 'WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1::K2Node_CustomEvent_TipName' has a wrong offset!");
static_assert(offsetof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1, K2Node_CustomEvent_ActualTip) == 0x000020, "Member 'WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1::K2Node_CustomEvent_ActualTip' has a wrong offset!");
static_assert(offsetof(WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1, K2Node_CustomEvent_Duration) == 0x000038, "Member 'WBP_TipsUI1_C_ExecuteUbergraph_WBP_TipsUI1::K2Node_CustomEvent_Duration' has a wrong offset!");

// Function WBP_TipsUI1.WBP_TipsUI1_C.TipVisible
// 0x0038 (0x0038 - 0x0000)
struct WBP_TipsUI1_C_TipVisible final
{
public:
	class FText                                   TipName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ActualTip;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Duration;                                          // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TipsUI1_C_TipVisible) == 0x000008, "Wrong alignment on WBP_TipsUI1_C_TipVisible");
static_assert(sizeof(WBP_TipsUI1_C_TipVisible) == 0x000038, "Wrong size on WBP_TipsUI1_C_TipVisible");
static_assert(offsetof(WBP_TipsUI1_C_TipVisible, TipName) == 0x000000, "Member 'WBP_TipsUI1_C_TipVisible::TipName' has a wrong offset!");
static_assert(offsetof(WBP_TipsUI1_C_TipVisible, ActualTip) == 0x000018, "Member 'WBP_TipsUI1_C_TipVisible::ActualTip' has a wrong offset!");
static_assert(offsetof(WBP_TipsUI1_C_TipVisible, Duration) == 0x000030, "Member 'WBP_TipsUI1_C_TipVisible::Duration' has a wrong offset!");

}

