#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CookingItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "S_ItemsToCraft_structs.hpp"


namespace SDK::Params
{

// Function WBP_CookingItem.WBP_CookingItem_C.ExecuteUbergraph_WBP_CookingItem
// 0x0340 (0x0340 - 0x0000)
struct WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ItemName;                       // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindData_Result;                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x00D0(0x00D0)()
	double                                        CallFunc_BreakVector2D_X;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01F8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0230(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x02A8(0x0078)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_323[0x5];                                      // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_BreakVector2D_InVec_ImplicitCast;         // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem) == 0x000010, "Wrong alignment on WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem");
static_assert(sizeof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem) == 0x000340, "Wrong size on WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, EntryPoint) == 0x000000, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, Temp_object_Variable) == 0x000008, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_DynamicCast_AsPaper_Sprite) == 0x000010, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_DynamicCast_AsSurvival_Player) == 0x000028, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_CustomEvent_ItemName) == 0x000034, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_CustomEvent_ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Event_MyGeometry_1) == 0x00003C, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Event_InDeltaTime) == 0x000074, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_CustomEvent_Loaded) == 0x000078, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000088, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_FindData_Result) == 0x000090, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_FindData_Result' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000098, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000A0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, Temp_bool_Variable) == 0x0000A8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0000D0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_BreakVector2D_X) == 0x0001A0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_BreakVector2D_Y) == 0x0001A8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_MakeVector2D_ReturnValue) == 0x0001C8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001E0, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_MakeVector2D_ReturnValue_1) == 0x0001E8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Event_MyGeometry) == 0x0001F8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Event_MouseEvent_1) == 0x000230, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, K2Node_Event_MouseEvent) == 0x0002A8, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Not_PreBool_ReturnValue) == 0x000320, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x000321, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x000322, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem, CallFunc_BreakVector2D_InVec_ImplicitCast) == 0x000328, "Member 'WBP_CookingItem_C_ExecuteUbergraph_WBP_CookingItem::CallFunc_BreakVector2D_InVec_ImplicitCast' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.FindData
// 0x0390 (0x0390 - 0x0000)
struct WBP_CookingItem_C_FindData final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ItemsToCraft                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0150)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0168(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_FindData) == 0x000010, "Wrong alignment on WBP_CookingItem_C_FindData");
static_assert(sizeof(WBP_CookingItem_C_FindData) == 0x000390, "Wrong size on WBP_CookingItem_C_FindData");
static_assert(offsetof(WBP_CookingItem_C_FindData, Result) == 0x000000, "Member 'WBP_CookingItem_C_FindData::Result' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_FindData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'WBP_CookingItem_C_FindData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_FindData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000160, "Member 'WBP_CookingItem_C_FindData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_FindData, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000168, "Member 'WBP_CookingItem_C_FindData::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_FindData, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000388, "Member 'WBP_CookingItem_C_FindData::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.GetContainerPickupsInfo
// 0x0200 (0x0200 - 0x0000)
struct WBP_CookingItem_C_GetContainerPickupsInfo final
{
public:
	class FName                                   Param_ItemName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  PickupsInfo;                                       // 0x0008(0x0068)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  K2Node_MakeStruct_ContainerPickupsInfo;            // 0x0078(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0118(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x0190(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_GetContainerPickupsInfo) == 0x000008, "Wrong alignment on WBP_CookingItem_C_GetContainerPickupsInfo");
static_assert(sizeof(WBP_CookingItem_C_GetContainerPickupsInfo) == 0x000200, "Wrong size on WBP_CookingItem_C_GetContainerPickupsInfo");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, Param_ItemName) == 0x000000, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::Param_ItemName' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, PickupsInfo) == 0x000008, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::PickupsInfo' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, K2Node_MakeStruct_ContainerPickupsInfo) == 0x000078, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::K2Node_MakeStruct_ContainerPickupsInfo' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, Temp_int_Loop_Counter_Variable) == 0x0000E0, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Add_IntInt_ReturnValue) == 0x0000E4, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, Temp_int_Loop_Counter_Variable_1) == 0x0000E8, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000EC, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_getItemsInventory_ContainerItems) == 0x0000F0, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_getItemsInventory_ContainersData) == 0x000100, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000184, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000188, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000189, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00018A, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_BooleanAND_ReturnValue) == 0x00018B, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_Array_Get_Item_1) == 0x000190, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0001F8, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001F9, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetContainerPickupsInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x0001FA, "Member 'WBP_CookingItem_C_GetContainerPickupsInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.GetItemsCount
// 0x0140 (0x0140 - 0x0000)
struct WBP_CookingItem_C_GetItemsCount final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0050(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_GetItemsCount) == 0x000008, "Wrong alignment on WBP_CookingItem_C_GetItemsCount");
static_assert(sizeof(WBP_CookingItem_C_GetItemsCount) == 0x000140, "Wrong size on WBP_CookingItem_C_GetItemsCount");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_CookingItem_C_GetItemsCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_CookingItem_C_GetItemsCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_CookingItem_C_GetItemsCount::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_CookingItem_C_GetItemsCount::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainerItems) == 0x000018, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_getItemsInventory_ContainersData) == 0x000028, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Less_IntInt_ReturnValue) == 0x0000BD, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000C0, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C4, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000131, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000132, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Array_Length_ReturnValue_1) == 0x000134, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_BooleanAND_ReturnValue_1) == 0x000138, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x000139, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_GetItemsCount, CallFunc_Add_IntInt_ReturnValue_3) == 0x00013C, "Member 'WBP_CookingItem_C_GetItemsCount::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnCraftingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnCraftingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnCraftingFinished__DelegateSignature");
static_assert(sizeof(WBP_CookingItem_C_OnCraftingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_CookingItem_C_OnCraftingFinished__DelegateSignature");
static_assert(offsetof(WBP_CookingItem_C_OnCraftingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_CookingItem_C_OnCraftingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnDismantlingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(sizeof(WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature) == 0x000008, "Wrong size on WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature");
static_assert(offsetof(WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature, Item) == 0x000000, "Member 'WBP_CookingItem_C_OnDismantlingFinished__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnDragDetected
// 0x0320 (0x0320 - 0x0000)
struct WBP_CookingItem_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CampDragWidget_C*                  CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJigSDragOperation_C*                   CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equip_Item_Equipped;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_Equip_Item_SlotItemRef;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnequipItem_Unequipped;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_UnequipItem_SlotRef;                      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODAudioComponent*                    CallFunc_PlayEventAttached_ReturnValue;            // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnDragDetected");
static_assert(sizeof(WBP_CookingItem_C_OnDragDetected) == 0x000320, "Wrong size on WBP_CookingItem_C_OnDragDetected");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_CookingItem_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_CookingItem_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WBP_CookingItem_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000C0, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_Equip_Item_Equipped) == 0x0000C8, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_Equip_Item_Equipped' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_Equip_Item_SlotItemRef) == 0x0000D0, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_Equip_Item_SlotItemRef' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_UnequipItem_Unequipped) == 0x0000D8, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_UnequipItem_Unequipped' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_UnequipItem_SlotRef) == 0x0000E0, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_UnequipItem_SlotRef' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E8, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F0, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000310, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnDragDetected, CallFunc_PlayEventAttached_ReturnValue) == 0x000318, "Member 'WBP_CookingItem_C_OnDragDetected::CallFunc_PlayEventAttached_ReturnValue' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnLoaded_F0587668436360543D061D9CE5036539
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539");
static_assert(sizeof(WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539) == 0x000008, "Wrong size on WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539");
static_assert(offsetof(WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539, Loaded) == 0x000000, "Member 'WBP_CookingItem_C_OnLoaded_F0587668436360543D061D9CE5036539::Loaded' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnMouseButtonDown
// 0x0240 (0x0240 - 0x0000)
struct WBP_CookingItem_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnMouseButtonDown");
static_assert(sizeof(WBP_CookingItem_C_OnMouseButtonDown) == 0x000240, "Wrong size on WBP_CookingItem_C_OnMouseButtonDown");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_CookingItem_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_CookingItem_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_CookingItem_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'WBP_CookingItem_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000220, "Member 'WBP_CookingItem_C_OnMouseButtonDown::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseButtonDown, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000230, "Member 'WBP_CookingItem_C_OnMouseButtonDown::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_CookingItem_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CookingItem_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnMouseEnter");
static_assert(sizeof(WBP_CookingItem_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_CookingItem_C_OnMouseEnter");
static_assert(offsetof(WBP_CookingItem_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_CookingItem_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_CookingItem_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_CookingItem_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CookingItem_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnMouseLeave");
static_assert(sizeof(WBP_CookingItem_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_CookingItem_C_OnMouseLeave");
static_assert(offsetof(WBP_CookingItem_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_CookingItem_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnNotEnoughtInventorySpace__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(sizeof(WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature) == 0x000008, "Wrong size on WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature");
static_assert(offsetof(WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature, Item) == 0x000000, "Member 'WBP_CookingItem_C_OnNotEnoughtInventorySpace__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnNotEnoughtResources__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature final
{
public:
	class UWBP_CraftItem_C*                       Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(sizeof(WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature) == 0x000008, "Wrong size on WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature");
static_assert(offsetof(WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature, Item) == 0x000000, "Member 'WBP_CookingItem_C_OnNotEnoughtResources__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CookingItem_C_OnSelected__DelegateSignature final
{
public:
	class UWBP_CookingItem_C*                     Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CookingItem_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_CookingItem_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_CookingItem_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_CookingItem_C_OnSelected__DelegateSignature, Item) == 0x000000, "Member 'WBP_CookingItem_C_OnSelected__DelegateSignature::Item' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CookingItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CookingItem_C_Tick) == 0x000004, "Wrong alignment on WBP_CookingItem_C_Tick");
static_assert(sizeof(WBP_CookingItem_C_Tick) == 0x00003C, "Wrong size on WBP_CookingItem_C_Tick");
static_assert(offsetof(WBP_CookingItem_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CookingItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CookingItem_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_CookingItem.WBP_CookingItem_C.UpdateCount
// 0x0530 (0x0530 - 0x0000)
struct WBP_CookingItem_C_UpdateCount final
{
public:
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0030(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_1;        // 0x0100(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_2;        // 0x01D0(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_3;        // 0x02A0(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_4;        // 0x0370(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue_5;        // 0x0440(0x00D0)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0518(0x0018)()
};
static_assert(alignof(WBP_CookingItem_C_UpdateCount) == 0x000010, "Wrong alignment on WBP_CookingItem_C_UpdateCount");
static_assert(sizeof(WBP_CookingItem_C_UpdateCount) == 0x000530, "Wrong size on WBP_CookingItem_C_UpdateCount");
static_assert(offsetof(WBP_CookingItem_C_UpdateCount, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000000, "Member 'WBP_CookingItem_C_UpdateCount::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CookingItem_C_UpdateCount, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_CookingItem_C_UpdateCount::K2Node_MakeStruct_Margin' has a wrong offset!");
