#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_CarStatus_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadialInteraction.WBP_RadialInteraction_C
// 0x0240 (0x04C0 - 0x0280)
class UWBP_RadialInteraction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show_Anim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_BarExit;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_BarMenu;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_EnterVehicle;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ExitDoorHouse;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ExitDoorHouse_1;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ExitDoorRaid;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Refill;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Repair;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ToTheCityJeep;                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BarExit;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BarMenu;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Car;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ExitDoorHouse;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ExitDoorHouse_1;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ExitDoorHub;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ExitDoorHub_1;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ExitDoorRaid;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Refill;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Repair;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ToTheCityJeep;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_BarExit;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_BarMenu;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_Enter;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_ExitDoorHouse;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_ExitDoorHouse_1;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_ExitDoorRaid;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_Refill;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_Repair;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Interact_C*                          W_Interact_ToTheCityJeep;                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Content;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ExitDoorSafeZone;                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ExitDoorSafeZone_1;                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_WithCar_;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RadialInteractionShowed;                           // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InteractedVehicle;                                 // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         VehicleSitIndex;                                   // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      As_Survival_Player;                                // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Repair_KitsRequired;                               // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Repair_MoneyMultiplyer;                            // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Refill_GasRequired;                                // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Refill_MoneyMultiplier;                            // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ItemName_Money;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ItemName_RepairKit;                                // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ItemName_Refil;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UGI_Survival_C*                         As_GI_Survival;                                    // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         VehicleActionIndex;                                // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Time_Enter;                                        // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_Refill;                                       // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time_Repair;                                       // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BarActionIndex;                                    // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InteractedBar;                                     // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APS_TDB_C*                              PS_TDB;                                            // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_TeleporterDoorMaster_C*             InteractedExitDoor;                                // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ExitDoorActionIndex;                               // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           Current_Tutorial_Stage;                            // 0x0448(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPlayerCutsceneComponent_C*             CutsceneComponentRef;                              // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnShowRadialMenu;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHideRadialMenu;                                  // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	double CalculateRefillMoneyRequiered(class UObject* VehicleReference);
	double CalculateRepairMoneyRequiered(class UObject* VehicleReference);
	void CallBarActionByIndex();
	void CallBarActionByIndexChair();
	void CallCarActionByIndex();
	void CallDoorActionByIndex();
	void CanTakeSeat(bool Can, int32 SeatIndex);
	void CheckPlayerCar();
	void Construct();
	void EnterVehicle();
	void ExecuteUbergraph_WBP_RadialInteraction(int32 EntryPoint);
	void ExitBar();
	void ExitDoor_House();
	void ExitDoor_Raid();
	void ExitDoor_ToTheCity();
	void GetDoorActionIndex(int32* Param_ExitDoorActionIndex);
	void GetHaveActiveCar(bool* Return);
	void GetInteractTimeBarByActiveIndex(double* Time, class UW_Interact_C** InteractWidget);
	void GetInteractTimeDoorByActiveIndex(double* Time, class UW_Interact_C** InteractWidget);
	void GetInteractTimeVehicleByActiveIndex(double* Time, class UW_Interact_C** InteractWidget);
	void GetShowed(bool* Showed);
	void InitBarExit();
	void InitExitDoor_House();
	void InitExitDoor_Raid();
	void InitOpenMenu();
	void InitRefill();
	void InitRepair();
	void InitToTheCity_withCar_();
	void InstantHide();
	void IsNotInRaid(bool* bSuccess);
	void OnHideRadialMenu__DelegateSignature();
	void OnShowRadialMenu__DelegateSignature();
	void OpenMenu();
	void RefillVehicle();
	void RepairVehicle();
	void SetActiveBarActionByIndex(int32 ActionIndex);
	void SetActiveDoorActionByIndex(int32 ActionIndex);
	void SetActiveVehicleActionByIndex(int32 ActionIndex);
	void Show(bool Param_Show, bool* NewState);
	void ShowBarInteraction(bool bShow, class UObject* InteractiveActor);
	void ShowExitDoorInteraction(bool bShow, class UObject* InteractiveActor);
	void ShowVehicleInteraction(bool bShow, class UObject* InteractiveActor);
	void StopInteract();
	void StopListenAll();
	void StopListenEnterEvent();
	void StopListenExitRaid();
	void StopListenRefillEvent();
	void StopListenRepairEvent();
	void StopRefill();
	void StopRepair();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadialInteraction_C">();
	}
	static class UWBP_RadialInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadialInteraction_C>();
	}
};
static_assert(alignof(UWBP_RadialInteraction_C) == 0x000008, "Wrong alignment on UWBP_RadialInteraction_C");
static_assert(sizeof(UWBP_RadialInteraction_C) == 0x0004C0, "Wrong size on UWBP_RadialInteraction_C");
static_assert(offsetof(UWBP_RadialInteraction_C, UberGraphFrame) == 0x000280, "Member 'UWBP_RadialInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Show_Anim) == 0x000288, "Member 'UWBP_RadialInteraction_C::Show_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_BarExit) == 0x000290, "Member 'UWBP_RadialInteraction_C::HorizontalBox_BarExit' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_BarMenu) == 0x000298, "Member 'UWBP_RadialInteraction_C::HorizontalBox_BarMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_EnterVehicle) == 0x0002A0, "Member 'UWBP_RadialInteraction_C::HorizontalBox_EnterVehicle' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_ExitDoorHouse) == 0x0002A8, "Member 'UWBP_RadialInteraction_C::HorizontalBox_ExitDoorHouse' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_ExitDoorHouse_1) == 0x0002B0, "Member 'UWBP_RadialInteraction_C::HorizontalBox_ExitDoorHouse_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_ExitDoorRaid) == 0x0002B8, "Member 'UWBP_RadialInteraction_C::HorizontalBox_ExitDoorRaid' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_Refill) == 0x0002C0, "Member 'UWBP_RadialInteraction_C::HorizontalBox_Refill' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_Repair) == 0x0002C8, "Member 'UWBP_RadialInteraction_C::HorizontalBox_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, HorizontalBox_ToTheCityJeep) == 0x0002D0, "Member 'UWBP_RadialInteraction_C::HorizontalBox_ToTheCityJeep' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_BarExit) == 0x0002D8, "Member 'UWBP_RadialInteraction_C::TextBlock_BarExit' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_BarMenu) == 0x0002E0, "Member 'UWBP_RadialInteraction_C::TextBlock_BarMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_Car) == 0x0002E8, "Member 'UWBP_RadialInteraction_C::TextBlock_Car' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ExitDoorHouse) == 0x0002F0, "Member 'UWBP_RadialInteraction_C::TextBlock_ExitDoorHouse' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ExitDoorHouse_1) == 0x0002F8, "Member 'UWBP_RadialInteraction_C::TextBlock_ExitDoorHouse_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ExitDoorHub) == 0x000300, "Member 'UWBP_RadialInteraction_C::TextBlock_ExitDoorHub' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ExitDoorHub_1) == 0x000308, "Member 'UWBP_RadialInteraction_C::TextBlock_ExitDoorHub_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ExitDoorRaid) == 0x000310, "Member 'UWBP_RadialInteraction_C::TextBlock_ExitDoorRaid' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_Refill) == 0x000318, "Member 'UWBP_RadialInteraction_C::TextBlock_Refill' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_Repair) == 0x000320, "Member 'UWBP_RadialInteraction_C::TextBlock_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, TextBlock_ToTheCityJeep) == 0x000328, "Member 'UWBP_RadialInteraction_C::TextBlock_ToTheCityJeep' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_BarExit) == 0x000330, "Member 'UWBP_RadialInteraction_C::W_Interact_BarExit' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_BarMenu) == 0x000338, "Member 'UWBP_RadialInteraction_C::W_Interact_BarMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_Enter) == 0x000340, "Member 'UWBP_RadialInteraction_C::W_Interact_Enter' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_ExitDoorHouse) == 0x000348, "Member 'UWBP_RadialInteraction_C::W_Interact_ExitDoorHouse' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_ExitDoorHouse_1) == 0x000350, "Member 'UWBP_RadialInteraction_C::W_Interact_ExitDoorHouse_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_ExitDoorRaid) == 0x000358, "Member 'UWBP_RadialInteraction_C::W_Interact_ExitDoorRaid' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_Refill) == 0x000360, "Member 'UWBP_RadialInteraction_C::W_Interact_Refill' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_Repair) == 0x000368, "Member 'UWBP_RadialInteraction_C::W_Interact_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, W_Interact_ToTheCityJeep) == 0x000370, "Member 'UWBP_RadialInteraction_C::W_Interact_ToTheCityJeep' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, WidgetSwitcher_Content) == 0x000378, "Member 'UWBP_RadialInteraction_C::WidgetSwitcher_Content' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, WidgetSwitcher_ExitDoorSafeZone) == 0x000380, "Member 'UWBP_RadialInteraction_C::WidgetSwitcher_ExitDoorSafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, WidgetSwitcher_ExitDoorSafeZone_1) == 0x000388, "Member 'UWBP_RadialInteraction_C::WidgetSwitcher_ExitDoorSafeZone_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, WidgetSwitcher_WithCar_) == 0x000390, "Member 'UWBP_RadialInteraction_C::WidgetSwitcher_WithCar_' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, RadialInteractionShowed) == 0x000398, "Member 'UWBP_RadialInteraction_C::RadialInteractionShowed' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, InteractedVehicle) == 0x0003A0, "Member 'UWBP_RadialInteraction_C::InteractedVehicle' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, VehicleSitIndex) == 0x0003A8, "Member 'UWBP_RadialInteraction_C::VehicleSitIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, As_Survival_Player) == 0x0003B0, "Member 'UWBP_RadialInteraction_C::As_Survival_Player' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Repair_KitsRequired) == 0x0003B8, "Member 'UWBP_RadialInteraction_C::Repair_KitsRequired' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Repair_MoneyMultiplyer) == 0x0003BC, "Member 'UWBP_RadialInteraction_C::Repair_MoneyMultiplyer' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Refill_GasRequired) == 0x0003C0, "Member 'UWBP_RadialInteraction_C::Refill_GasRequired' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Refill_MoneyMultiplier) == 0x0003C4, "Member 'UWBP_RadialInteraction_C::Refill_MoneyMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, ItemName_Money) == 0x0003C8, "Member 'UWBP_RadialInteraction_C::ItemName_Money' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, ItemName_RepairKit) == 0x0003D8, "Member 'UWBP_RadialInteraction_C::ItemName_RepairKit' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, ItemName_Refil) == 0x0003E8, "Member 'UWBP_RadialInteraction_C::ItemName_Refil' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, As_GI_Survival) == 0x0003F8, "Member 'UWBP_RadialInteraction_C::As_GI_Survival' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, VehicleActionIndex) == 0x000400, "Member 'UWBP_RadialInteraction_C::VehicleActionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Time_Enter) == 0x000408, "Member 'UWBP_RadialInteraction_C::Time_Enter' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Time_Refill) == 0x000410, "Member 'UWBP_RadialInteraction_C::Time_Refill' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Time_Repair) == 0x000418, "Member 'UWBP_RadialInteraction_C::Time_Repair' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, BarActionIndex) == 0x000420, "Member 'UWBP_RadialInteraction_C::BarActionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, InteractedBar) == 0x000428, "Member 'UWBP_RadialInteraction_C::InteractedBar' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, PS_TDB) == 0x000430, "Member 'UWBP_RadialInteraction_C::PS_TDB' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, InteractedExitDoor) == 0x000438, "Member 'UWBP_RadialInteraction_C::InteractedExitDoor' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, ExitDoorActionIndex) == 0x000440, "Member 'UWBP_RadialInteraction_C::ExitDoorActionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, Current_Tutorial_Stage) == 0x000448, "Member 'UWBP_RadialInteraction_C::Current_Tutorial_Stage' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, CutsceneComponentRef) == 0x000498, "Member 'UWBP_RadialInteraction_C::CutsceneComponentRef' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, OnShowRadialMenu) == 0x0004A0, "Member 'UWBP_RadialInteraction_C::OnShowRadialMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RadialInteraction_C, OnHideRadialMenu) == 0x0004B0, "Member 'UWBP_RadialInteraction_C::OnHideRadialMenu' has a wrong offset!");

}

