#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameSettingsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Survival_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameSettingsMenu.WBP_GameSettingsMenu_C
// 0x0098 (0x0320 - 0x0288)
class UWBP_GameSettingsMenu_C final : public USettingsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_SettingDescription_C*                W_SettingDescription;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_AllowGameData;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_TextChatEnabled;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_TextLanguage;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_VoiceChatEnabled;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_VoiceLanguage;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SettingRow_Text_C*                   W_SettingRow_VoiceLinesEnabled;                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         LoadedTextCultures;                                // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         LoadedVoiceCultures;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUserWidget*                            CurrentSettingRow;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    SettingRows;                                       // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             ValueChanged;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnShowApply;                                       // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ApplySettings();
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_AllowGameData_K2Node_ComponentBoundEvent_5_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_TextChatEnabled_K2Node_ComponentBoundEvent_3_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_TextLanguage_K2Node_ComponentBoundEvent_0_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_VoiceChatEnabled_K2Node_ComponentBoundEvent_4_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_VoiceLanguage_K2Node_ComponentBoundEvent_1_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_GameSettingsMenu_W_SettingRow_VoiceLinesEnabled_K2Node_ComponentBoundEvent_2_IndexHasBeenChanged__DelegateSignature(int32 NewIndex);
	void CheckingForValuesChanges(bool* Changed);
	void Construct();
	void ExecuteUbergraph_WBP_GameSettingsMenu(int32 EntryPoint);
	void Init();
	void InitTextCulture();
	void InitVoiceCulture();
	void OnRowDeselected(class UUserWidget* RowWidgetRef);
	void OnRowHovered(class UUserWidget* RowWidgetRef);
	void OnRowSelected(class UUserWidget* RowWidgetRef);
	void OnRowUnhovered(class UUserWidget* RowWidgetRef);
	void OnShowApply__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetDefaultSettings();
	void ValueChanged__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameSettingsMenu_C">();
	}
	static class UWBP_GameSettingsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameSettingsMenu_C>();
	}
};
static_assert(alignof(UWBP_GameSettingsMenu_C) == 0x000008, "Wrong alignment on UWBP_GameSettingsMenu_C");
static_assert(sizeof(UWBP_GameSettingsMenu_C) == 0x000320, "Wrong size on UWBP_GameSettingsMenu_C");
static_assert(offsetof(UWBP_GameSettingsMenu_C, UberGraphFrame) == 0x000288, "Member 'UWBP_GameSettingsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingDescription) == 0x000290, "Member 'UWBP_GameSettingsMenu_C::W_SettingDescription' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_AllowGameData) == 0x000298, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_AllowGameData' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_TextChatEnabled) == 0x0002A0, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_TextChatEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_TextLanguage) == 0x0002A8, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_TextLanguage' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_VoiceChatEnabled) == 0x0002B0, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_VoiceChatEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_VoiceLanguage) == 0x0002B8, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_VoiceLanguage' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, W_SettingRow_VoiceLinesEnabled) == 0x0002C0, "Member 'UWBP_GameSettingsMenu_C::W_SettingRow_VoiceLinesEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, LoadedTextCultures) == 0x0002C8, "Member 'UWBP_GameSettingsMenu_C::LoadedTextCultures' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, LoadedVoiceCultures) == 0x0002D8, "Member 'UWBP_GameSettingsMenu_C::LoadedVoiceCultures' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, CurrentSettingRow) == 0x0002E8, "Member 'UWBP_GameSettingsMenu_C::CurrentSettingRow' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, SettingRows) == 0x0002F0, "Member 'UWBP_GameSettingsMenu_C::SettingRows' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, ValueChanged) == 0x000300, "Member 'UWBP_GameSettingsMenu_C::ValueChanged' has a wrong offset!");
static_assert(offsetof(UWBP_GameSettingsMenu_C, OnShowApply) == 0x000310, "Member 'UWBP_GameSettingsMenu_C::OnShowApply' has a wrong offset!");

}

