#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MarkerSystemWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MarkerSystemWidget.WBP_MarkerSystemWidget_C
// 0x0038 (0x02B8 - 0x0280)
class UWBP_MarkerSystemWidget_C final : public UUserWidget
{
public:
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SecondaryName;                                     // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MainName;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	class FText GetMainName();
	class FText GetSecondaryName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MarkerSystemWidget_C">();
	}
	static class UWBP_MarkerSystemWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MarkerSystemWidget_C>();
	}
};
static_assert(alignof(UWBP_MarkerSystemWidget_C) == 0x000008, "Wrong alignment on UWBP_MarkerSystemWidget_C");
static_assert(sizeof(UWBP_MarkerSystemWidget_C) == 0x0002B8, "Wrong size on UWBP_MarkerSystemWidget_C");
static_assert(offsetof(UWBP_MarkerSystemWidget_C, Image_0) == 0x000280, "Member 'UWBP_MarkerSystemWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_MarkerSystemWidget_C, TextBlock_0) == 0x000288, "Member 'UWBP_MarkerSystemWidget_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UWBP_MarkerSystemWidget_C, TextBlock_1) == 0x000290, "Member 'UWBP_MarkerSystemWidget_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_MarkerSystemWidget_C, SecondaryName) == 0x000298, "Member 'UWBP_MarkerSystemWidget_C::SecondaryName' has a wrong offset!");
static_assert(offsetof(UWBP_MarkerSystemWidget_C, MainName) == 0x0002A8, "Member 'UWBP_MarkerSystemWidget_C::MainName' has a wrong offset!");

}

