#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftIngredient

#include "Basic.hpp"

#include "EDismantleType_structs.hpp"
#include "S_NeedItems_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.ExecuteUbergraph_WBP_CraftIngredient
// 0x0008 (0x0008 - 0x0000)
struct WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient) == 0x000004, "Wrong alignment on WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient");
static_assert(sizeof(WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient) == 0x000008, "Wrong size on WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient");
static_assert(offsetof(WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient, EntryPoint) == 0x000000, "Member 'WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CraftIngredient_C_ExecuteUbergraph_WBP_CraftIngredient::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.GetResourceType
// 0x0001 (0x0001 - 0x0000)
struct WBP_CraftIngredient_C_GetResourceType final
{
public:
	EDismantleType                                Param_ResourceType;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftIngredient_C_GetResourceType) == 0x000001, "Wrong alignment on WBP_CraftIngredient_C_GetResourceType");
static_assert(sizeof(WBP_CraftIngredient_C_GetResourceType) == 0x000001, "Wrong size on WBP_CraftIngredient_C_GetResourceType");
static_assert(offsetof(WBP_CraftIngredient_C_GetResourceType, Param_ResourceType) == 0x000000, "Member 'WBP_CraftIngredient_C_GetResourceType::Param_ResourceType' has a wrong offset!");

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.Init
// 0x0130 (0x0130 - 0x0000)
struct WBP_CraftIngredient_C_Init final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NeedItems                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0040(0x00D0)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
};
static_assert(alignof(WBP_CraftIngredient_C_Init) == 0x000010, "Wrong alignment on WBP_CraftIngredient_C_Init");
static_assert(sizeof(WBP_CraftIngredient_C_Init) == 0x000130, "Wrong size on WBP_CraftIngredient_C_Init");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000000, "Member 'WBP_CraftIngredient_C_Init::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'WBP_CraftIngredient_C_Init::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'WBP_CraftIngredient_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000038, "Member 'WBP_CraftIngredient_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000040, "Member 'WBP_CraftIngredient_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Init, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'WBP_CraftIngredient_C_Init::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CraftIngredient_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftIngredient_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CraftIngredient_C_PreConstruct");
static_assert(sizeof(WBP_CraftIngredient_C_PreConstruct) == 0x000001, "Wrong size on WBP_CraftIngredient_C_PreConstruct");
static_assert(offsetof(WBP_CraftIngredient_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CraftIngredient_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.Set Resources Required
// 0x0120 (0x0120 - 0x0000)
struct WBP_CraftIngredient_C_Set_Resources_Required final
{
public:
	int32                                         ResourceAvailable;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceRequired;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00D0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x00F8(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CraftIngredient_C_Set_Resources_Required) == 0x000008, "Wrong alignment on WBP_CraftIngredient_C_Set_Resources_Required");
static_assert(sizeof(WBP_CraftIngredient_C_Set_Resources_Required) == 0x000120, "Wrong size on WBP_CraftIngredient_C_Set_Resources_Required");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, ResourceAvailable) == 0x000000, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::ResourceAvailable' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, ResourceRequired) == 0x000004, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::ResourceRequired' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable) == 0x000008, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_SelectFloat_ReturnValue) == 0x0000A8, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_SelectFloat_ReturnValue_1) == 0x0000B0, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B8, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000D0, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable_1) == 0x0000E8, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_bool_Variable) == 0x0000E9, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable_2) == 0x0000EA, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable_3) == 0x0000EB, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_Select_Default) == 0x0000EC, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_bool_Variable_1) == 0x0000ED, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000EE, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_Select_Default_1) == 0x0000EF, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_bool_Variable_2) == 0x0000F0, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F1, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable_4) == 0x0000F2, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_Select_Default_2) == 0x0000F8, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_byte_Variable_5) == 0x000110, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, Temp_bool_Variable_3) == 0x000111, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, K2Node_Select_Default_3) == 0x000112, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000114, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_Set_Resources_Required, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x000118, "Member 'WBP_CraftIngredient_C_Set_Resources_Required::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_CraftIngredient.WBP_CraftIngredient_C.SetResources
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CraftIngredient_C_SetResources final
{
public:
	int32                                         Resources;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x00B8(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00D0(0x0014)()
};
static_assert(alignof(WBP_CraftIngredient_C_SetResources) == 0x000008, "Wrong alignment on WBP_CraftIngredient_C_SetResources");
static_assert(sizeof(WBP_CraftIngredient_C_SetResources) == 0x0000E8, "Wrong size on WBP_CraftIngredient_C_SetResources");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, Resources) == 0x000000, "Member 'WBP_CraftIngredient_C_SetResources::Resources' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, Temp_byte_Variable) == 0x000004, "Member 'WBP_CraftIngredient_C_SetResources::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'WBP_CraftIngredient_C_SetResources::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_CraftIngredient_C_SetResources::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_CraftIngredient_C_SetResources::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_CraftIngredient_C_SetResources::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, Temp_bool_Variable) == 0x000078, "Member 'WBP_CraftIngredient_C_SetResources::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_CraftIngredient_C_SetResources::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, Temp_byte_Variable_1) == 0x000090, "Member 'WBP_CraftIngredient_C_SetResources::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_CraftIngredient_C_SetResources::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, Temp_bool_Variable_1) == 0x0000B0, "Member 'WBP_CraftIngredient_C_SetResources::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B1, "Member 'WBP_CraftIngredient_C_SetResources::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, K2Node_Select_Default) == 0x0000B2, "Member 'WBP_CraftIngredient_C_SetResources::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, K2Node_Select_Default_1) == 0x0000B8, "Member 'WBP_CraftIngredient_C_SetResources::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CraftIngredient_C_SetResources, K2Node_MakeStruct_SlateColor) == 0x0000D0, "Member 'WBP_CraftIngredient_C_SetResources::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

