#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerTotalStats

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PlayerTotalStats.WBP_PlayerTotalStats_C.ExecuteUbergraph_WBP_PlayerTotalStats
// 0x0060 (0x0060 - 0x0000)
struct WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats) == 0x000008, "Wrong alignment on WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats");
static_assert(sizeof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats) == 0x000060, "Wrong size on WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, EntryPoint) == 0x000000, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000018, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000030, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000038, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_GetStatsComponent_PlayerStats) == 0x000050, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'WBP_PlayerTotalStats_C_ExecuteUbergraph_WBP_PlayerTotalStats::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_PlayerTotalStats.WBP_PlayerTotalStats_C.UpdateStats
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_PlayerTotalStats_C_UpdateStats final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_3;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_4;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetStat_Value_5;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_6;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetStat_Value_7;                          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerTotalStats_C_UpdateStats) == 0x000008, "Wrong alignment on WBP_PlayerTotalStats_C_UpdateStats");
static_assert(sizeof(WBP_PlayerTotalStats_C_UpdateStats) == 0x0000D8, "Wrong size on WBP_PlayerTotalStats_C_UpdateStats");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000001, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000002, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000010, "Member 'WBP_PlayerTotalStats_C_UpdateStats::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PlayerTotalStats_C_UpdateStats::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000021, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000028, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000030, "Member 'WBP_PlayerTotalStats_C_UpdateStats::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_PlayerTotalStats_C_UpdateStats::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStatsComponent_PlayerStats) == 0x000048, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000050, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000051, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value) == 0x000058, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000060, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_1) == 0x000068, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_2) == 0x000070, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_3) == 0x000078, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_4) == 0x000088, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_5) == 0x0000A0, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_6) == 0x0000A8, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x0000B0, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0000B8, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_GetStat_Value_7) == 0x0000C0, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_GetStat_Value_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerTotalStats_C_UpdateStats, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000D0, "Member 'WBP_PlayerTotalStats_C_UpdateStats::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");

}

