#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemInteractionInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.CustomNavigation_DecraseRight
// 0x0018 (0x0018 - 0x0000)
struct WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight");
static_assert(sizeof(WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight) == 0x000018, "Wrong size on WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight");
static_assert(offsetof(WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight, Param_Navigation) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight, ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight, CallFunc_GetIsEnabled_ReturnValue) == 0x000010, "Member 'WBP_ItemInteractionInfo_C_CustomNavigation_DecraseRight::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.ExecuteUbergraph_WBP_ItemInteractionInfo
// 0x0090 (0x0090 - 0x0000)
struct WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Opaque;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithAnim;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_CraftIngredient_C*>         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_1;      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_2;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo");
static_assert(sizeof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo) == 0x000090, "Wrong size on WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, EntryPoint) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_byte_Variable) == 0x000004, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_CustomEvent_Opaque) == 0x000005, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_CustomEvent_Opaque' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_CustomEvent_WithAnim) == 0x000006, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_CustomEvent_WithAnim' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_byte_Variable_1) == 0x000010, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_bool_Variable) == 0x000011, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_byte_Variable_2) == 0x000012, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_Select_Default) == 0x000013, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_Event_IsDesignTime) == 0x000015, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_SelectFloat_ReturnValue_1) == 0x000018, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_int_Variable) == 0x000020, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Max_ReturnValue) == 0x000040, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, Temp_bool_Variable_1) == 0x000045, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_Select_Default_1) == 0x000046, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000048, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000050, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_PlayEvent2D_ReturnValue) == 0x000060, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000068, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000080, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_IsAnyAnimationPlaying_ReturnValue_1) == 0x000082, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_IsAnyAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x000083, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_IsAnyAnimationPlaying_ReturnValue_2) == 0x000084, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_IsAnyAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_Not_PreBool_ReturnValue_2) == 0x000085, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000088, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x00008C, "Member 'WBP_ItemInteractionInfo_C_ExecuteUbergraph_WBP_ItemInteractionInfo::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.GetCraftedItemCategory
// 0x0288 (0x0288 - 0x0000)
struct WBP_ItemInteractionInfo_C_GetCraftedItemCategory final
{
public:
	class FName                                   ItemName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CategoryName;                                      // 0x0008(0x0018)(Parm, OutParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ItemTypeToText_Text;                      // 0x0270(0x0018)()
};
static_assert(alignof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_GetCraftedItemCategory");
static_assert(sizeof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory) == 0x000288, "Wrong size on WBP_ItemInteractionInfo_C_GetCraftedItemCategory");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, ItemName) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::ItemName' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CategoryName) == 0x000008, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CategoryName' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000248, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CallFunc_GetHUD_ReturnValue) == 0x000250, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000258, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetCraftedItemCategory, CallFunc_ItemTypeToText_Text) == 0x000270, "Member 'WBP_ItemInteractionInfo_C_GetCraftedItemCategory::CallFunc_ItemTypeToText_Text' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.GetIngredients
// 0x0010 (0x0010 - 0x0000)
struct WBP_ItemInteractionInfo_C_GetIngredients final
{
public:
	TArray<class UWBP_CraftIngredient_C*>         Param_CraftingIngredients;                         // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_GetIngredients) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_GetIngredients");
static_assert(sizeof(WBP_ItemInteractionInfo_C_GetIngredients) == 0x000010, "Wrong size on WBP_ItemInteractionInfo_C_GetIngredients");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetIngredients, Param_CraftingIngredients) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_GetIngredients::Param_CraftingIngredients' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.GetItemCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_ItemInteractionInfo_C_GetItemCount final
{
public:
	int32                                         Param_Count;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_GetItemCount) == 0x000004, "Wrong alignment on WBP_ItemInteractionInfo_C_GetItemCount");
static_assert(sizeof(WBP_ItemInteractionInfo_C_GetItemCount) == 0x000004, "Wrong size on WBP_ItemInteractionInfo_C_GetItemCount");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetItemCount, Param_Count) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_GetItemCount::Param_Count' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.GetOpaque
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionInfo_C_GetOpaque final
{
public:
	bool                                          Param_bOpaque;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_GetOpaque) == 0x000001, "Wrong alignment on WBP_ItemInteractionInfo_C_GetOpaque");
static_assert(sizeof(WBP_ItemInteractionInfo_C_GetOpaque) == 0x000001, "Wrong size on WBP_ItemInteractionInfo_C_GetOpaque");
static_assert(offsetof(WBP_ItemInteractionInfo_C_GetOpaque, Param_bOpaque) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_GetOpaque::Param_bOpaque' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.IsProcessing
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionInfo_C_IsProcessing final
{
public:
	bool                                          Param_bProcessing;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_IsProcessing) == 0x000001, "Wrong alignment on WBP_ItemInteractionInfo_C_IsProcessing");
static_assert(sizeof(WBP_ItemInteractionInfo_C_IsProcessing) == 0x000001, "Wrong size on WBP_ItemInteractionInfo_C_IsProcessing");
static_assert(offsetof(WBP_ItemInteractionInfo_C_IsProcessing, Param_bProcessing) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_IsProcessing::Param_bProcessing' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.OnCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature final
{
public:
	int32                                         Param_Count;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature");
static_assert(sizeof(WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature");
static_assert(offsetof(WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature, Param_Count) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_OnCountChanged__DelegateSignature::Param_Count' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemInteractionInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemInteractionInfo_C_PreConstruct");
static_assert(sizeof(WBP_ItemInteractionInfo_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemInteractionInfo_C_PreConstruct");
static_assert(offsetof(WBP_ItemInteractionInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.SetItemCount
// 0x0028 (0x0028 - 0x0000)
struct WBP_ItemInteractionInfo_C_SetItemCount final
{
public:
	int32                                         Param_Count;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_SetItemCount) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_SetItemCount");
static_assert(sizeof(WBP_ItemInteractionInfo_C_SetItemCount) == 0x000028, "Wrong size on WBP_ItemInteractionInfo_C_SetItemCount");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemCount, Param_Count) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_SetItemCount::Param_Count' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_ItemInteractionInfo_C_SetItemCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ItemInteractionInfo_C_SetItemCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.SetItemInfo
// 0x0180 (0x0180 - 0x0000)
struct WBP_ItemInteractionInfo_C_SetItemInfo final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UPaperSprite>            Icon;                                              // 0x0038(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Canstack;                                          // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCraftedItemCategory_CategoryName;      // 0x0088(0x0018)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x00A0(0x00D0)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_SetItemInfo) == 0x000010, "Wrong alignment on WBP_ItemInteractionInfo_C_SetItemInfo");
static_assert(sizeof(WBP_ItemInteractionInfo_C_SetItemInfo) == 0x000180, "Wrong size on WBP_ItemInteractionInfo_C_SetItemInfo");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Param_Name) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, DisplayName) == 0x000008, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Description) == 0x000020, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Description' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Icon) == 0x000038, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Icon' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Canstack) == 0x000068, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Canstack' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Temp_byte_Variable) == 0x000069, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, K2Node_DynamicCast_AsPaper_Sprite) == 0x000078, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, CallFunc_GetCraftedItemCategory_CategoryName) == 0x000088, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::CallFunc_GetCraftedItemCategory_CategoryName' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x0000A0, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Temp_byte_Variable_1) == 0x000170, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, Temp_bool_Variable) == 0x000171, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetItemInfo, K2Node_Select_Default) == 0x000172, "Member 'WBP_ItemInteractionInfo_C_SetItemInfo::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.SetMoneyDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemInteractionInfo_C_SetMoneyDisplay final
{
public:
	bool                                          UseMoney;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_SetMoneyDisplay) == 0x000004, "Wrong alignment on WBP_ItemInteractionInfo_C_SetMoneyDisplay");
static_assert(sizeof(WBP_ItemInteractionInfo_C_SetMoneyDisplay) == 0x000008, "Wrong size on WBP_ItemInteractionInfo_C_SetMoneyDisplay");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetMoneyDisplay, UseMoney) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_SetMoneyDisplay::UseMoney' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetMoneyDisplay, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_ItemInteractionInfo_C_SetMoneyDisplay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.SetOpaque
// 0x0002 (0x0002 - 0x0000)
struct WBP_ItemInteractionInfo_C_SetOpaque final
{
public:
	bool                                          Opaque;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithAnim;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_SetOpaque) == 0x000001, "Wrong alignment on WBP_ItemInteractionInfo_C_SetOpaque");
static_assert(sizeof(WBP_ItemInteractionInfo_C_SetOpaque) == 0x000002, "Wrong size on WBP_ItemInteractionInfo_C_SetOpaque");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetOpaque, Opaque) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_SetOpaque::Opaque' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetOpaque, WithAnim) == 0x000001, "Member 'WBP_ItemInteractionInfo_C_SetOpaque::WithAnim' has a wrong offset!");

// Function WBP_ItemInteractionInfo.WBP_ItemInteractionInfo_C.SetText
// 0x0060 (0x0060 - 0x0000)
struct WBP_ItemInteractionInfo_C_SetText final
{
public:
	class FText                                   Param_Action;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_Processing;                                  // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_Error_NoFreeSpace;                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_ResourceLabel;                               // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ItemInteractionInfo_C_SetText) == 0x000008, "Wrong alignment on WBP_ItemInteractionInfo_C_SetText");
static_assert(sizeof(WBP_ItemInteractionInfo_C_SetText) == 0x000060, "Wrong size on WBP_ItemInteractionInfo_C_SetText");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetText, Param_Action) == 0x000000, "Member 'WBP_ItemInteractionInfo_C_SetText::Param_Action' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetText, Param_Processing) == 0x000018, "Member 'WBP_ItemInteractionInfo_C_SetText::Param_Processing' has a wrong offset!");
static_assert(offsetof(WBP_ItemInteractionInfo_C_SetText, Param_Error_NoFreeSpace) == 0x000030, "Member 'WBP_ItemInteractionInfo_C_SetText::Param_Error_NoFreeSpace' has a wrong offset!");
