#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Stat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Stat.WBP_Stat_C
// 0x0098 (0x0318 - 0x0280)
class UWBP_Stat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bleed_Icon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_StatValue;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_PB;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value_1;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value_2;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        CurrentValue;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCriticalState;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           IconSprite;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              ProgressBarSize;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       IconPadding;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                In_Padding;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	class UPaperSprite*                           FillImage;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Stat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetIconPadding();
	void SetIsCritical(bool IsCritical);
	void SetProgressBarSize(const struct FVector2D& Size);
	void SetStyleBar(struct FProgressBarStyle* ProgressBarStyle);
	void SetValue(double Param_CurrentValue, bool IsCritical);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Stat_C">();
	}
	static class UWBP_Stat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Stat_C>();
	}
};
static_assert(alignof(UWBP_Stat_C) == 0x000008, "Wrong alignment on UWBP_Stat_C");
static_assert(sizeof(UWBP_Stat_C) == 0x000318, "Wrong size on UWBP_Stat_C");
static_assert(offsetof(UWBP_Stat_C, UberGraphFrame) == 0x000280, "Member 'UWBP_Stat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Bleed_Icon) == 0x000288, "Member 'UWBP_Stat_C::Bleed_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Image_Icon) == 0x000290, "Member 'UWBP_Stat_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Image_Separator) == 0x000298, "Member 'UWBP_Stat_C::Image_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, ProgressBar_StatValue) == 0x0002A0, "Member 'UWBP_Stat_C::ProgressBar_StatValue' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, SizeBox_PB) == 0x0002A8, "Member 'UWBP_Stat_C::SizeBox_PB' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Text_Value) == 0x0002B0, "Member 'UWBP_Stat_C::Text_Value' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Text_Value_1) == 0x0002B8, "Member 'UWBP_Stat_C::Text_Value_1' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, Text_Value_2) == 0x0002C0, "Member 'UWBP_Stat_C::Text_Value_2' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, WidgetSwitcher_0) == 0x0002C8, "Member 'UWBP_Stat_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, CurrentValue) == 0x0002D0, "Member 'UWBP_Stat_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, IsCriticalState) == 0x0002D8, "Member 'UWBP_Stat_C::IsCriticalState' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, IconSprite) == 0x0002E0, "Member 'UWBP_Stat_C::IconSprite' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, ProgressBarSize) == 0x0002E8, "Member 'UWBP_Stat_C::ProgressBarSize' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, IconPadding) == 0x0002F8, "Member 'UWBP_Stat_C::IconPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, In_Padding) == 0x000300, "Member 'UWBP_Stat_C::In_Padding' has a wrong offset!");
static_assert(offsetof(UWBP_Stat_C, FillImage) == 0x000310, "Member 'UWBP_Stat_C::FillImage' has a wrong offset!");

}

