#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RepairWeapon

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon
// 0x0020 (0x0020 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Repair_Weapon_Tier_5_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Repair_Weapon_Tier_4_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Repair_Weapon_Tier_3_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Repair_Weapon_Tier_2_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Calculate_Repair_Weapon_Tier_1_ReturnValue; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon) == 0x000004, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon) == 0x000020, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_Calculate_Repair_Weapon_Tier_5_ReturnValue) == 0x000004, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_Calculate_Repair_Weapon_Tier_5_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_Calculate_Repair_Weapon_Tier_4_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_Calculate_Repair_Weapon_Tier_4_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_Calculate_Repair_Weapon_Tier_3_ReturnValue) == 0x00000C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_Calculate_Repair_Weapon_Tier_3_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_Calculate_Repair_Weapon_Tier_2_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_Calculate_Repair_Weapon_Tier_2_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_Calculate_Repair_Weapon_Tier_1_ReturnValue) == 0x000014, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_Calculate_Repair_Weapon_Tier_1_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00001A, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00001B, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00001C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon Tier 1
// 0x0038 (0x0038 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1) == 0x000008, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1) == 0x000038, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002D, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00002E, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002F, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_Less_IntInt_ReturnValue_1) == 0x000031, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1, CallFunc_BooleanAND_ReturnValue_1) == 0x000032, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_1::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon Tier 2
// 0x0070 (0x0070 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2) == 0x000008, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2) == 0x000070, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_FCeil_ReturnValue) == 0x000048, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_FCeil_ReturnValue_1) == 0x000064, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2, CallFunc_Multiply_IntInt_ReturnValue) == 0x000068, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_2::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon Tier 3
// 0x0068 (0x0068 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3) == 0x000008, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3) == 0x000068, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_FCeil_ReturnValue) == 0x000048, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00004C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_FCeil_ReturnValue_1) == 0x000060, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3, CallFunc_Multiply_IntInt_ReturnValue) == 0x000064, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_3::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon Tier 4
// 0x0078 (0x0078 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4) == 0x000008, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4) == 0x000078, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_FCeil_ReturnValue) == 0x000048, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_FCeil_ReturnValue_1) == 0x000068, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00006C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_4::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.Calculate Repair Weapon Tier 5
// 0x0078 (0x0078 - 0x0000)
struct WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5 final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5) == 0x000008, "Wrong alignment on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5");
static_assert(sizeof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5) == 0x000078, "Wrong size on WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, ReturnValue) == 0x000000, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Round_ReturnValue) == 0x000028, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_FCeil_ReturnValue) == 0x000048, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_FCeil_ReturnValue_1) == 0x000068, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00006C, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_RepairWeapon_C_Calculate_Repair_Weapon_Tier_5::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_RepairWeapon.WBP_RepairWeapon_C.ExecuteUbergraph_WBP_RepairWeapon
// 0x0768 (0x0768 - 0x0000)
struct WBP_RepairWeapon_C_ExecuteUbergraph_WBP_RepairWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CounterResource;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateResourceBeforeRepairPlayers_UniqueServerID; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateResourceBeforeRepairPlayers_ReturnValue; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_UpdateResourceBeforeRepairPlayers_StructOut; // 0x0080(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x02A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x02B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_1;                         // 0x02C8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems_1;       // 0x0330(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData_1;       // 0x0340(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut;                // 0x0350(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_2;                         // 0x03B8(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FContainerPickupsInfo                  K2Node_SetFieldsInStruct_StructOut_1;              // 0x0420(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x048E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x048F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemBySlotIndex_Found;                 // 0x0496(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_497[0x1];                                      // 0x0497(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJSI_Slot_C*                            CallFunc_GetItemBySlotIndex_Item;                  // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A3[0x1];                                      // 0x04A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_Repair_Data_ReturnValue;           // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Cant;                           // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x04D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED[0x3];                                      // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Update_Repair_Data_ReturnValue_1;         // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_CustomEvent_WeaponInfo;                     // 0x04F8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(const struct FFItemInfo& WeaponInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0718(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x072B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Cant)>                    K2Node_CreateDelegate_OutputDelegate_3;            // 0x072C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
