#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LeaveCurrentArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.AddEntry
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_LeaveCurrentArea_C_AddEntry final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              PlayerState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0018)()
	class ASurvivalPlayer_V2_C*                   CallFunc_GetCharRef_OutputCharRef;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStashWidgetOpen_IsStashOpen;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LeaveCurrentAreaEntry_C*           CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithEditor_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_AddEntry) == 0x000008, "Wrong alignment on WBP_LeaveCurrentArea_C_AddEntry");
static_assert(sizeof(WBP_LeaveCurrentArea_C_AddEntry) == 0x0000C0, "Wrong size on WBP_LeaveCurrentArea_C_AddEntry");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, PlayerIndex) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_AddEntry::PlayerIndex' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, PlayerState) == 0x000008, "Member 'WBP_LeaveCurrentArea_C_AddEntry::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, Temp_bool_Variable) == 0x000010, "Member 'WBP_LeaveCurrentArea_C_AddEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_GetCharRef_OutputCharRef) == 0x000058, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_GetCharRef_OutputCharRef' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000068, "Member 'WBP_LeaveCurrentArea_C_AddEntry::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_LeaveCurrentArea_C_AddEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_IsStashWidgetOpen_IsStashOpen) == 0x000079, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_IsStashWidgetOpen_IsStashOpen' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue) == 0x00007A, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue_1) == 0x00007B, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_Create_ReturnValue) == 0x000080, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue_2) == 0x000088, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue_3) == 0x000089, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue_4) == 0x00008A, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_BooleanOR_ReturnValue_5) == 0x00008B, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_IsWithEditor_ReturnValue) == 0x00008C, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_IsWithEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, K2Node_Select_Default) == 0x000098, "Member 'WBP_LeaveCurrentArea_C_AddEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_AddEntry, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'WBP_LeaveCurrentArea_C_AddEntry::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.BusyCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentArea_C_BusyCheck final
{
public:
	bool                                          Param_Busy_;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_BusyCheck) == 0x000001, "Wrong alignment on WBP_LeaveCurrentArea_C_BusyCheck");
static_assert(sizeof(WBP_LeaveCurrentArea_C_BusyCheck) == 0x000001, "Wrong size on WBP_LeaveCurrentArea_C_BusyCheck");
static_assert(offsetof(WBP_LeaveCurrentArea_C_BusyCheck, Param_Busy_) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_BusyCheck::Param_Busy_' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.ExecuteUbergraph_WBP_LeaveCurrentArea
// 0x0050 (0x0050 - 0x0000)
struct WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0018(0x0010)(ReferenceParm)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x0028(0x0010)(ReferenceParm)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Busy_;                          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea) == 0x000008, "Wrong alignment on WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea");
static_assert(sizeof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea) == 0x000050, "Wrong size on WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, EntryPoint) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_byte_Variable) == 0x000004, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_bool_Variable) == 0x000005, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, CallFunc_GetInputSettings_ReturnValue) == 0x000010, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, CallFunc_GetActionMappingByName_OutMappings) == 0x000018, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, CallFunc_GetActionMappingByName_OutMappings_1) == 0x000028, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::CallFunc_GetActionMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_byte_Variable_3) == 0x000038, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, K2Node_CustomEvent_Show) == 0x000039, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, Temp_bool_Variable_1) == 0x00003A, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00003B, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, K2Node_CustomEvent_Busy_) == 0x00003C, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::K2Node_CustomEvent_Busy_' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, K2Node_Select_Default) == 0x00003D, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_LeaveCurrentArea_C_ExecuteUbergraph_WBP_LeaveCurrentArea::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.GetShowed
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentArea_C_GetShowed final
{
public:
	bool                                          Param_Showed;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_GetShowed) == 0x000001, "Wrong alignment on WBP_LeaveCurrentArea_C_GetShowed");
static_assert(sizeof(WBP_LeaveCurrentArea_C_GetShowed) == 0x000001, "Wrong size on WBP_LeaveCurrentArea_C_GetShowed");
static_assert(offsetof(WBP_LeaveCurrentArea_C_GetShowed, Param_Showed) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_GetShowed::Param_Showed' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentArea_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LeaveCurrentArea_C_PreConstruct");
static_assert(sizeof(WBP_LeaveCurrentArea_C_PreConstruct) == 0x000001, "Wrong size on WBP_LeaveCurrentArea_C_PreConstruct");
static_assert(offsetof(WBP_LeaveCurrentArea_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.SetTextTeleportLocation
// 0x0138 (0x0138 - 0x0000)
struct WBP_LeaveCurrentArea_C_SetTextTeleportLocation final
{
public:
	bool                                          IsHouse_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   House;                                             // 0x0008(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
};
static_assert(alignof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation) == 0x000008, "Wrong alignment on WBP_LeaveCurrentArea_C_SetTextTeleportLocation");
static_assert(sizeof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation) == 0x000138, "Wrong size on WBP_LeaveCurrentArea_C_SetTextTeleportLocation");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, IsHouse_) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::IsHouse_' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, House) == 0x000008, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::House' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, Temp_bool_Variable) == 0x000020, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, Temp_text_Variable) == 0x000028, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, CallFunc_Format_ReturnValue) == 0x000108, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LeaveCurrentArea_C_SetTextTeleportLocation, K2Node_Select_Default) == 0x000120, "Member 'WBP_LeaveCurrentArea_C_SetTextTeleportLocation::K2Node_Select_Default' has a wrong offset!");

// Function WBP_LeaveCurrentArea.WBP_LeaveCurrentArea_C.ShowCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_LeaveCurrentArea_C_ShowCheck final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LeaveCurrentArea_C_ShowCheck) == 0x000001, "Wrong alignment on WBP_LeaveCurrentArea_C_ShowCheck");
static_assert(sizeof(WBP_LeaveCurrentArea_C_ShowCheck) == 0x000001, "Wrong size on WBP_LeaveCurrentArea_C_ShowCheck");
static_assert(offsetof(WBP_LeaveCurrentArea_C_ShowCheck, Param_Show) == 0x000000, "Member 'WBP_LeaveCurrentArea_C_ShowCheck::Param_Show' has a wrong offset!");

}

