#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftIngredient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EDismantleType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CraftIngredient.WBP_CraftIngredient_C
// 0x0058 (0x02D8 - 0x0280)
class UWBP_CraftIngredient_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_IngredientIcon;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NotEnough;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage_check;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusImage_empty;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Ingredient;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ResorceCounter;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalCounter;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         IngredientIndex;                                   // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CraftItemName;                                     // 0x02CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDismantleType                                ResourceType;                                      // 0x02D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CraftIngredient(int32 EntryPoint);
	void GetResourceType(EDismantleType* Param_ResourceType);
	void Init();
	void PreConstruct(bool IsDesignTime);
	void Set_Resources_Required(int32 ResourceAvailable, int32 ResourceRequired);
	void SetResources(int32 Resources);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CraftIngredient_C">();
	}
	static class UWBP_CraftIngredient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CraftIngredient_C>();
	}
};
static_assert(alignof(UWBP_CraftIngredient_C) == 0x000008, "Wrong alignment on UWBP_CraftIngredient_C");
static_assert(sizeof(UWBP_CraftIngredient_C) == 0x0002D8, "Wrong size on UWBP_CraftIngredient_C");
static_assert(offsetof(UWBP_CraftIngredient_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CraftIngredient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Image_IngredientIcon) == 0x000288, "Member 'UWBP_CraftIngredient_C::Image_IngredientIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Image_NotEnough) == 0x000290, "Member 'UWBP_CraftIngredient_C::Image_NotEnough' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Image_Separator) == 0x000298, "Member 'UWBP_CraftIngredient_C::Image_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, StatusImage_check) == 0x0002A0, "Member 'UWBP_CraftIngredient_C::StatusImage_check' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, StatusImage_empty) == 0x0002A8, "Member 'UWBP_CraftIngredient_C::StatusImage_empty' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Text_Ingredient) == 0x0002B0, "Member 'UWBP_CraftIngredient_C::Text_Ingredient' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Text_ResorceCounter) == 0x0002B8, "Member 'UWBP_CraftIngredient_C::Text_ResorceCounter' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, Text_TotalCounter) == 0x0002C0, "Member 'UWBP_CraftIngredient_C::Text_TotalCounter' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, IngredientIndex) == 0x0002C8, "Member 'UWBP_CraftIngredient_C::IngredientIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, CraftItemName) == 0x0002CC, "Member 'UWBP_CraftIngredient_C::CraftItemName' has a wrong offset!");
static_assert(offsetof(UWBP_CraftIngredient_C, ResourceType) == 0x0002D4, "Member 'UWBP_CraftIngredient_C::ResourceType' has a wrong offset!");

}

