#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FurnitureBuyItemHint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FurnitureBuyItemHint.WBP_FurnitureBuyItemHint_C.ExecuteUbergraph_WBP_FurnitureBuyItemHint
// 0x0030 (0x0030 - 0x0000)
struct WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint) == 0x000008, "Wrong alignment on WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint");
static_assert(sizeof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint) == 0x000030, "Wrong size on WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint, EntryPoint) == 0x000000, "Member 'WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000008, "Member 'WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000010, "Member 'WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_FurnitureBuyItemHint_C_ExecuteUbergraph_WBP_FurnitureBuyItemHint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_FurnitureBuyItemHint.WBP_FurnitureBuyItemHint_C.SetInfo
// 0x0088 (0x0088 - 0x0000)
struct WBP_FurnitureBuyItemHint_C_SetInfo final
{
public:
	double                                        Price;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bEnoughMoney;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color_EnoughMoney;                                 // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_NotEnoughMoney;                              // 0x0034(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0048(0x0018)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0014)()
};
static_assert(alignof(WBP_FurnitureBuyItemHint_C_SetInfo) == 0x000008, "Wrong alignment on WBP_FurnitureBuyItemHint_C_SetInfo");
static_assert(sizeof(WBP_FurnitureBuyItemHint_C_SetInfo) == 0x000088, "Wrong size on WBP_FurnitureBuyItemHint_C_SetInfo");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, Price) == 0x000000, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::Price' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, Param_Name) == 0x000008, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, bEnoughMoney) == 0x000020, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::bEnoughMoney' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, Color_EnoughMoney) == 0x000024, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::Color_EnoughMoney' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, Color_NotEnoughMoney) == 0x000034, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::Color_NotEnoughMoney' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000048, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, CallFunc_SelectColor_ReturnValue) == 0x000060, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_SetInfo, K2Node_MakeStruct_SlateColor) == 0x000070, "Member 'WBP_FurnitureBuyItemHint_C_SetInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_FurnitureBuyItemHint.WBP_FurnitureBuyItemHint_C.Show
// 0x0002 (0x0002 - 0x0000)
struct WBP_FurnitureBuyItemHint_C_Show final
{
public:
	bool                                          Param_Show;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FurnitureBuyItemHint_C_Show) == 0x000001, "Wrong alignment on WBP_FurnitureBuyItemHint_C_Show");
static_assert(sizeof(WBP_FurnitureBuyItemHint_C_Show) == 0x000002, "Wrong size on WBP_FurnitureBuyItemHint_C_Show");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_Show, Param_Show) == 0x000000, "Member 'WBP_FurnitureBuyItemHint_C_Show::Param_Show' has a wrong offset!");
static_assert(offsetof(WBP_FurnitureBuyItemHint_C_Show, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_FurnitureBuyItemHint_C_Show::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

