#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainCategorySelectorEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainCategorySelectorEntry.WBP_MainCategorySelectorEntry_C
// 0x0080 (0x0300 - 0x0280)
class UWBP_MainCategorySelectorEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewHover;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_0;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect_0;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EntryText;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	int32                                         Index_WBP_MainCategorySelectorEntry_C;             // 0x02E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bSelected;                                         // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnEntrySelected;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bDisabled;                                         // 0x02F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_MainCategorySelectorEntry_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_MainCategorySelectorEntry(int32 EntryPoint);
	void GetText(class FText* Param_Text);
	void OnEntrySelected__DelegateSignature(int32 Param_Index);
	void PreConstruct(bool IsDesignTime);
	void SelectEntry(bool Param_Select);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainCategorySelectorEntry_C">();
	}
	static class UWBP_MainCategorySelectorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainCategorySelectorEntry_C>();
	}
};
static_assert(alignof(UWBP_MainCategorySelectorEntry_C) == 0x000008, "Wrong alignment on UWBP_MainCategorySelectorEntry_C");
static_assert(sizeof(UWBP_MainCategorySelectorEntry_C) == 0x000300, "Wrong size on UWBP_MainCategorySelectorEntry_C");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, UberGraphFrame) == 0x000280, "Member 'UWBP_MainCategorySelectorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, NewHover) == 0x000288, "Member 'UWBP_MainCategorySelectorEntry_C::NewHover' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Hover_0) == 0x000290, "Member 'UWBP_MainCategorySelectorEntry_C::Hover_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Deselect_0) == 0x000298, "Member 'UWBP_MainCategorySelectorEntry_C::Deselect_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Deselect) == 0x0002A0, "Member 'UWBP_MainCategorySelectorEntry_C::Deselect' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Select) == 0x0002A8, "Member 'UWBP_MainCategorySelectorEntry_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Hover) == 0x0002B0, "Member 'UWBP_MainCategorySelectorEntry_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Button) == 0x0002B8, "Member 'UWBP_MainCategorySelectorEntry_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, EntryText) == 0x0002C0, "Member 'UWBP_MainCategorySelectorEntry_C::EntryText' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Text) == 0x0002C8, "Member 'UWBP_MainCategorySelectorEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, Index_WBP_MainCategorySelectorEntry_C) == 0x0002E0, "Member 'UWBP_MainCategorySelectorEntry_C::Index_WBP_MainCategorySelectorEntry_C' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, bSelected) == 0x0002E4, "Member 'UWBP_MainCategorySelectorEntry_C::bSelected' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, OnEntrySelected) == 0x0002E8, "Member 'UWBP_MainCategorySelectorEntry_C::OnEntrySelected' has a wrong offset!");
static_assert(offsetof(UWBP_MainCategorySelectorEntry_C, bDisabled) == 0x0002F8, "Member 'UWBP_MainCategorySelectorEntry_C::bDisabled' has a wrong offset!");

}

