#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapLegend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapLegend.WBP_MapLegend_C
// 0x0038 (0x02B8 - 0x0280)
class UWBP_MapLegend_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_102;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_90;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             Texture;                                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MapLegend(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapLegend_C">();
	}
	static class UWBP_MapLegend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapLegend_C>();
	}
};
static_assert(alignof(UWBP_MapLegend_C) == 0x000008, "Wrong alignment on UWBP_MapLegend_C");
static_assert(sizeof(UWBP_MapLegend_C) == 0x0002B8, "Wrong size on UWBP_MapLegend_C");
static_assert(offsetof(UWBP_MapLegend_C, UberGraphFrame) == 0x000280, "Member 'UWBP_MapLegend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, Image_102) == 0x000288, "Member 'UWBP_MapLegend_C::Image_102' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, TextBlock_90) == 0x000290, "Member 'UWBP_MapLegend_C::TextBlock_90' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, Text) == 0x000298, "Member 'UWBP_MapLegend_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_MapLegend_C, Texture) == 0x0002B0, "Member 'UWBP_MapLegend_C::Texture' has a wrong offset!");

}

