#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LineTracePointer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_LineTracePointer.WBP_LineTracePointer_C.OnPaint
// 0x0110 (0x0110 - 0x0000)
struct WBP_LineTracePointer_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0040(0x0040)(NoDestructor)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue_1;                  // 0x0080(0x0040)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast_1;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast_1;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LineTracePointer_C_OnPaint) == 0x000008, "Wrong alignment on WBP_LineTracePointer_C_OnPaint");
static_assert(sizeof(WBP_LineTracePointer_C_OnPaint) == 0x000110, "Wrong size on WBP_LineTracePointer_C_OnPaint");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, Context) == 0x000000, "Member 'WBP_LineTracePointer_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_GetLayout_ReturnValue) == 0x000040, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_GetLayout_ReturnValue_1) == 0x000080, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_GetLayout_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_ReturnValue) == 0x0000C0, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000D0, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_LineTracePointer_C_OnPaint::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0000F0, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x0000F8, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_X_ImplicitCast_1) == 0x000100, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_X_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_LineTracePointer_C_OnPaint, CallFunc_MakeVector2D_Y_ImplicitCast_1) == 0x000108, "Member 'WBP_LineTracePointer_C_OnPaint::CallFunc_MakeVector2D_Y_ImplicitCast_1' has a wrong offset!");

}

