#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScrollboxSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScrollboxSlider.WBP_ScrollboxSlider_C
// 0x0020 (0x02A0 - 0x0280)
class UWBP_ScrollboxSlider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                Slider_Loot;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MousewheelOffset;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__WBP_ScrollboxSlider_Slider_Loot_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();
	void ChangeStyleOnDrag(bool bDrag);
	void CREATEDELEGATE_PROXYFUNCTION_0(float CurrentOffset);
	void ExecuteUbergraph_WBP_ScrollboxSlider(int32 EntryPoint);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SetSliderValue(double Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScrollboxSlider_C">();
	}
	static class UWBP_ScrollboxSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScrollboxSlider_C>();
	}
};
static_assert(alignof(UWBP_ScrollboxSlider_C) == 0x000008, "Wrong alignment on UWBP_ScrollboxSlider_C");
static_assert(sizeof(UWBP_ScrollboxSlider_C) == 0x0002A0, "Wrong size on UWBP_ScrollboxSlider_C");
static_assert(offsetof(UWBP_ScrollboxSlider_C, UberGraphFrame) == 0x000280, "Member 'UWBP_ScrollboxSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScrollboxSlider_C, Slider_Loot) == 0x000288, "Member 'UWBP_ScrollboxSlider_C::Slider_Loot' has a wrong offset!");
static_assert(offsetof(UWBP_ScrollboxSlider_C, ScrollBox) == 0x000290, "Member 'UWBP_ScrollboxSlider_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_ScrollboxSlider_C, MousewheelOffset) == 0x000298, "Member 'UWBP_ScrollboxSlider_C::MousewheelOffset' has a wrong offset!");

}

