#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Journal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Journal.WBP_Journal_C
// 0x0030 (0x02B0 - 0x0280)
class UWBP_Journal_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQuestListViewModel*                    QuestListViewModel;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, DuplicateTransient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               DetailsWrapperBox;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuestLog_C*                        W_QuestLog;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuestDetails_C*                    W_QuestDetails;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Journal(int32 EntryPoint);
	void Finished_E925BAC74D7A95DC59C3E7892986133A();
	void OnQuestDetailsViewModelChanged(class UObject* Object, const struct FFieldNotificationId& Field);
	void PreConstruct(bool IsDesignTime);
	void TrackCurrentQuest();

	void GetQuestListViewModel(class UQuestListViewModel** ViewModel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Journal_C">();
	}
	static class UWBP_Journal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Journal_C>();
	}
};
static_assert(alignof(UWBP_Journal_C) == 0x000008, "Wrong alignment on UWBP_Journal_C");
static_assert(sizeof(UWBP_Journal_C) == 0x0002B0, "Wrong size on UWBP_Journal_C");
static_assert(offsetof(UWBP_Journal_C, UberGraphFrame) == 0x000280, "Member 'UWBP_Journal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Journal_C, QuestListViewModel) == 0x000288, "Member 'UWBP_Journal_C::QuestListViewModel' has a wrong offset!");
static_assert(offsetof(UWBP_Journal_C, DetailsWrapperBox) == 0x000290, "Member 'UWBP_Journal_C::DetailsWrapperBox' has a wrong offset!");
static_assert(offsetof(UWBP_Journal_C, UMG_LabelText) == 0x000298, "Member 'UWBP_Journal_C::UMG_LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_Journal_C, W_QuestLog) == 0x0002A0, "Member 'UWBP_Journal_C::W_QuestLog' has a wrong offset!");
static_assert(offsetof(UWBP_Journal_C, W_QuestDetails) == 0x0002A8, "Member 'UWBP_Journal_C::W_QuestDetails' has a wrong offset!");

}

