#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatWindow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ChatType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ChatWindow.WBP_ChatWindow_C.BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_ChatWindow_C_BndEvt__ChatEntry_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted(ChatEntry)__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETextCommit                                   Commit_method;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature");
static_assert(sizeof(WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature) == 0x000020, "Wrong size on WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature");
static_assert(offsetof(WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature, Text) == 0x000000, "Member 'WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature, Commit_method) == 0x000018, "Member 'WBP_ChatWindow_C_BndEvt__WBP_ChatWindow_W_ChatEntry_K2Node_ComponentBoundEvent_4_OnTextCommitted_ChatEntry___DelegateSignature::Commit_method' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.CloseChat
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChatWindow_C_CloseChat final
{
public:
	bool                                          ShowMessages;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_CloseChat) == 0x000001, "Wrong alignment on WBP_ChatWindow_C_CloseChat");
static_assert(sizeof(WBP_ChatWindow_C_CloseChat) == 0x000001, "Wrong size on WBP_ChatWindow_C_CloseChat");
static_assert(offsetof(WBP_ChatWindow_C_CloseChat, ShowMessages) == 0x000000, "Member 'WBP_ChatWindow_C_CloseChat::ShowMessages' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.ExecuteUbergraph_WBP_ChatWindow
// 0x0200 (0x0200 - 0x0000)
struct WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0058(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable;                                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShowMessages;                   // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_ChatLog_C*                           CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Show_1;                         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Sender;                         // 0x00E8(0x0018)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0100(0x0018)()
	EChatType                                     K2Node_CustomEvent_ChatType;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
	bool                                          K2Node_CustomEvent_Show;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x014C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0160(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_Commit_method;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ParseText_Output_Get;                     // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow");
static_assert(sizeof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow) == 0x000200, "Wrong size on WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, EntryPoint) == 0x000000, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_text_Variable) == 0x000008, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_text_Variable_1) == 0x000020, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_text_Variable_2) == 0x000040, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_ComponentBoundEvent_Text_1) == 0x000058, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_ComponentBoundEvent_CommitMethod) == 0x000070, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_AsSurv_PC) == 0x000080, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetPlayerController_ReturnValue_1) == 0x000090, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000098, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x0000B0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0000B8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000BD, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Not_PreBool_ReturnValue) == 0x0000BE, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_SelectInt_ReturnValue) == 0x0000C0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_byte_Variable) == 0x0000C4, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_ShowMessages) == 0x0000C5, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_ShowMessages' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_Show_1) == 0x0000E0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_Show_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_Sender) == 0x0000E8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_Text) == 0x000100, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_ChatType) == 0x000118, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_ChatType' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000119, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_Select_Default) == 0x000120, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_CustomEvent_Show) == 0x000138, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_CustomEvent_Show' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000139, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_bool_Variable) == 0x00013A, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_AddChild_ReturnValue) == 0x000140, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_byte_Variable_1) == 0x000148, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_MakeStruct_Margin) == 0x00014C, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_ComponentBoundEvent_Text) == 0x000160, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_ComponentBoundEvent_Commit_method) == 0x000178, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_ComponentBoundEvent_Commit_method' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000179, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00017A, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00017B, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_ParseText_Output_Get) == 0x000180, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_ParseText_Output_Get' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_IsEmpty_ReturnValue) == 0x0001A8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001A9, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_PlayAnimation_ReturnValue) == 0x0001B0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001B8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001C0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001C8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_AsSurv_PC_1) == 0x0001D0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_DynamicCast_bSuccess_2) == 0x0001D8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_GetRenderOpacity_ReturnValue) == 0x0001DC, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, Temp_byte_Variable_2) == 0x0001E1, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, K2Node_Select_Default_1) == 0x0001E2, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001E8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_PlayAnimation_ReturnValue_4) == 0x0001F0, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0001F8, "Member 'WBP_ChatWindow_C_ExecuteUbergraph_WBP_ChatWindow::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.FadeLogSlot1
// 0x0018 (0x0018 - 0x0000)
struct WBP_ChatWindow_C_FadeLogSlot1 final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChatLog_C*                           K2Node_DynamicCast_AsW_Chat_Log;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_FadeLogSlot1) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_FadeLogSlot1");
static_assert(sizeof(WBP_ChatWindow_C_FadeLogSlot1) == 0x000018, "Wrong size on WBP_ChatWindow_C_FadeLogSlot1");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot1, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_FadeLogSlot1::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot1, K2Node_DynamicCast_AsW_Chat_Log) == 0x000008, "Member 'WBP_ChatWindow_C_FadeLogSlot1::K2Node_DynamicCast_AsW_Chat_Log' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot1, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ChatWindow_C_FadeLogSlot1::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.FadeLogSlot2
// 0x0018 (0x0018 - 0x0000)
struct WBP_ChatWindow_C_FadeLogSlot2 final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChatLog_C*                           K2Node_DynamicCast_AsW_Chat_Log;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_FadeLogSlot2) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_FadeLogSlot2");
static_assert(sizeof(WBP_ChatWindow_C_FadeLogSlot2) == 0x000018, "Wrong size on WBP_ChatWindow_C_FadeLogSlot2");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot2, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_FadeLogSlot2::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot2, K2Node_DynamicCast_AsW_Chat_Log) == 0x000008, "Member 'WBP_ChatWindow_C_FadeLogSlot2::K2Node_DynamicCast_AsW_Chat_Log' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot2, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ChatWindow_C_FadeLogSlot2::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.FadeLogSlot3
// 0x0018 (0x0018 - 0x0000)
struct WBP_ChatWindow_C_FadeLogSlot3 final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChatLog_C*                           K2Node_DynamicCast_AsW_Chat_Log;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_FadeLogSlot3) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_FadeLogSlot3");
static_assert(sizeof(WBP_ChatWindow_C_FadeLogSlot3) == 0x000018, "Wrong size on WBP_ChatWindow_C_FadeLogSlot3");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot3, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_FadeLogSlot3::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot3, K2Node_DynamicCast_AsW_Chat_Log) == 0x000008, "Member 'WBP_ChatWindow_C_FadeLogSlot3::K2Node_DynamicCast_AsW_Chat_Log' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot3, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ChatWindow_C_FadeLogSlot3::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.FadeLogSlot4
// 0x0018 (0x0018 - 0x0000)
struct WBP_ChatWindow_C_FadeLogSlot4 final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ChatLog_C*                           K2Node_DynamicCast_AsW_Chat_Log;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_FadeLogSlot4) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_FadeLogSlot4");
static_assert(sizeof(WBP_ChatWindow_C_FadeLogSlot4) == 0x000018, "Wrong size on WBP_ChatWindow_C_FadeLogSlot4");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot4, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_FadeLogSlot4::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot4, K2Node_DynamicCast_AsW_Chat_Log) == 0x000008, "Member 'WBP_ChatWindow_C_FadeLogSlot4::K2Node_DynamicCast_AsW_Chat_Log' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_FadeLogSlot4, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ChatWindow_C_FadeLogSlot4::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.MaxLogChecking
// 0x0030 (0x0030 - 0x0000)
struct WBP_ChatWindow_C_MaxLogChecking final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_ChatLog_C*                           K2Node_DynamicCast_AsW_Chat_Log;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_MaxLogChecking) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_MaxLogChecking");
static_assert(sizeof(WBP_ChatWindow_C_MaxLogChecking) == 0x000030, "Wrong size on WBP_ChatWindow_C_MaxLogChecking");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_MaxLogChecking::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_ChatWindow_C_MaxLogChecking::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, K2Node_DynamicCast_AsW_Chat_Log) == 0x000018, "Member 'WBP_ChatWindow_C_MaxLogChecking::K2Node_DynamicCast_AsW_Chat_Log' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ChatWindow_C_MaxLogChecking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_ChatWindow_C_MaxLogChecking::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_MaxLogChecking, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_ChatWindow_C_MaxLogChecking::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.ParseText
// 0x0118 (0x0118 - 0x0000)
struct WBP_ChatWindow_C_ParseText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Output_Get;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         NewLocalVar;                                       // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FString                                 Text;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_ParseIntoArray_ReturnValue;               // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TrimTrailing_ReturnValue;                 // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_ParseText) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_ParseText");
static_assert(sizeof(WBP_ChatWindow_C_ParseText) == 0x000118, "Wrong size on WBP_ChatWindow_C_ParseText");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, InText) == 0x000000, "Member 'WBP_ChatWindow_C_ParseText::InText' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Output_Get) == 0x000018, "Member 'WBP_ChatWindow_C_ParseText::Output_Get' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, NewLocalVar) == 0x000028, "Member 'WBP_ChatWindow_C_ParseText::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Text) == 0x000038, "Member 'WBP_ChatWindow_C_ParseText::Text' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_ChatWindow_C_ParseText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_ParseIntoArray_ReturnValue) == 0x000060, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_ParseIntoArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'WBP_ChatWindow_C_ParseText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Temp_int_Array_Index_Variable_1) == 0x000080, "Member 'WBP_ChatWindow_C_ParseText::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Trim_ReturnValue) == 0x000098, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Trim_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Replace_ReturnValue) == 0x0000A8, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_TrimTrailing_ReturnValue) == 0x0000B8, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_TrimTrailing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C8, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, Temp_int_Loop_Counter_Variable_1) == 0x0000D8, "Member 'WBP_ChatWindow_C_ParseText::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Less_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Add_IntInt_ReturnValue_1) == 0x00010C, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_ParseText, CallFunc_Array_Add_ReturnValue) == 0x000110, "Member 'WBP_ChatWindow_C_ParseText::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChatWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ChatWindow_C_PreConstruct");
static_assert(sizeof(WBP_ChatWindow_C_PreConstruct) == 0x000001, "Wrong size on WBP_ChatWindow_C_PreConstruct");
static_assert(offsetof(WBP_ChatWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ChatWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.SetChatType
// 0x0040 (0x0040 - 0x0000)
struct WBP_ChatWindow_C_SetChatType final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     ChatTypeLocal;                                     // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC_1;                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatType                                     K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_SetChatType) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_SetChatType");
static_assert(sizeof(WBP_ChatWindow_C_SetChatType) == 0x000040, "Wrong size on WBP_ChatWindow_C_SetChatType");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, Count) == 0x000000, "Member 'WBP_ChatWindow_C_SetChatType::Count' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, ChatTypeLocal) == 0x000004, "Member 'WBP_ChatWindow_C_SetChatType::ChatTypeLocal' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, Temp_byte_Variable) == 0x000005, "Member 'WBP_ChatWindow_C_SetChatType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_ChatWindow_C_SetChatType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_ChatWindow_C_SetChatType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_ChatWindow_C_SetChatType::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_ChatWindow_C_SetChatType::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_DynamicCast_AsSurv_PC) == 0x000018, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_DynamicCast_AsSurv_PC' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'WBP_ChatWindow_C_SetChatType::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_DynamicCast_AsSurv_PC_1) == 0x000030, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_DynamicCast_AsSurv_PC_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_Select_Default) == 0x000039, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ChatWindow_C_SetChatType, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'WBP_ChatWindow_C_SetChatType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.ShowChat
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChatWindow_C_ShowChat final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_ShowChat) == 0x000001, "Wrong alignment on WBP_ChatWindow_C_ShowChat");
static_assert(sizeof(WBP_ChatWindow_C_ShowChat) == 0x000001, "Wrong size on WBP_ChatWindow_C_ShowChat");
static_assert(offsetof(WBP_ChatWindow_C_ShowChat, Show) == 0x000000, "Member 'WBP_ChatWindow_C_ShowChat::Show' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.ShowInput
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChatWindow_C_ShowInput final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_ShowInput) == 0x000001, "Wrong alignment on WBP_ChatWindow_C_ShowInput");
static_assert(sizeof(WBP_ChatWindow_C_ShowInput) == 0x000001, "Wrong size on WBP_ChatWindow_C_ShowInput");
static_assert(offsetof(WBP_ChatWindow_C_ShowInput, Show) == 0x000000, "Member 'WBP_ChatWindow_C_ShowInput::Show' has a wrong offset!");

// Function WBP_ChatWindow.WBP_ChatWindow_C.StartTimer
// 0x0028 (0x0028 - 0x0000)
struct WBP_ChatWindow_C_StartTimer final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatWindow_C_StartTimer) == 0x000008, "Wrong alignment on WBP_ChatWindow_C_StartTimer");
static_assert(sizeof(WBP_ChatWindow_C_StartTimer) == 0x000028, "Wrong size on WBP_ChatWindow_C_StartTimer");
static_assert(offsetof(WBP_ChatWindow_C_StartTimer, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_ChatWindow_C_StartTimer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
