#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InviteHome

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InviteHome.WBP_InviteHome_C
// 0x0110 (0x0390 - 0x0280)
class UWBP_InviteHome_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BG;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BGMask;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_List;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_Button_Invite;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     W_HintButtonNew;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCloseWInviteHome;                                // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class APS_TDB_C*                              PS;                                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_WBP_InviteHome_C;                            // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APS_TDB_C*                              PS_Ref_Teleport;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class APS_TDB_C*, class UW_InviteHomeList_C*> InviteListArray;                                   // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           Timer;                                             // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Teleport_PS_Ref;                                   // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UW_InviteHomeList_C*>            ListSelected;                                      // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           StatusTimer;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_InviteHomeList_C*                    Selected;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_InviteHomeList_C*>            Entries;                                           // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UW_InviteHomeList_C*                    Invite_List_Hovered_Ref;                           // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_InviteHomeList_C*                    FirstEntries;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonCount;                                       // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_InviteHome_W_HintButtonNew_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature();
	void CheckingSquadStatus();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_InviteHome(int32 EntryPoint);
	void Init();
	void InitAdd(class APS_TDB_C* Param_PS, const class FString& Param_Name);
	void InitStatus(class UW_InviteHomeList_C* Ref_List);
	void InviteListHovered(class UW_InviteHomeList_C* Ref);
	void InviteListUnhovered(class UW_InviteHomeList_C* Ref);
	void On_Arraw_Down();
	void On_Set_Entries();
	void OnArrawUp();
	void OnClose();
	void OnCloseWInviteHome__DelegateSignature();
	void OnInviteAccept(class APS_TDB_C* NewParam);
	void OnTeleportToRoom();
	void PreConstruct(bool IsDesignTime);
	void SetButtonEnabled();
	void Teleport_PS_Ref__DelegateSignature(const class FString& Param_Name);
	void TeleportToRoom(class APS_TDB_C* PS_Ref);
	void UpdateListAdd();
	void UpdateListCheckStatus();
	void UpdateListRemove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InviteHome_C">();
	}
	static class UWBP_InviteHome_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InviteHome_C>();
	}
};
static_assert(alignof(UWBP_InviteHome_C) == 0x000008, "Wrong alignment on UWBP_InviteHome_C");
static_assert(sizeof(UWBP_InviteHome_C) == 0x000390, "Wrong size on UWBP_InviteHome_C");
static_assert(offsetof(UWBP_InviteHome_C, UberGraphFrame) == 0x000280, "Member 'UWBP_InviteHome_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Image_BG) == 0x000288, "Member 'UWBP_InviteHome_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Image_BGMask) == 0x000290, "Member 'UWBP_InviteHome_C::Image_BGMask' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, VerticalBox_List) == 0x000298, "Member 'UWBP_InviteHome_C::VerticalBox_List' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, W_Button_Invite) == 0x0002A0, "Member 'UWBP_InviteHome_C::W_Button_Invite' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, W_HintButtonNew) == 0x0002A8, "Member 'UWBP_InviteHome_C::W_HintButtonNew' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, WidgetSwitcher_0) == 0x0002B0, "Member 'UWBP_InviteHome_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, OnCloseWInviteHome) == 0x0002B8, "Member 'UWBP_InviteHome_C::OnCloseWInviteHome' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, PS) == 0x0002C8, "Member 'UWBP_InviteHome_C::PS' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Index_WBP_InviteHome_C) == 0x0002D0, "Member 'UWBP_InviteHome_C::Index_WBP_InviteHome_C' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, PS_Ref_Teleport) == 0x0002D8, "Member 'UWBP_InviteHome_C::PS_Ref_Teleport' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, InviteListArray) == 0x0002E0, "Member 'UWBP_InviteHome_C::InviteListArray' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Timer) == 0x000330, "Member 'UWBP_InviteHome_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Teleport_PS_Ref) == 0x000338, "Member 'UWBP_InviteHome_C::Teleport_PS_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, ListSelected) == 0x000348, "Member 'UWBP_InviteHome_C::ListSelected' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, StatusTimer) == 0x000358, "Member 'UWBP_InviteHome_C::StatusTimer' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Selected) == 0x000360, "Member 'UWBP_InviteHome_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Entries) == 0x000368, "Member 'UWBP_InviteHome_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, Invite_List_Hovered_Ref) == 0x000378, "Member 'UWBP_InviteHome_C::Invite_List_Hovered_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, FirstEntries) == 0x000380, "Member 'UWBP_InviteHome_C::FirstEntries' has a wrong offset!");
static_assert(offsetof(UWBP_InviteHome_C, ButtonCount) == 0x000388, "Member 'UWBP_InviteHome_C::ButtonCount' has a wrong offset!");

}

