#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AlarmKeyboardDisplayScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AlarmKeyboardDisplayScreen.WBP_AlarmKeyboardDisplayScreen_C
// 0x0098 (0x0318 - 0x0280)
class UWBP_AlarmKeyboardDisplayScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Failed_Anim_4;                                     // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Failed_Anim_3;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Failed_Anim_2;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Failed_Anim_1;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Congrats_Anim;                                     // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_243;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Dot_1;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Dot_2;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Dot_3;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Failed_1;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Failed_2;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Failed_3;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Failed_4;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_First;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Fourth;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Second;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Third;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsAnimPlaying;                                     // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlashingCounterIndex;                              // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear(const class FText& Letter);
	void ExecuteUbergraph_WBP_AlarmKeyboardDisplayScreen(int32 EntryPoint);
	void GetAnimationByIndex(int32 Param_Index, class UWidgetAnimation** Animation);
	void PlayAnimationByIndex(int32 Param_Index);
	void PlayCongratsAnim();
	void PlayFailedAnim(const TArray<int32>& FailedNumbers);
	void SetNumberText(int32 Param_Index, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AlarmKeyboardDisplayScreen_C">();
	}
	static class UWBP_AlarmKeyboardDisplayScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AlarmKeyboardDisplayScreen_C>();
	}
};
static_assert(alignof(UWBP_AlarmKeyboardDisplayScreen_C) == 0x000008, "Wrong alignment on UWBP_AlarmKeyboardDisplayScreen_C");
static_assert(sizeof(UWBP_AlarmKeyboardDisplayScreen_C) == 0x000318, "Wrong size on UWBP_AlarmKeyboardDisplayScreen_C");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, UberGraphFrame) == 0x000280, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Failed_Anim_4) == 0x000288, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Failed_Anim_4' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Failed_Anim_3) == 0x000290, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Failed_Anim_3' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Failed_Anim_2) == 0x000298, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Failed_Anim_2' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Failed_Anim_1) == 0x0002A0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Failed_Anim_1' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Congrats_Anim) == 0x0002A8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Congrats_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Image_243) == 0x0002B0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Image_243' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Dot_1) == 0x0002B8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Dot_2) == 0x0002C0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Dot_2' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Dot_3) == 0x0002C8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Dot_3' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Failed_1) == 0x0002D0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Failed_1' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Failed_2) == 0x0002D8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Failed_2' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Failed_3) == 0x0002E0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Failed_3' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Failed_4) == 0x0002E8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Failed_4' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_First) == 0x0002F0, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_First' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Fourth) == 0x0002F8, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Fourth' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Second) == 0x000300, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Second' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, Text_Third) == 0x000308, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::Text_Third' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, IsAnimPlaying) == 0x000310, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::IsAnimPlaying' has a wrong offset!");
static_assert(offsetof(UWBP_AlarmKeyboardDisplayScreen_C, FlashingCounterIndex) == 0x000314, "Member 'UWBP_AlarmKeyboardDisplayScreen_C::FlashingCounterIndex' has a wrong offset!");

}

