#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharEffects

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Survival_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharEffects.WBP_CharEffects_C.BindToEffectChange
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharEffects_C_BindToEffectChange final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharEffects_C_BindToEffectChange) == 0x000008, "Wrong alignment on WBP_CharEffects_C_BindToEffectChange");
static_assert(sizeof(WBP_CharEffects_C_BindToEffectChange) == 0x000010, "Wrong size on WBP_CharEffects_C_BindToEffectChange");
static_assert(offsetof(WBP_CharEffects_C_BindToEffectChange, OldPawn) == 0x000000, "Member 'WBP_CharEffects_C_BindToEffectChange::OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_BindToEffectChange, NewPawn) == 0x000008, "Member 'WBP_CharEffects_C_BindToEffectChange::NewPawn' has a wrong offset!");

// Function WBP_CharEffects.WBP_CharEffects_C.ExecuteUbergraph_WBP_CharEffects
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_OldPawn;                        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APawn* OldPawn, class APawn* NewPawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool On_, EUNegativeEffectType EffectType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool On_, EUNegativeEffectType EffectType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects) == 0x000008, "Wrong alignment on WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects");
static_assert(sizeof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects) == 0x0000C8, "Wrong size on WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, EntryPoint) == 0x000000, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, Temp_int_Variable) == 0x000010, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, Temp_int_Variable_1) == 0x000014, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Conv_IntToByte_ReturnValue) == 0x000018, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_GetValidValue_ReturnValue) == 0x000020, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000021, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Array_Contains_ReturnValue) == 0x000022, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000023, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_MakeLiteralInt_ReturnValue) == 0x000038, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000040, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000058, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_CustomEvent_OldPawn) == 0x000068, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_CustomEvent_OldPawn' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_CustomEvent_NewPawn) == 0x000070, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_DynamicCast_AsSurvival_Player) == 0x000078, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C0, "Member 'WBP_CharEffects_C_ExecuteUbergraph_WBP_CharEffects::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_CharEffects.WBP_CharEffects_C.Init
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_CharEffects_C_Init final
{
public:
	struct FSlateColor                            NegativeEffectColor;                               // 0x0000(0x0014)(Edit, BlueprintVisible)
	struct FSlateColor                            PerkColor;                                         // 0x0014(0x0014)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0014)()
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0080(0x00D0)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0174(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_5;                // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharEffects_C_Init) == 0x000010, "Wrong alignment on WBP_CharEffects_C_Init");
static_assert(sizeof(WBP_CharEffects_C_Init) == 0x0001A0, "Wrong size on WBP_CharEffects_C_Init");
static_assert(offsetof(WBP_CharEffects_C_Init, NegativeEffectColor) == 0x000000, "Member 'WBP_CharEffects_C_Init::NegativeEffectColor' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, PerkColor) == 0x000014, "Member 'WBP_CharEffects_C_Init::PerkColor' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, Temp_bool_Variable) == 0x000028, "Member 'WBP_CharEffects_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, Temp_byte_Variable) == 0x000029, "Member 'WBP_CharEffects_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, Temp_byte_Variable_1) == 0x00002A, "Member 'WBP_CharEffects_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue) == 0x00002C, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue_1) == 0x00003C, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectInt_ReturnValue) == 0x00004C, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'WBP_CharEffects_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectInt_ReturnValue_1) == 0x000064, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue_2) == 0x000068, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000080, "Member 'WBP_CharEffects_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue_3) == 0x000150, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, K2Node_Select_Default) == 0x000160, "Member 'WBP_CharEffects_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue_4) == 0x000164, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x000174, "Member 'WBP_CharEffects_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Init, CallFunc_SelectColor_ReturnValue_5) == 0x000188, "Member 'WBP_CharEffects_C_Init::CallFunc_SelectColor_ReturnValue_5' has a wrong offset!");

// Function WBP_CharEffects.WBP_CharEffects_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharEffects_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharEffects_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharEffects_C_PreConstruct");
static_assert(sizeof(WBP_CharEffects_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharEffects_C_PreConstruct");
static_assert(offsetof(WBP_CharEffects_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharEffects_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharEffects.WBP_CharEffects_C.Show Effect
// 0x0007 (0x0007 - 0x0000)
struct WBP_CharEffects_C_Show_Effect final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUNegativeEffectType                          Param_EffectType;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharEffects_C_Show_Effect) == 0x000001, "Wrong alignment on WBP_CharEffects_C_Show_Effect");
static_assert(sizeof(WBP_CharEffects_C_Show_Effect) == 0x000007, "Wrong size on WBP_CharEffects_C_Show_Effect");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, On_) == 0x000000, "Member 'WBP_CharEffects_C_Show_Effect::On_' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, Param_EffectType) == 0x000001, "Member 'WBP_CharEffects_C_Show_Effect::Param_EffectType' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, Temp_bool_Variable) == 0x000002, "Member 'WBP_CharEffects_C_Show_Effect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, Temp_byte_Variable) == 0x000003, "Member 'WBP_CharEffects_C_Show_Effect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_CharEffects_C_Show_Effect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_CharEffects_C_Show_Effect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharEffects_C_Show_Effect, K2Node_Select_Default) == 0x000006, "Member 'WBP_CharEffects_C_Show_Effect::K2Node_Select_Default' has a wrong offset!");

}

