#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewQuest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NewQuest.WBP_NewQuest_C
// 0x0080 (0x0300 - 0x0280)
class UWBP_NewQuest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewObjectiveAnimFadeOut;                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowStrikeThrough;                                 // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewObjectiveAnimFadeIn;                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_37;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StrikeThrroughImg;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_47;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_QuestComponent_C*                   QuestComponent;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FText>                           ObjectivePool;                                     // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TickEnabled;                                       // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           CompletedObjectivePool;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UUMGSequencePlayer*>             Timers;                                            // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_NewQuest(int32 EntryPoint);
	void Finished_23E46B4D44AF97CA100D7D98DF2B3A49();
	void Finished_2643D45A42D569712A31ECA1DFCB21B3();
	void Finished_7EE9001644275B942B34E7AAC81FEB32();
	void Finished_98798BA94C3DC449D8FEA4B24ACCE4E5();
	void Finished_F4A1F7F64C8B8E28E3B5E5944ECCF1DD();
	class FText FormatText(const class FText& Text);
	void FreezeUI(bool Freeze);
	void OnObjectiveActivated(class UBP_Objective_C* Objective);
	void OnObjectiveCompleted(class UBP_Objective_C* Objective);
	void OnQuestActivated(class UBP_Objective_C* RootObjectiveCollection);
	void ResetTick();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NewQuest_C">();
	}
	static class UWBP_NewQuest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NewQuest_C>();
	}
};
static_assert(alignof(UWBP_NewQuest_C) == 0x000008, "Wrong alignment on UWBP_NewQuest_C");
static_assert(sizeof(UWBP_NewQuest_C) == 0x000300, "Wrong size on UWBP_NewQuest_C");
static_assert(offsetof(UWBP_NewQuest_C, UberGraphFrame) == 0x000280, "Member 'UWBP_NewQuest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, NewObjectiveAnimFadeOut) == 0x000288, "Member 'UWBP_NewQuest_C::NewObjectiveAnimFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, ShowStrikeThrough) == 0x000290, "Member 'UWBP_NewQuest_C::ShowStrikeThrough' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, NewObjectiveAnimFadeIn) == 0x000298, "Member 'UWBP_NewQuest_C::NewObjectiveAnimFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, Image_37) == 0x0002A0, "Member 'UWBP_NewQuest_C::Image_37' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, StrikeThrroughImg) == 0x0002A8, "Member 'UWBP_NewQuest_C::StrikeThrroughImg' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, TextBlock) == 0x0002B0, "Member 'UWBP_NewQuest_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, TextBlock_47) == 0x0002B8, "Member 'UWBP_NewQuest_C::TextBlock_47' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, QuestComponent) == 0x0002C0, "Member 'UWBP_NewQuest_C::QuestComponent' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, ObjectivePool) == 0x0002C8, "Member 'UWBP_NewQuest_C::ObjectivePool' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, TickEnabled) == 0x0002D8, "Member 'UWBP_NewQuest_C::TickEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, CompletedObjectivePool) == 0x0002E0, "Member 'UWBP_NewQuest_C::CompletedObjectivePool' has a wrong offset!");
static_assert(offsetof(UWBP_NewQuest_C, Timers) == 0x0002F0, "Member 'UWBP_NewQuest_C::Timers' has a wrong offset!");

}

