#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FurnitureShopSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_FurnitureUpgradeHouseInfo_structs.hpp"
#include "E_FurnitureShopSlot_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "F_FurnitureShopItem_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FurnitureShopSlot.WBP_FurnitureShopSlot_C
// 0x0300 (0x0580 - 0x0280)
class UWBP_FurnitureShopSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Default;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Default_1;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DefaultBottom;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_DefaultBottom_1;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Hovered;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_HoveredBottom;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_HoveredBottom_1;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CarImage;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CarImage_1;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName_1;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName_2;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarName_3;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Default;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Default_1;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Hovered;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CarPrice_Hovered_1;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Default;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Default_1;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Empty_1;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hovered_1;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InfoVerticalBox;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InfoVerticalBox_1;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_261;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Hovered;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_SizeBox_hoveredTextBlock_1;               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_SizeBox_unhoveredTextBlock;               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected_1;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_107;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_DefaultPrice;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_DefaultPrice_1;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Hovered;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HoveredPrice;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_HoveredPrice_1;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_unhoveredTextBlock;                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SlotButton;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SlotButton_1;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StorageText;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_77;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Button;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FF_FurnitureShopItem                   InfoSlot;                                          // 0x0400(0x0098)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	E_FurnitureShopSlot                           SlotStatus;                                        // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            PriceColor;                                        // 0x049C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BlackColor;                                        // 0x04B0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RedColor;                                          // 0x04C4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnSelectedSlot;                                    // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsEnoughMoneyForBuy;                              // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_FurnitureUpgradeHouseInfo           HouseInfoSlot;                                     // 0x04F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ASurvPC_C*                              As_Surv_PC;                                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHouse;                                          // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHoveredSlot;                                     // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredSlot;                                   // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_1_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_1_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_FurnitureShopSlot_SlotButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_FurnitureShopSlot(int32 EntryPoint);
	void GetFurnitureSlotInfo(struct FF_FurnitureShopItem* Param_InfoSlot);
	void GetHouseSlotInfo(struct FF_FurnitureUpgradeHouseInfo* Param_InfoSlot);
	void GetSlotStatus(E_FurnitureShopSlot* Param_SlotStatus);
	void OnHoveredSlot__DelegateSignature(class UWBP_FurnitureShopSlot_C* HoveredSlot);
	void OnSelectedSlot__DelegateSignature(class UWBP_FurnitureShopSlot_C* PressedFurnitureSlot);
	void OnUnhoveredSlot__DelegateSignature(class UWBP_FurnitureShopSlot_C* UnhoveredSlot);
	void PreConstruct(bool IsDesignTime);
	void ResetTextForDeutchLocalization();
	void SetHouseSlotInfo(const struct FF_FurnitureUpgradeHouseInfo& Param_InfoSlot);
	void SetSlotDefault();
	void SetSlotEmpty();
	void SetSlotInfo(const struct FF_FurnitureShopItem& Param_InfoSlot);
	void SetSlotSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FurnitureShopSlot_C">();
	}
	static class UWBP_FurnitureShopSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FurnitureShopSlot_C>();
	}
};
static_assert(alignof(UWBP_FurnitureShopSlot_C) == 0x000008, "Wrong alignment on UWBP_FurnitureShopSlot_C");
static_assert(sizeof(UWBP_FurnitureShopSlot_C) == 0x000580, "Wrong size on UWBP_FurnitureShopSlot_C");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, UberGraphFrame) == 0x000280, "Member 'UWBP_FurnitureShopSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_Default) == 0x000288, "Member 'UWBP_FurnitureShopSlot_C::Border_Default' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_Default_1) == 0x000290, "Member 'UWBP_FurnitureShopSlot_C::Border_Default_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_DefaultBottom) == 0x000298, "Member 'UWBP_FurnitureShopSlot_C::Border_DefaultBottom' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_DefaultBottom_1) == 0x0002A0, "Member 'UWBP_FurnitureShopSlot_C::Border_DefaultBottom_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_Hovered) == 0x0002A8, "Member 'UWBP_FurnitureShopSlot_C::Border_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_HoveredBottom) == 0x0002B0, "Member 'UWBP_FurnitureShopSlot_C::Border_HoveredBottom' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Border_HoveredBottom_1) == 0x0002B8, "Member 'UWBP_FurnitureShopSlot_C::Border_HoveredBottom_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarImage) == 0x0002C0, "Member 'UWBP_FurnitureShopSlot_C::CarImage' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarImage_1) == 0x0002C8, "Member 'UWBP_FurnitureShopSlot_C::CarImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarName) == 0x0002D0, "Member 'UWBP_FurnitureShopSlot_C::CarName' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarName_1) == 0x0002D8, "Member 'UWBP_FurnitureShopSlot_C::CarName_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarName_2) == 0x0002E0, "Member 'UWBP_FurnitureShopSlot_C::CarName_2' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarName_3) == 0x0002E8, "Member 'UWBP_FurnitureShopSlot_C::CarName_3' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarPrice_Default) == 0x0002F0, "Member 'UWBP_FurnitureShopSlot_C::CarPrice_Default' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarPrice_Default_1) == 0x0002F8, "Member 'UWBP_FurnitureShopSlot_C::CarPrice_Default_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarPrice_Hovered) == 0x000300, "Member 'UWBP_FurnitureShopSlot_C::CarPrice_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, CarPrice_Hovered_1) == 0x000308, "Member 'UWBP_FurnitureShopSlot_C::CarPrice_Hovered_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Default) == 0x000310, "Member 'UWBP_FurnitureShopSlot_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Default_1) == 0x000318, "Member 'UWBP_FurnitureShopSlot_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Empty) == 0x000320, "Member 'UWBP_FurnitureShopSlot_C::Empty' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Empty_1) == 0x000328, "Member 'UWBP_FurnitureShopSlot_C::Empty_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Image_Hovered) == 0x000330, "Member 'UWBP_FurnitureShopSlot_C::Image_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Image_Hovered_1) == 0x000338, "Member 'UWBP_FurnitureShopSlot_C::Image_Hovered_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, InfoVerticalBox) == 0x000340, "Member 'UWBP_FurnitureShopSlot_C::InfoVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, InfoVerticalBox_1) == 0x000348, "Member 'UWBP_FurnitureShopSlot_C::InfoVerticalBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, ScaleBox_261) == 0x000350, "Member 'UWBP_FurnitureShopSlot_C::ScaleBox_261' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, ScaleBox_Hovered) == 0x000358, "Member 'UWBP_FurnitureShopSlot_C::ScaleBox_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, ScaleBox_SizeBox_hoveredTextBlock_1) == 0x000360, "Member 'UWBP_FurnitureShopSlot_C::ScaleBox_SizeBox_hoveredTextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, ScaleBox_SizeBox_unhoveredTextBlock) == 0x000368, "Member 'UWBP_FurnitureShopSlot_C::ScaleBox_SizeBox_unhoveredTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Selected) == 0x000370, "Member 'UWBP_FurnitureShopSlot_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, Selected_1) == 0x000378, "Member 'UWBP_FurnitureShopSlot_C::Selected_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_107) == 0x000380, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_107' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_DefaultPrice) == 0x000388, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_DefaultPrice' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_DefaultPrice_1) == 0x000390, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_DefaultPrice_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_Hovered) == 0x000398, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_HoveredPrice) == 0x0003A0, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_HoveredPrice' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_HoveredPrice_1) == 0x0003A8, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_HoveredPrice_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SizeBox_unhoveredTextBlock) == 0x0003B0, "Member 'UWBP_FurnitureShopSlot_C::SizeBox_unhoveredTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SlotButton) == 0x0003B8, "Member 'UWBP_FurnitureShopSlot_C::SlotButton' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SlotButton_1) == 0x0003C0, "Member 'UWBP_FurnitureShopSlot_C::SlotButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, StorageText) == 0x0003C8, "Member 'UWBP_FurnitureShopSlot_C::StorageText' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, TextBlock) == 0x0003D0, "Member 'UWBP_FurnitureShopSlot_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, TextBlock_1) == 0x0003D8, "Member 'UWBP_FurnitureShopSlot_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, TextBlock_2) == 0x0003E0, "Member 'UWBP_FurnitureShopSlot_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, TextBlock_3) == 0x0003E8, "Member 'UWBP_FurnitureShopSlot_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, WidgetSwitcher_77) == 0x0003F0, "Member 'UWBP_FurnitureShopSlot_C::WidgetSwitcher_77' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, WidgetSwitcher_Button) == 0x0003F8, "Member 'UWBP_FurnitureShopSlot_C::WidgetSwitcher_Button' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, InfoSlot) == 0x000400, "Member 'UWBP_FurnitureShopSlot_C::InfoSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, SlotStatus) == 0x000498, "Member 'UWBP_FurnitureShopSlot_C::SlotStatus' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, PriceColor) == 0x00049C, "Member 'UWBP_FurnitureShopSlot_C::PriceColor' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, BlackColor) == 0x0004B0, "Member 'UWBP_FurnitureShopSlot_C::BlackColor' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, RedColor) == 0x0004C4, "Member 'UWBP_FurnitureShopSlot_C::RedColor' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, OnSelectedSlot) == 0x0004D8, "Member 'UWBP_FurnitureShopSlot_C::OnSelectedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, bIsEnoughMoneyForBuy) == 0x0004E8, "Member 'UWBP_FurnitureShopSlot_C::bIsEnoughMoneyForBuy' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, HouseInfoSlot) == 0x0004F0, "Member 'UWBP_FurnitureShopSlot_C::HouseInfoSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, As_Surv_PC) == 0x000550, "Member 'UWBP_FurnitureShopSlot_C::As_Surv_PC' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, bIsHouse) == 0x000558, "Member 'UWBP_FurnitureShopSlot_C::bIsHouse' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, OnHoveredSlot) == 0x000560, "Member 'UWBP_FurnitureShopSlot_C::OnHoveredSlot' has a wrong offset!");
static_assert(offsetof(UWBP_FurnitureShopSlot_C, OnUnhoveredSlot) == 0x000570, "Member 'UWBP_FurnitureShopSlot_C::OnUnhoveredSlot' has a wrong offset!");

}

