#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RepairEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_RepairEntry.WBP_RepairEntry_C.ExecuteUbergraph_WBP_RepairEntry
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class II_StatsInterface_C>   K2Node_DynamicCast_AsI_Stats_Interface;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            CallFunc_GetStatsComponent_PlayerStats;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry) == 0x000008, "Wrong alignment on WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry");
static_assert(sizeof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry) == 0x0000A8, "Wrong size on WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, EntryPoint) == 0x000000, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, K2Node_DynamicCast_AsI_Stats_Interface) == 0x000018, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::K2Node_DynamicCast_AsI_Stats_Interface' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_GetStatsComponent_PlayerStats) == 0x000038, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_GetStatsComponent_PlayerStats' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_GetEndTime_ReturnValue) == 0x000058, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000078, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_PlayEvent2D_ReturnValue) == 0x000088, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_BooleanOR_ReturnValue) == 0x000090, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_BooleanOR_ReturnValue_1) == 0x000091, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast) == 0x0000A0, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_PlayAnimationForward_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000A4, "Member 'WBP_RepairEntry_C_ExecuteUbergraph_WBP_RepairEntry::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.GetEnoughMoney
// 0x0001 (0x0001 - 0x0000)
struct WBP_RepairEntry_C_GetEnoughMoney final
{
public:
	bool                                          Param_HaveEnoughMoney;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_GetEnoughMoney) == 0x000001, "Wrong alignment on WBP_RepairEntry_C_GetEnoughMoney");
static_assert(sizeof(WBP_RepairEntry_C_GetEnoughMoney) == 0x000001, "Wrong size on WBP_RepairEntry_C_GetEnoughMoney");
static_assert(offsetof(WBP_RepairEntry_C_GetEnoughMoney, Param_HaveEnoughMoney) == 0x000000, "Member 'WBP_RepairEntry_C_GetEnoughMoney::Param_HaveEnoughMoney' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.GetRepairPrice
// 0x0004 (0x0004 - 0x0000)
struct WBP_RepairEntry_C_GetRepairPrice final
{
public:
	int32                                         Param_RepairPrice;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_GetRepairPrice) == 0x000004, "Wrong alignment on WBP_RepairEntry_C_GetRepairPrice");
static_assert(sizeof(WBP_RepairEntry_C_GetRepairPrice) == 0x000004, "Wrong size on WBP_RepairEntry_C_GetRepairPrice");
static_assert(offsetof(WBP_RepairEntry_C_GetRepairPrice, Param_RepairPrice) == 0x000000, "Member 'WBP_RepairEntry_C_GetRepairPrice::Param_RepairPrice' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.Init
// 0x07C0 (0x07C0 - 0x0000)
struct WBP_RepairEntry_C_Init final
{
public:
	double                                        RepairPricePerDurabilityPoint;                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Weight;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryItemByUID_Result;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInventoryItemByUID_Container;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_GetInventoryItemByUID_Item;               // 0x0050(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x00C0(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x02E0(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0300(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0358(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0370(0x0050)(HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03E0(0x0018)()
	struct FFItemInfo                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x03F8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0658(0x0018)()
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0670(0x00D0)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC_1;                // 0x0748(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer_1;            // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCountByName_ReturnedCount;         // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0788(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x07A0(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_Init) == 0x000010, "Wrong alignment on WBP_RepairEntry_C_Init");
static_assert(sizeof(WBP_RepairEntry_C_Init) == 0x0007C0, "Wrong size on WBP_RepairEntry_C_Init");
static_assert(offsetof(WBP_RepairEntry_C_Init, RepairPricePerDurabilityPoint) == 0x000000, "Member 'WBP_RepairEntry_C_Init::RepairPricePerDurabilityPoint' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, Weight) == 0x000008, "Member 'WBP_RepairEntry_C_Init::Weight' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_RepairEntry_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_RepairEntry_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_RepairEntry_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000028, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000039, "Member 'WBP_RepairEntry_C_Init::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000040, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetInventoryItemByUID_Result) == 0x000048, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetInventoryItemByUID_Result' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetInventoryItemByUID_Container) == 0x000049, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetInventoryItemByUID_Container' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetInventoryItemByUID_Item) == 0x000050, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetInventoryItemByUID_Item' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'WBP_RepairEntry_C_Init::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x0000C0, "Member 'WBP_RepairEntry_C_Init::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0002E0, "Member 'WBP_RepairEntry_C_Init::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'WBP_RepairEntry_C_Init::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_MakeStruct_FormatArgumentData) == 0x000300, "Member 'WBP_RepairEntry_C_Init::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000350, "Member 'WBP_RepairEntry_C_Init::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000358, "Member 'WBP_RepairEntry_C_Init::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_MakeStruct_FormatArgumentData_1) == 0x000370, "Member 'WBP_RepairEntry_C_Init::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Array_Get_Item) == 0x0003C0, "Member 'WBP_RepairEntry_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_MakeArray_Array) == 0x0003D0, "Member 'WBP_RepairEntry_C_Init::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Format_ReturnValue) == 0x0003E0, "Member 'WBP_RepairEntry_C_Init::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003F8, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000618, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Array_Length_ReturnValue) == 0x00061C, "Member 'WBP_RepairEntry_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000620, "Member 'WBP_RepairEntry_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_BreakVector2D_X) == 0x000628, "Member 'WBP_RepairEntry_C_Init::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_BreakVector2D_Y) == 0x000630, "Member 'WBP_RepairEntry_C_Init::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000638, "Member 'WBP_RepairEntry_C_Init::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000640, "Member 'WBP_RepairEntry_C_Init::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_AsPaper_Sprite) == 0x000648, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_bSuccess_1) == 0x000650, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000658, "Member 'WBP_RepairEntry_C_Init::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000670, "Member 'WBP_RepairEntry_C_Init::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetPlayerController_ReturnValue_1) == 0x000740, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_AsBPI_Surv_PC_1) == 0x000748, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_AsBPI_Surv_PC_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, K2Node_DynamicCast_bSuccess_2) == 0x000758, "Member 'WBP_RepairEntry_C_Init::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000760, "Member 'WBP_RepairEntry_C_Init::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetPlayerRef_SurvivalPlayer_1) == 0x000768, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetPlayerRef_SurvivalPlayer_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000770, "Member 'WBP_RepairEntry_C_Init::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_FTrunc_ReturnValue) == 0x000778, "Member 'WBP_RepairEntry_C_Init::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GetItemCountByName_ReturnedCount) == 0x00077C, "Member 'WBP_RepairEntry_C_Init::CallFunc_GetItemCountByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000780, "Member 'WBP_RepairEntry_C_Init::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000788, "Member 'WBP_RepairEntry_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x0007A0, "Member 'WBP_RepairEntry_C_Init::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Init, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0007B8, "Member 'WBP_RepairEntry_C_Init::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.OnMouseButtonDown
// 0x0230 (0x0230 - 0x0000)
struct WBP_RepairEntry_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_RepairEntry_C_OnMouseButtonDown");
static_assert(sizeof(WBP_RepairEntry_C_OnMouseButtonDown) == 0x000230, "Wrong size on WBP_RepairEntry_C_OnMouseButtonDown");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x000168, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x000228, "Member 'WBP_RepairEntry_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RepairEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RepairEntry_C_PreConstruct");
static_assert(sizeof(WBP_RepairEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_RepairEntry_C_PreConstruct");
static_assert(offsetof(WBP_RepairEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RepairEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.Repair
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_RepairEntry_C_Repair final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemByName_ReturnedCount;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJSI_Slot_C*>                    K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJSI_Slot_C*                            CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairEntry_C_Repair) == 0x000008, "Wrong alignment on WBP_RepairEntry_C_Repair");
static_assert(sizeof(WBP_RepairEntry_C_Repair) == 0x0000A8, "Wrong size on WBP_RepairEntry_C_Repair");
static_assert(offsetof(WBP_RepairEntry_C_Repair, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_RepairEntry_C_Repair::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_RepairEntry_C_Repair::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WBP_RepairEntry_C_Repair::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'WBP_RepairEntry_C_Repair::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'WBP_RepairEntry_C_Repair::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000028, "Member 'WBP_RepairEntry_C_Repair::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_RepairEntry_C_Repair::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'WBP_RepairEntry_C_Repair::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_GetPlayerController_ReturnValue_1) == 0x000048, "Member 'WBP_RepairEntry_C_Repair::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000050, "Member 'WBP_RepairEntry_C_Repair::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WBP_RepairEntry_C_Repair::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000068, "Member 'WBP_RepairEntry_C_Repair::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_GetItemByName_ReturnedCount) == 0x000070, "Member 'WBP_RepairEntry_C_Repair::CallFunc_GetItemByName_ReturnedCount' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_RepairEntry_C_Repair::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'WBP_RepairEntry_C_Repair::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000099, "Member 'WBP_RepairEntry_C_Repair::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Repair, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A5, "Member 'WBP_RepairEntry_C_Repair::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_RepairEntry.WBP_RepairEntry_C.Set Enough
// 0x0068 (0x0068 - 0x0000)
struct WBP_RepairEntry_C_Set_Enough final
{
public:
	bool                                          Enough;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             TextElement;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0054(0x0014)()
};
static_assert(alignof(WBP_RepairEntry_C_Set_Enough) == 0x000008, "Wrong alignment on WBP_RepairEntry_C_Set_Enough");
static_assert(sizeof(WBP_RepairEntry_C_Set_Enough) == 0x000068, "Wrong size on WBP_RepairEntry_C_Set_Enough");
static_assert(offsetof(WBP_RepairEntry_C_Set_Enough, Enough) == 0x000000, "Member 'WBP_RepairEntry_C_Set_Enough::Enough' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Set_Enough, TextElement) == 0x000008, "Member 'WBP_RepairEntry_C_Set_Enough::TextElement' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Set_Enough, Icon) == 0x000010, "Member 'WBP_RepairEntry_C_Set_Enough::Icon' has a wrong offset!");
static_assert(offsetof(WBP_RepairEntry_C_Set_Enough, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WBP_RepairEntry_C_Set_Enough::K2Node_MakeStruct_SlateColor' has a wrong offset!");
