#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuestDetails

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "NPC_Structure_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_QuestDetails.WBP_QuestDetails_C.CheckTrackButtonVisibility
// 0x0030 (0x0030 - 0x0000)
struct WBP_QuestDetails_C_CheckTrackButtonVisibility final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class WBP_Objective::UWBP_Objective_C*> CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class WBP_Objective::UWBP_Objective_C*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObjectiveCompleted_bObjectiveCompleted; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C_CheckTrackButtonVisibility) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_CheckTrackButtonVisibility");
static_assert(sizeof(WBP_QuestDetails_C_CheckTrackButtonVisibility) == 0x000030, "Wrong size on WBP_QuestDetails_C_CheckTrackButtonVisibility");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_Map_Values_Values) == 0x000010, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_IsObjectiveCompleted_bObjectiveCompleted) == 0x00002C, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_IsObjectiveCompleted_bObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_CheckTrackButtonVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'WBP_QuestDetails_C_CheckTrackButtonVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.ExecuteUbergraph_WBP_QuestDetails
// 0x0278 (0x0278 - 0x0000)
struct WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   K2Node_CustomEvent_Field;                          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuestObjectiveViewModel*>       CallFunc_GetActiveObjectives_ReturnValue;          // 0x0028(0x0010)(ReferenceParm)
	TArray<class UQuestObjectiveViewModel*>       CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	TArray<class UQuestObjectiveViewModel*>       CallFunc_FilterChangedObjectiveViewModels_OutAdded; // 0x0048(0x0010)(ReferenceParm)
	TArray<class UQuestObjectiveViewModel*>       CallFunc_FilterChangedObjectiveViewModels_OutRemoved; // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class WBP_Objective::UWBP_Objective_C*        CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class WBP_Objective::UWBP_Objective_C*        K2Node_DynamicCast_AsWBP_Objective;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x00C0(0x0010)(ReferenceParm)
	class UQuestObjectiveViewModel*               CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0018)()
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x0100(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestObjectiveViewModel*               CallFunc_Array_Get_Item_4;                         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, int32>                    K2Node_MakeMap_Map;                                // 0x0120(0x0050)()
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class WBP_Objective::UWBP_Objective_C*        CallFunc_Map_Find_Value;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Values_Values_1;                      // 0x0188(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_5;                         // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys_2;                          // 0x01A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_6;                         // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, int32>                    K2Node_MakeMap_Map_1;                              // 0x01C8(0x0050)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class WBP_Objective::UWBP_Objective_C*        CallFunc_Create_ReturnValue_1;                     // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_7;                         // 0x0238(0x0018)()
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_4;                // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails");
static_assert(sizeof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails) == 0x000278, "Wrong size on WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, EntryPoint) == 0x000000, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_CustomEvent_Object) == 0x000008, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_CustomEvent_Field) == 0x000010, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_CustomEvent_Field' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_GetActiveObjectives_ReturnValue) == 0x000028, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_GetActiveObjectives_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Keys_Keys) == 0x000038, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_FilterChangedObjectiveViewModels_OutAdded) == 0x000048, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_FilterChangedObjectiveViewModels_OutAdded' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_FilterChangedObjectiveViewModels_OutRemoved) == 0x000058, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_FilterChangedObjectiveViewModels_OutRemoved' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Create_ReturnValue) == 0x000098, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_DynamicCast_AsWBP_Objective) == 0x0000A0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_DynamicCast_AsWBP_Objective' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Loop_Counter_Variable_2) == 0x0000AC, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000B0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Keys_Keys_1) == 0x0000C0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Values_Values) == 0x000100, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, Temp_int_Array_Index_Variable_2) == 0x000110, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_3) == 0x000114, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_4) == 0x000118, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_MakeMap_Map) == 0x000120, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Remove_ReturnValue) == 0x000170, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Find_Value) == 0x000178, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Find_ReturnValue) == 0x000180, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_SelectInt_ReturnValue) == 0x000184, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Values_Values_1) == 0x000188, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_IsValid_ReturnValue_1) == 0x000198, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_5) == 0x00019C, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Map_Keys_Keys_2) == 0x0001A0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_6) == 0x0001B8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, K2Node_MakeMap_Map_1) == 0x0001C8, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Length_ReturnValue_2) == 0x000218, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Less_IntInt_ReturnValue_2) == 0x00021C, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000220, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Create_ReturnValue_1) == 0x000228, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000230, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_Array_Get_Item_7) == 0x000238, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_PlayEvent2D_ReturnValue) == 0x000250, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000258, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_PlayEvent2D_ReturnValue_2) == 0x000260, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_PlayEvent2D_ReturnValue_3) == 0x000268, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails, CallFunc_PlayEvent2D_ReturnValue_4) == 0x000270, "Member 'WBP_QuestDetails_C_ExecuteUbergraph_WBP_QuestDetails::CallFunc_PlayEvent2D_ReturnValue_4' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.InitQuestData
// 0x0300 (0x0300 - 0x0000)
struct WBP_QuestDetails_C_InitQuestData final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestComponent*                        CallFunc_GetQuestComponents_Quest;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UQuestTrackerComponent*                 CallFunc_GetQuestComponents_QuestTracker;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestContext*>                  CallFunc_GetAllActiveQuestContexts_OutContexts;    // 0x0060(0x0010)(ReferenceParm)
	class UQuestContext*                          CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestContextViewModel*                 CallFunc_GetViewModel_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest*                                 CallFunc_GetQuestAsset_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllStageNodesNames_OutNames;           // 0x0098(0x0010)(ReferenceParm)
	const class UQuestCustomData*                 CallFunc_GetCustomData_ReturnValue;                // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UQuestData_C*                     K2Node_DynamicCast_AsQuest_Data;                   // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestNode_Stage*                       CallFunc_FindStageNodeByName_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetNodeText_ReturnValue;                  // 0x00D0(0x0018)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPC_Structure                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F8(0x0110)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0xF];                                      // 0x0221(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0230(0x00D0)()
};
static_assert(alignof(WBP_QuestDetails_C_InitQuestData) == 0x000010, "Wrong alignment on WBP_QuestDetails_C_InitQuestData");
static_assert(sizeof(WBP_QuestDetails_C_InitQuestData) == 0x000300, "Wrong size on WBP_QuestDetails_C_InitQuestData");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_SelectInt_ReturnValue) == 0x000000, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_byte_Variable) == 0x000008, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_byte_Variable_1) == 0x000015, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_bool_Variable) == 0x000016, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_byte_Variable_2) == 0x000017, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_byte_Variable_3) == 0x000018, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_string_Variable) == 0x000020, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000038, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, Temp_bool_Variable_1) == 0x000049, "Member 'WBP_QuestDetails_C_InitQuestData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetQuestComponents_Quest) == 0x000050, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetQuestComponents_Quest' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetQuestComponents_QuestTracker) == 0x000058, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetQuestComponents_QuestTracker' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetAllActiveQuestContexts_OutContexts) == 0x000060, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetAllActiveQuestContexts_OutContexts' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetViewModel_ReturnValue) == 0x000080, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000089, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetQuestAsset_ReturnValue) == 0x000090, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetQuestAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetAllStageNodesNames_OutNames) == 0x000098, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetAllStageNodesNames_OutNames' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetCustomData_ReturnValue) == 0x0000A8, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetCustomData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_AsQuest_Data) == 0x0000B8, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_AsQuest_Data' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_FindStageNodeByName_ReturnValue) == 0x0000C8, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_FindStageNodeByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetNodeText_ReturnValue) == 0x0000D0, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetNodeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Map_Find_Value) == 0x0000E8, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Map_Find_ReturnValue) == 0x0000EC, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Greater_IntInt_ReturnValue) == 0x0000ED, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_Select_Default) == 0x0000EE, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000EF, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_Select_Default_1) == 0x0000F0, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F8, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000208, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000210, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_AsPaper_Sprite) == 0x000218, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, K2Node_DynamicCast_bSuccess_2) == 0x000220, "Member 'WBP_QuestDetails_C_InitQuestData::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_InitQuestData, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000230, "Member 'WBP_QuestDetails_C_InitQuestData::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.OnActiveObjectivesChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestDetails_C_OnActiveObjectivesChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C_OnActiveObjectivesChanged) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_OnActiveObjectivesChanged");
static_assert(sizeof(WBP_QuestDetails_C_OnActiveObjectivesChanged) == 0x000010, "Wrong size on WBP_QuestDetails_C_OnActiveObjectivesChanged");
static_assert(offsetof(WBP_QuestDetails_C_OnActiveObjectivesChanged, Object) == 0x000000, "Member 'WBP_QuestDetails_C_OnActiveObjectivesChanged::Object' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_OnActiveObjectivesChanged, Field) == 0x000008, "Member 'WBP_QuestDetails_C_OnActiveObjectivesChanged::Field' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.OnTrackedQuestChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFieldNotificationId                   Field;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature");
static_assert(sizeof(WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature");
static_assert(offsetof(WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature, Object) == 0x000000, "Member 'WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature::Object' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature, Field) == 0x000008, "Member 'WBP_QuestDetails_C_OnTrackedQuestChanged__DelegateSignature::Field' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.PlayButtonAnimation
// 0x0018 (0x0018 - 0x0000)
struct WBP_QuestDetails_C_PlayButtonAnimation final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C_PlayButtonAnimation) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_PlayButtonAnimation");
static_assert(sizeof(WBP_QuestDetails_C_PlayButtonAnimation) == 0x000018, "Wrong size on WBP_QuestDetails_C_PlayButtonAnimation");
static_assert(offsetof(WBP_QuestDetails_C_PlayButtonAnimation, Animation) == 0x000000, "Member 'WBP_QuestDetails_C_PlayButtonAnimation::Animation' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_PlayButtonAnimation, PlayMode) == 0x000008, "Member 'WBP_QuestDetails_C_PlayButtonAnimation::PlayMode' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_PlayButtonAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_QuestDetails_C_PlayButtonAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.SetQuestContextViewModel
// 0x0038 (0x0038 - 0x0000)
struct WBP_QuestDetails_C_SetQuestContextViewModel final
{
public:
	class UQuestContextViewModel*                 ViewModel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              CallFunc_GetExtension_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMVVMView*                              K2Node_DynamicCast_AsMVVM_View;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INotifyFieldValueChanged> CallFunc_SetViewModel_ViewModel_CastInput;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SetViewModel_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C_SetQuestContextViewModel) == 0x000008, "Wrong alignment on WBP_QuestDetails_C_SetQuestContextViewModel");
static_assert(sizeof(WBP_QuestDetails_C_SetQuestContextViewModel) == 0x000038, "Wrong size on WBP_QuestDetails_C_SetQuestContextViewModel");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, ViewModel) == 0x000000, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::ViewModel' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, CallFunc_GetExtension_ReturnValue) == 0x000008, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::CallFunc_GetExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, K2Node_DynamicCast_AsMVVM_View) == 0x000010, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::K2Node_DynamicCast_AsMVVM_View' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, CallFunc_SetViewModel_ViewModel_CastInput) == 0x000020, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::CallFunc_SetViewModel_ViewModel_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C_SetQuestContextViewModel, CallFunc_SetViewModel_ReturnValue) == 0x000030, "Member 'WBP_QuestDetails_C_SetQuestContextViewModel::CallFunc_SetViewModel_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.__02b93136-4dcf-75e3-7220-07baf184cdf5_SourceToDest
// 0x0030 (0x0030 - 0x0000)
struct WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_ConvertQuestResultToText_ReturnValue;     // 0x0018(0x0018)()
};
static_assert(alignof(WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest) == 0x000008, "Wrong alignment on WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest");
static_assert(sizeof(WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest) == 0x000030, "Wrong size on WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest");
static_assert(offsetof(WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest, ReturnValue) == 0x000000, "Member 'WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest, CallFunc_ConvertQuestResultToText_ReturnValue) == 0x000018, "Member 'WBP_QuestDetails_C___02b93136Minus4dcfMinus75e3Minus7220Minus07baf184cdf5_SourceToDest::CallFunc_ConvertQuestResultToText_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.__4b972664-4f2c-98f6-0945-fa83d7b5ad42_SourceToDest
// 0x0020 (0x0020 - 0x0000)
struct WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_ConvertQuestResultToColor_ReturnValue;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest) == 0x000004, "Wrong alignment on WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest");
static_assert(sizeof(WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest) == 0x000020, "Wrong size on WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest");
static_assert(offsetof(WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest, ReturnValue) == 0x000000, "Member 'WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest, CallFunc_ConvertQuestResultToColor_ReturnValue) == 0x000010, "Member 'WBP_QuestDetails_C___4b972664Minus4f2cMinus98f6Minus0945Minusfa83d7b5ad42_SourceToDest::CallFunc_ConvertQuestResultToColor_ReturnValue' has a wrong offset!");

// Function WBP_QuestDetails.WBP_QuestDetails_C.__8afc256b-4963-b429-00cb-a1a38e35ddec_SourceToDest
// 0x0010 (0x0010 - 0x0000)
struct WBP_QuestDetails_C___8afc256bMinus4963Minusb429Minus00cbMinusa1a38e35ddec_SourceToDest final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QuestDetails_C___8afc256bMinus4963Minusb429Minus00cbMinusa1a38e35ddec_SourceToDest) == 0x000008, "Wrong alignment on WBP_QuestDetails_C___8afc256bMinus4963Minusb429Minus00cbMinusa1a38e35ddec_SourceToDest");
