#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkbenchRepairTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "InputCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorkbenchRepairTab.WBP_WorkbenchRepairTab_C.BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature final
{
public:
	int32                                         CategoryIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(sizeof(WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature, CategoryIndex) == 0x000000, "Member 'WBP_WorkbenchRepairTab_C_BndEvt__WBP_WorkbenchRepairTab_W_CategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature::CategoryIndex' has a wrong offset!");

// Function WBP_WorkbenchRepairTab.WBP_WorkbenchRepairTab_C.CheckRepairItems
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_WorkbenchRepairTab_C_CheckRepairItems final
{
public:
	bool                                          HasRepairItems;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item;                           // 0x0048(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x00B8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchRepairTab_C_CheckRepairItems) == 0x000008, "Wrong alignment on WBP_WorkbenchRepairTab_C_CheckRepairItems");
static_assert(sizeof(WBP_WorkbenchRepairTab_C_CheckRepairItems) == 0x0002E0, "Wrong size on WBP_WorkbenchRepairTab_C_CheckRepairItems");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, HasRepairItems) == 0x000000, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::HasRepairItems' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, Temp_int_Variable) == 0x000010, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_getItemsInventory_ContainerItems) == 0x000020, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_getItemsInventory_ContainersData) == 0x000030, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x0000B8, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_CheckRepairItems, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'WBP_WorkbenchRepairTab_C_CheckRepairItems::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_WorkbenchRepairTab.WBP_WorkbenchRepairTab_C.ExecuteUbergraph_WBP_WorkbenchRepairTab
// 0x0858 (0x0858 - 0x0000)
struct WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairCategoryNew_C*               CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems;         // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData;         // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             K2Node_CustomEvent_ScrollBox_0;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_CustomEvent_TextBlock_76;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairCategoryNew_C*               CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairWeapon_C*                    CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_CustomEvent_ItemInfo;                       // 0x00F8(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerRag;                      // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerChemical;                 // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerMetal;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NeedsIngredients;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairCategoryNew_C*               CallFunc_Array_Get_Item_2;                         // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairCategoryNew_C*               CallFunc_Array_Get_Item_3;                         // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairCategoryNew_C*               CallFunc_Array_Get_Item_4;                         // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairWeapon_C*                    CallFunc_Array_Get_Item_5;                         // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0378(0x0018)()
	class ASurvivalPlayer_C*                      K2Node_CustomEvent_As_Survival_Player;             // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x03A0(0x0014)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x03E0(0x0018)()
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainerItems_1;       // 0x03F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FContainerPickupsInfo>          CallFunc_getItemsInventory_ContainersData_1;       // 0x0408(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FContainerPickupsInfo                  CallFunc_Array_Get_Item_7;                         // 0x0418(0x0068)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo; // 0x0488(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x06AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AB[0x5];                                      // 0x06AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x06B0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x06C8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x06E0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x06F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           CallFunc_Map_Find_Value;                           // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x072C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0740(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_755[0x3];                                      // 0x0755(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RepairCategoryNew_C*               CallFunc_Array_Get_Item_8;                         // 0x0758(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0760(0x0014)()
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RepairWeapon_C*                    CallFunc_Array_Get_Item_9;                         // 0x0778(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x078C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x079C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x07AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x07C0(0x0010)(ReferenceParm)
	int32                                         K2Node_ComponentBoundEvent_CategoryIndex;          // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x07F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0818(0x0018)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab) == 0x000008, "Wrong alignment on WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab");
static_assert(sizeof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab) == 0x000858, "Wrong size on WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, EntryPoint) == 0x000000, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_bool_True_if_break_was_hit_Variable) == 0x000048, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_2) == 0x00004C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_2) == 0x000054, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_getItemsInventory_ContainerItems) == 0x000058, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_getItemsInventory_ContainerItems' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_getItemsInventory_ContainersData) == 0x000068, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_getItemsInventory_ContainersData' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_2) == 0x000078, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_3) == 0x00007C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_4) == 0x000080, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_3) == 0x000084, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_3) == 0x000088, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_5) == 0x00008C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_4) == 0x000090, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_4) == 0x000094, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_6) == 0x000098, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_ScrollBox_0) == 0x0000A0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_ScrollBox_0' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_TextBlock_76) == 0x0000A8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_TextBlock_76' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Map_Keys_Keys) == 0x0000B0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_5) == 0x0000D4, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_2) == 0x0000E8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000ED, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000F0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_ItemInfo) == 0x0000F8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_PlayerRag) == 0x000318, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_PlayerRag' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_PlayerChemical) == 0x00031C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_PlayerChemical' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_PlayerMetal) == 0x000320, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_PlayerMetal' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_NeedsIngredients) == 0x000324, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_NeedsIngredients' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_PlayAnimation_ReturnValue) == 0x000328, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_2) == 0x000330, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_3) == 0x000338, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_6) == 0x00033C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_2) == 0x000340, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_6) == 0x000344, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_AddUnique_ReturnValue) == 0x000348, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_3) == 0x000350, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_4) == 0x000358, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_3) == 0x00035C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_RemoveItem_ReturnValue) == 0x00035D, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_4) == 0x000360, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_5) == 0x000368, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00036C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_5) == 0x000370, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Conv_IntToText_ReturnValue) == 0x000378, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CustomEvent_As_Survival_Player) == 0x000390, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CustomEvent_As_Survival_Player' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_PlayAnimationForward_ReturnValue) == 0x000398, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_MakeStruct_SlateColor) == 0x0003A0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CreateDelegate_OutputDelegate) == 0x0003B4, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Loop_Counter_Variable_7) == 0x0003C4, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_4) == 0x0003C8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Add_IntInt_ReturnValue_7) == 0x0003CC, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_Event_IsDesignTime) == 0x0003D0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_int_Array_Index_Variable_7) == 0x0003D4, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_6) == 0x0003D8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Conv_NameToText_ReturnValue) == 0x0003E0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_getItemsInventory_ContainerItems_1) == 0x0003F8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_getItemsInventory_ContainerItems_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_getItemsInventory_ContainersData_1) == 0x000408, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_getItemsInventory_ContainersData_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Get_Item_7) == 0x000418, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Array_Length_ReturnValue_6) == 0x000480, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo) == 0x000488, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_ConvertPickupItemToItemInfoFunc_ItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_5) == 0x0006A8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_BooleanAND_ReturnValue) == 0x0006A9, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Less_IntInt_ReturnValue_6) == 0x0006AA, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0006B0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0006C8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0006E0, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x0006F8, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000708, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000710, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_IsValid_ReturnValue_1) == 0x000718, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Map_Find_Value) == 0x000720, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, CallFunc_Map_Find_ReturnValue) == 0x000728, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_MakeStruct_SlateColor_1) == 0x00072C, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, K2Node_MakeStruct_SlateColor_2) == 0x000740, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab, Temp_bool_Variable) == 0x000754, "Member 'WBP_WorkbenchRepairTab_C_ExecuteUbergraph_WBP_WorkbenchRepairTab::Temp_bool_Variable' has a wrong offset!");
