#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AttachmentsSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "E_TypesOfModes_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "E_DependenciesRule_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"


namespace SDK::Params
{

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.AddAttachment
// 0x0318 (0x0318 - 0x0000)
struct WBP_AttachmentsSelector_C_AddAttachment final
{
public:
	struct FAttachmentInfo                        Attachment;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             NewItem;                                           // 0x0010(0x0220)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          AddSpecialItem;                                    // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAttachment_Index;                      // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetAttachment_Attachment;                 // 0x0260(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAttachment_Result;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x2];                                      // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EB[0x1];                                      // 0x02EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item_1;                         // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_AddAttachment) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_AddAttachment");
static_assert(sizeof(WBP_AttachmentsSelector_C_AddAttachment) == 0x000318, "Wrong size on WBP_AttachmentsSelector_C_AddAttachment");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Attachment) == 0x000000, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Attachment' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, NewItem) == 0x000010, "Member 'WBP_AttachmentsSelector_C_AddAttachment::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, AddSpecialItem) == 0x000230, "Member 'WBP_AttachmentsSelector_C_AddAttachment::AddSpecialItem' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Temp_int_Array_Index_Variable) == 0x000234, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Temp_int_Loop_Counter_Variable) == 0x000238, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Temp_int_Loop_Counter_Variable_1) == 0x00023C, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Add_IntInt_ReturnValue) == 0x000240, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Add_IntInt_ReturnValue_1) == 0x000244, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Get_Item) == 0x000248, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_GetAttachment_Index) == 0x000258, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_GetAttachment_Index' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_GetAttachment_Attachment) == 0x000260, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_GetAttachment_Attachment' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_IsValidAttachment_Result) == 0x0002E0, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_IsValidAttachment_Result' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0002E1, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Length_ReturnValue) == 0x0002E4, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Temp_bool_True_if_break_was_hit_Variable) == 0x0002E8, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Less_IntInt_ReturnValue) == 0x0002E9, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Not_PreBool_ReturnValue) == 0x0002EA, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, Temp_int_Array_Index_Variable_1) == 0x0002EC, "Member 'WBP_AttachmentsSelector_C_AddAttachment::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Get_Item_1) == 0x0002F0, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Add_ReturnValue) == 0x000300, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000304, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Length_ReturnValue_1) == 0x000308, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Less_IntInt_ReturnValue_1) == 0x00030C, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_Array_Add_ReturnValue_1) == 0x000310, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddAttachment, CallFunc_BooleanAND_ReturnValue) == 0x000314, "Member 'WBP_AttachmentsSelector_C_AddAttachment::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.AddCellToGrid
// 0x04F0 (0x04F0 - 0x0000)
struct WBP_AttachmentsSelector_C_AddCellToGrid final
{
public:
	struct FFItemInfo                             Param_Item;                                        // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Basic;                                             // 0x0220(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReMinusInit;                                       // 0x0221(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  NewCellWidget;                                     // 0x0228(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CachedWidgets;                                     // 0x0230(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  CallFunc_Create_ReturnValue;                       // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWI_Workbench_C>       K2Node_DynamicCast_AsWI_Workbench;                 // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveAttachment_Result;               // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             CallFunc_GetActiveAttachment_Item;                 // 0x0280(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A3[0x5];                                      // 0x04A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  CallFunc_Array_Get_Item;                           // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetButtonIndex_ButtonIndex;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* Widget)> K2Node_CreateDelegate_OutputDelegate;              // 0x04DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_AddCellToGrid) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_AddCellToGrid");
static_assert(sizeof(WBP_AttachmentsSelector_C_AddCellToGrid) == 0x0004F0, "Wrong size on WBP_AttachmentsSelector_C_AddCellToGrid");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Param_Item) == 0x000000, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Basic) == 0x000220, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Basic' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, ReMinusInit) == 0x000221, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::ReMinusInit' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, NewCellWidget) == 0x000228, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::NewCellWidget' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CachedWidgets) == 0x000230, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CachedWidgets' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000240, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_GetChildrenCount_ReturnValue) == 0x000244, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Subtract_IntInt_ReturnValue) == 0x000248, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Temp_int_Loop_Counter_Variable) == 0x00024C, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Temp_int_Array_Index_Variable) == 0x000250, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000254, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_IsValid_ReturnValue) == 0x000258, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Not_PreBool_ReturnValue) == 0x000259, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Create_ReturnValue) == 0x000260, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, K2Node_DynamicCast_AsWI_Workbench) == 0x000268, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::K2Node_DynamicCast_AsWI_Workbench' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_IsValid_ReturnValue_1) == 0x000279, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_GetActiveAttachment_Result) == 0x00027A, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_GetActiveAttachment_Result' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_GetActiveAttachment_Item) == 0x000280, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_GetActiveAttachment_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0004A0, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_BooleanAND_ReturnValue) == 0x0004A1, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_BooleanAND_ReturnValue_1) == 0x0004A2, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0004A8, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Temp_int_Variable) == 0x0004B0, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, Temp_bool_Variable) == 0x0004B4, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, K2Node_Select_Default) == 0x0004B8, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Array_Get_Item) == 0x0004C0, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_GetButtonIndex_ButtonIndex) == 0x0004C8, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_GetButtonIndex_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Array_Length_ReturnValue) == 0x0004CC, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004D0, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Less_IntInt_ReturnValue) == 0x0004D4, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, CallFunc_Array_Add_ReturnValue) == 0x0004D8, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddCellToGrid, K2Node_CreateDelegate_OutputDelegate) == 0x0004DC, "Member 'WBP_AttachmentsSelector_C_AddCellToGrid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.AddEmptySlots
// 0x0030 (0x0030 - 0x0000)
struct WBP_AttachmentsSelector_C_AddEmptySlots final
{
public:
	int32                                         MaxEmptySlotsIndexes;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_AddEmptySlots) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_AddEmptySlots");
static_assert(sizeof(WBP_AttachmentsSelector_C_AddEmptySlots) == 0x000030, "Wrong size on WBP_AttachmentsSelector_C_AddEmptySlots");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, MaxEmptySlotsIndexes) == 0x000000, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::MaxEmptySlotsIndexes' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, Temp_int_Variable) == 0x000004, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000020, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_GetChildrenCount_ReturnValue) == 0x000028, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddEmptySlots, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_AttachmentsSelector_C_AddEmptySlots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.AddItem
// 0x0230 (0x0230 - 0x0000)
struct WBP_AttachmentsSelector_C_AddItem final
{
public:
	struct FFItemInfo                             Param_Item;                                        // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UWBP_AttachmentCell_C*                  NewCellWidget;                                     // 0x0220(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_AttachmentCell_C*                  CallFunc_AddCellToGrid_NewCellWidget;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_AddItem) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_AddItem");
static_assert(sizeof(WBP_AttachmentsSelector_C_AddItem) == 0x000230, "Wrong size on WBP_AttachmentsSelector_C_AddItem");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddItem, Param_Item) == 0x000000, "Member 'WBP_AttachmentsSelector_C_AddItem::Param_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddItem, NewCellWidget) == 0x000220, "Member 'WBP_AttachmentsSelector_C_AddItem::NewCellWidget' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AddItem, CallFunc_AddCellToGrid_NewCellWidget) == 0x000228, "Member 'WBP_AttachmentsSelector_C_AddItem::CallFunc_AddCellToGrid_NewCellWidget' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.AutoSetActiveCell
// 0x0050 (0x0050 - 0x0000)
struct WBP_AttachmentsSelector_C_AutoSetActiveCell final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_AttachmentCell_C*                  K2Node_DynamicCast_AsWBP_Attachment_Cell;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBasic_Basic;                           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_AutoSetActiveCell) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_AutoSetActiveCell");
static_assert(sizeof(WBP_AttachmentsSelector_C_AutoSetActiveCell) == 0x000050, "Wrong size on WBP_AttachmentsSelector_C_AutoSetActiveCell");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, K2Node_DynamicCast_AsWBP_Attachment_Cell) == 0x000038, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::K2Node_DynamicCast_AsWBP_Attachment_Cell' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_AutoSetActiveCell, CallFunc_GetBasic_Basic) == 0x00004A, "Member 'WBP_AttachmentsSelector_C_AutoSetActiveCell::CallFunc_GetBasic_Basic' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.Clear
// 0x0040 (0x0040 - 0x0000)
struct WBP_AttachmentsSelector_C_Clear final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  K2Node_DynamicCast_AsWBP_Attachment_Cell;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_Clear) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_Clear");
static_assert(sizeof(WBP_AttachmentsSelector_C_Clear) == 0x000040, "Wrong size on WBP_AttachmentsSelector_C_Clear");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_AttachmentsSelector_C_Clear::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_AttachmentsSelector_C_Clear::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_AttachmentsSelector_C_Clear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_AttachmentsSelector_C_Clear::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_AttachmentsSelector_C_Clear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_AttachmentsSelector_C_Clear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, K2Node_DynamicCast_AsWBP_Attachment_Cell) == 0x000030, "Member 'WBP_AttachmentsSelector_C_Clear::K2Node_DynamicCast_AsWBP_Attachment_Cell' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_AttachmentsSelector_C_Clear::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_Clear, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'WBP_AttachmentsSelector_C_Clear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.ExecuteUbergraph_WBP_AttachmentsSelector
// 0x0030 (0x0030 - 0x0000)
struct WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWI_Workbench_C>       K2Node_DynamicCast_AsWI_Workbench;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocked_Locked;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector");
static_assert(sizeof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector) == 0x000030, "Wrong size on WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, EntryPoint) == 0x000000, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, K2Node_DynamicCast_AsWI_Workbench) == 0x000008, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::K2Node_DynamicCast_AsWI_Workbench' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, CallFunc_GetLocked_Locked) == 0x000019, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::CallFunc_GetLocked_Locked' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, Temp_bool_IsClosed_Variable) == 0x00001B, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, K2Node_CustomEvent_Index) == 0x00001C, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, K2Node_CustomEvent_Widget) == 0x000020, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'WBP_AttachmentsSelector_C_ExecuteUbergraph_WBP_AttachmentsSelector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.GetAttachment
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_AttachmentsSelector_C_GetAttachment final
{
public:
	E_TypesOfModes                                Param_ModeType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Attachment                          Attachment;                                        // 0x0008(0x0080)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_Attachment                          FunctionAttachment;                                // 0x0088(0x0080)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         FunctionIndex;                                     // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0138(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttachmentsSelector_C_GetAttachment) == 0x000008, "Wrong alignment on WBP_AttachmentsSelector_C_GetAttachment");
static_assert(sizeof(WBP_AttachmentsSelector_C_GetAttachment) == 0x0001C0, "Wrong size on WBP_AttachmentsSelector_C_GetAttachment");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Param_ModeType) == 0x000000, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Param_ModeType' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Param_Index) == 0x000004, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Attachment) == 0x000008, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Attachment' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, FunctionAttachment) == 0x000088, "Member 'WBP_AttachmentsSelector_C_GetAttachment::FunctionAttachment' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, FunctionIndex) == 0x000108, "Member 'WBP_AttachmentsSelector_C_GetAttachment::FunctionIndex' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Temp_int_Array_Index_Variable) == 0x00010C, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Temp_int_Loop_Counter_Variable) == 0x000110, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, Temp_bool_True_if_break_was_hit_Variable) == 0x000118, "Member 'WBP_AttachmentsSelector_C_GetAttachment::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_Array_Get_Item) == 0x000120, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_BooleanAND_ReturnValue) == 0x000131, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_GetDataTableRowFromName_OutRow) == 0x000138, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001B8, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttachmentsSelector_C_GetAttachment, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B9, "Member 'WBP_AttachmentsSelector_C_GetAttachment::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_AttachmentsSelector.WBP_AttachmentsSelector_C.GetCellButtonByIndex
// 0x0070 (0x0070 - 0x0000)
struct WBP_AttachmentsSelector_C_GetCellButtonByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  ButtonCell;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_AttachmentCell_C*                  FunctionButtonCell;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FunctionResult;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttachmentCell_C*                  K2Node_DynamicCast_AsWBP_Attachment_Cell;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
