#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "F_CarShopItem_structs.hpp"
#include "E_CarShopSections_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarShop.WBP_CarShop_C
// 0x0190 (0x0410 - 0x0280)
class UWBP_CarShop_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowNotif;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewOpen;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitchCategory;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAndHide_NotEnoughMoneyMessage;                 // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_124;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Close;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_E;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Q;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HintButtonNew_C*                     Button_Space;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ModalBG;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Content;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_100;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WarningMessageText;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LabelText_C*                       UMG_LabelText_1;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_HouseSlots;                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Content;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopCategory_C*                 WBP_CarShopCategory;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopCategory_C*                 WBP_CarShopCategory_1;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopCategory_C*                 WBP_CarShopCategory_2;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopCategory_C*                 WBP_CarShopCategory_3;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot_1;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot_2;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot_3;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot_4;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     WBP_CarSlot_5;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainCategorySelector_C*            WBP_MainCategorySelector;                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalWindow_C*                     WBP_ModalWindow;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerTotalStats_C*                WBP_PlayerTotalStats;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scroller_C*                        WBP_Scroller_84;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPC_PlayerStatsComponent_C*            PlayerStatsComponent_Ref;                          // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              CachedController;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateStats_Timer;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnExit;                                            // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_CarShopCategory_C*>         Categories;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_CarShopSlot_C*>             CarSlots;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FF_CarShopItem>                 CarsInfo;                                          // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_CarShopCategory_C*                 SelectedCategory;                                  // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     SelectedCarSlot;                                   // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_CarShopSections                             Section;                                           // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_WBP_CarShop_C;                               // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CarShopSlot_C*                     HoveredCarSlot;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CarShop_Button_124_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_CarShop_Button_Close_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_CarShop_Button_E_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__WBP_CarShop_Button_Q_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature();
	void BndEvt__WBP_CarShop_WBP_MainCategorySelector_K2Node_ComponentBoundEvent_3_OnCategoryChanged__DelegateSignature(int32 Param_Index);
	void BndEvt__WBP_CarShop_WBP_ModalWindow_K2Node_ComponentBoundEvent_5_OnAccept__DelegateSignature();
	void ChangeSelectedButton(const class FText& NewCategoryText, class UWBP_CarShopCategory_C* NewSelectedCategory);
	void CloseShop();
	void Construct();
	void CustomEvent(int32 Param_Index);
	void ExecuteUbergraph_WBP_CarShop(int32 EntryPoint);
	void Finished_8B19DE9642503587B5AFDD82DB8F1D33();
	void OnChangeCarSlot(class UWBP_CarShopSlot_C* PressedCarSlot);
	void OnChangeCategory(const class FText& NewSelectedCategoryName, class UWBP_CarShopCategory_C* CarShopCategory);
	void OnChangeCurrentCar_Event(class UWBP_CarShopSlot_C* CurrentCar);
	void OnConfirmNotEnoughMoneyNotif();
	void OnDisableSelectSlots();
	void OnExit__DelegateSignature();
	void OnHoveredSlot(class UWBP_CarShopSlot_C* HoveredSlot);
	void OnPressedToCarSlot();
	void OnShowErrorMessage(const class FText& ErrorMessage);
	void OnSwitchToNextSection();
	void OnSwitchToPrevSection();
	void OnUnhoveredSlot(class UWBP_CarShopSlot_C* UnhoveredSlot);
	void OnUpdateBuyProperty();
	void OnUpdateMoney();
	void OnUpdateSellProperty();
	void OpenCarShop();
	void PreConstruct(bool IsDesignTime);
	void SetShopSectionToSlot(E_CarShopSections NewSection);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateStats_Func();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarShop_C">();
	}
	static class UWBP_CarShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarShop_C>();
	}
};
static_assert(alignof(UWBP_CarShop_C) == 0x000008, "Wrong alignment on UWBP_CarShop_C");
static_assert(sizeof(UWBP_CarShop_C) == 0x000410, "Wrong size on UWBP_CarShop_C");
static_assert(offsetof(UWBP_CarShop_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CarShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, ShowNotif) == 0x000288, "Member 'UWBP_CarShop_C::ShowNotif' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, NewOpen) == 0x000290, "Member 'UWBP_CarShop_C::NewOpen' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, SwitchCategory) == 0x000298, "Member 'UWBP_CarShop_C::SwitchCategory' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Open) == 0x0002A0, "Member 'UWBP_CarShop_C::Open' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Close) == 0x0002A8, "Member 'UWBP_CarShop_C::Close' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, ShowAndHide_NotEnoughMoneyMessage) == 0x0002B0, "Member 'UWBP_CarShop_C::ShowAndHide_NotEnoughMoneyMessage' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Button_124) == 0x0002B8, "Member 'UWBP_CarShop_C::Button_124' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Button_Close) == 0x0002C0, "Member 'UWBP_CarShop_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Button_E) == 0x0002C8, "Member 'UWBP_CarShop_C::Button_E' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Button_Q) == 0x0002D0, "Member 'UWBP_CarShop_C::Button_Q' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Button_Space) == 0x0002D8, "Member 'UWBP_CarShop_C::Button_Space' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Image_ModalBG) == 0x0002E0, "Member 'UWBP_CarShop_C::Image_ModalBG' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, ScrollBox_Content) == 0x0002E8, "Member 'UWBP_CarShop_C::ScrollBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, SizeBox_100) == 0x0002F0, "Member 'UWBP_CarShop_C::SizeBox_100' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, TextBlock_WarningMessageText) == 0x0002F8, "Member 'UWBP_CarShop_C::TextBlock_WarningMessageText' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, UMG_LabelText) == 0x000300, "Member 'UWBP_CarShop_C::UMG_LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, UMG_LabelText_1) == 0x000308, "Member 'UWBP_CarShop_C::UMG_LabelText_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, UniformGridPanel_HouseSlots) == 0x000310, "Member 'UWBP_CarShop_C::UniformGridPanel_HouseSlots' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, VerticalBox_Content) == 0x000318, "Member 'UWBP_CarShop_C::VerticalBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarShopCategory) == 0x000320, "Member 'UWBP_CarShop_C::WBP_CarShopCategory' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarShopCategory_1) == 0x000328, "Member 'UWBP_CarShop_C::WBP_CarShopCategory_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarShopCategory_2) == 0x000330, "Member 'UWBP_CarShop_C::WBP_CarShopCategory_2' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarShopCategory_3) == 0x000338, "Member 'UWBP_CarShop_C::WBP_CarShopCategory_3' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot) == 0x000340, "Member 'UWBP_CarShop_C::WBP_CarSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot_1) == 0x000348, "Member 'UWBP_CarShop_C::WBP_CarSlot_1' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot_2) == 0x000350, "Member 'UWBP_CarShop_C::WBP_CarSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot_3) == 0x000358, "Member 'UWBP_CarShop_C::WBP_CarSlot_3' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot_4) == 0x000360, "Member 'UWBP_CarShop_C::WBP_CarSlot_4' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_CarSlot_5) == 0x000368, "Member 'UWBP_CarShop_C::WBP_CarSlot_5' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_MainCategorySelector) == 0x000370, "Member 'UWBP_CarShop_C::WBP_MainCategorySelector' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_ModalWindow) == 0x000378, "Member 'UWBP_CarShop_C::WBP_ModalWindow' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_PlayerTotalStats) == 0x000380, "Member 'UWBP_CarShop_C::WBP_PlayerTotalStats' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WBP_Scroller_84) == 0x000388, "Member 'UWBP_CarShop_C::WBP_Scroller_84' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, WidgetSwitcher_0) == 0x000390, "Member 'UWBP_CarShop_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, PlayerStatsComponent_Ref) == 0x000398, "Member 'UWBP_CarShop_C::PlayerStatsComponent_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, CachedController) == 0x0003A0, "Member 'UWBP_CarShop_C::CachedController' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, UpdateStats_Timer) == 0x0003A8, "Member 'UWBP_CarShop_C::UpdateStats_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, OnExit) == 0x0003B0, "Member 'UWBP_CarShop_C::OnExit' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Categories) == 0x0003C0, "Member 'UWBP_CarShop_C::Categories' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, CarSlots) == 0x0003D0, "Member 'UWBP_CarShop_C::CarSlots' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, CarsInfo) == 0x0003E0, "Member 'UWBP_CarShop_C::CarsInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, SelectedCategory) == 0x0003F0, "Member 'UWBP_CarShop_C::SelectedCategory' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, SelectedCarSlot) == 0x0003F8, "Member 'UWBP_CarShop_C::SelectedCarSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Section) == 0x000400, "Member 'UWBP_CarShop_C::Section' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, Index_WBP_CarShop_C) == 0x000404, "Member 'UWBP_CarShop_C::Index_WBP_CarShop_C' has a wrong offset!");
static_assert(offsetof(UWBP_CarShop_C, HoveredCarSlot) == 0x000408, "Member 'UWBP_CarShop_C::HoveredCarSlot' has a wrong offset!");

}

