#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminPanelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AdminPanelButton.WBP_AdminPanelButton_C
// 0x0048 (0x02C8 - 0x0280)
class UWBP_AdminPanelButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_WBP_AdminPanelButton_C;                       // 0x02A0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             ButtonPushed;                                      // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_AdminPanelButton_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_AdminPanelButton_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_AdminPanelButton_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ButtonPushed__DelegateSignature(class UWBP_AdminPanelButton_C* TargetButton);
	void ExecuteUbergraph_WBP_AdminPanelButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AdminPanelButton_C">();
	}
	static class UWBP_AdminPanelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AdminPanelButton_C>();
	}
};
static_assert(alignof(UWBP_AdminPanelButton_C) == 0x000008, "Wrong alignment on UWBP_AdminPanelButton_C");
static_assert(sizeof(UWBP_AdminPanelButton_C) == 0x0002C8, "Wrong size on UWBP_AdminPanelButton_C");
static_assert(offsetof(UWBP_AdminPanelButton_C, UberGraphFrame) == 0x000280, "Member 'UWBP_AdminPanelButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelButton_C, Button) == 0x000288, "Member 'UWBP_AdminPanelButton_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelButton_C, Image) == 0x000290, "Member 'UWBP_AdminPanelButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelButton_C, Text) == 0x000298, "Member 'UWBP_AdminPanelButton_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelButton_C, Name_WBP_AdminPanelButton_C) == 0x0002A0, "Member 'UWBP_AdminPanelButton_C::Name_WBP_AdminPanelButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelButton_C, ButtonPushed) == 0x0002B8, "Member 'UWBP_AdminPanelButton_C::ButtonPushed' has a wrong offset!");

}

