#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SlidesTutorial

#include "Basic.hpp"

#include "S_TutorialSlides_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_SlidesTutorial.WBP_SlidesTutorial_C.ExecuteUbergraph_WBP_SlidesTutorial
// 0x0220 (0x0220 - 0x0000)
struct WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_TutorialSlides                      CallFunc_Array_Get_Item;                           // 0x0078(0x0060)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00E0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             K2Node_MakeSet_Set;                                // 0x0100(0x0050)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD;                 // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGUIHidden_Hidden;                      // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GameHUD_C>        K2Node_DynamicCast_AsBPI_Game_HUD_1;               // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGUIHidden_Hidden_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_2;                // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_3;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial) == 0x000008, "Wrong alignment on WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial");
static_assert(sizeof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial) == 0x000220, "Wrong size on WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, EntryPoint) == 0x000000, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_int_Variable) == 0x000004, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000018, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000020, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_int_Variable_1) == 0x000070, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Max_ReturnValue) == 0x000074, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000E0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_byte_Variable) == 0x0000F8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_byte_Variable_1) == 0x0000F9, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_MakeSet_Set) == 0x000100, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Array_LastIndex_ReturnValue) == 0x000150, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000154, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Min_ReturnValue) == 0x000158, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetPlayerController_ReturnValue) == 0x000160, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_K2_GetPawn_ReturnValue) == 0x000168, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetHUD_ReturnValue) == 0x000180, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_DynamicCast_AsBPI_Game_HUD) == 0x000188, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_DynamicCast_AsBPI_Game_HUD' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_bool_Variable) == 0x000199, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetGUIHidden_Hidden) == 0x00019A, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetGUIHidden_Hidden' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001A0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_K2_GetPawn_ReturnValue_1) == 0x0001A8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetHUD_ReturnValue_1) == 0x0001B0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_DynamicCast_AsBPI_Game_HUD_1) == 0x0001B8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_DynamicCast_AsBPI_Game_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_GetGUIHidden_Hidden_1) == 0x0001C9, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_GetGUIHidden_Hidden_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayEvent2D_ReturnValue) == 0x0001D0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayEvent2D_ReturnValue_1) == 0x0001D8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayEvent2D_ReturnValue_2) == 0x0001E0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayEvent2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_PlayEvent2D_ReturnValue_3) == 0x0001E8, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_PlayEvent2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F0, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_CreateDelegate_OutputDelegate_2) == 0x000200, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_byte_Variable_2) == 0x000210, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_byte_Variable_3) == 0x000211, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, Temp_bool_Variable_1) == 0x000212, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_Select_Default) == 0x000213, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Array_Length_ReturnValue_1) == 0x000214, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, CallFunc_Greater_IntInt_ReturnValue) == 0x000218, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial, K2Node_Select_Default_1) == 0x000219, "Member 'WBP_SlidesTutorial_C_ExecuteUbergraph_WBP_SlidesTutorial::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_SlidesTutorial.WBP_SlidesTutorial_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SlidesTutorial_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlidesTutorial_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SlidesTutorial_C_PreConstruct");
static_assert(sizeof(WBP_SlidesTutorial_C_PreConstruct) == 0x000001, "Wrong size on WBP_SlidesTutorial_C_PreConstruct");
static_assert(offsetof(WBP_SlidesTutorial_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SlidesTutorial_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SlidesTutorial.WBP_SlidesTutorial_C.SetPages
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_SlidesTutorial_C_SetPages final
{
public:
	TSet<class FName>                             PagesRows;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Set_ToArray_Result;                       // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_TutorialSlides                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlidesTutorial_C_SetPages) == 0x000008, "Wrong alignment on WBP_SlidesTutorial_C_SetPages");
static_assert(sizeof(WBP_SlidesTutorial_C_SetPages) == 0x0000E8, "Wrong size on WBP_SlidesTutorial_C_SetPages");
static_assert(offsetof(WBP_SlidesTutorial_C_SetPages, PagesRows) == 0x000000, "Member 'WBP_SlidesTutorial_C_SetPages::PagesRows' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_SetPages, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_SlidesTutorial_C_SetPages::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlidesTutorial_C_SetPages, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_SlidesTutorial_C_SetPages::Temp_int_Loop_Counter_Variable' has a wrong offset!");
