#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftCategory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ContainerPickupsInfo_structs.hpp"
#include "UMG_classes.hpp"
#include "E_EntryMode_structs.hpp"
#include "CraftItemCategories_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CraftCategory.WBP_CraftCategory_C
// 0x0118 (0x0398 - 0x0280)
class UWBP_CraftCategory_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ChangeContent_Anim;                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Deselect_Anim;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Anim;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Anim;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Category;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CategoryIcon_Selected;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CategoryName;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Items;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_CraftItem_C*>               Items;                                             // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_CraftItem_C*                       CurrentSelectionCraftItem;                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectedCategory;                                // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSelectedCategoryItem;                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   Name_WBP_CraftCategory_C;                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FContainerPickupsInfo>          DismantleItems;                                    // 0x0310(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	bool                                          IsScrollable;                                      // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VisibleEntries;                                    // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        To;                                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAnimating;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AnimTimer;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRight;                                           // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FirstVisibleIndex;                                 // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnItemCrafted;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnItemDismantled;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             RefDataTable;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnNeedUpdateModel;                                 // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_WorkbenchCraft_C*                  WorkBenchCraftRef;                                 // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinishCraft;                                     // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnimTick();
	void BndEvt__WBP_WorkbanchraftCategory_Button_Category_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftCategory_Button_Category_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_WorkbenchCraftCategory_Button_Category_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Create_Entry(class FName ItemName, E_EntryMode EntryMode);
	void CustomClick();
	void Deselect();
	void ExecuteUbergraph_WBP_CraftCategory(int32 EntryPoint);
	void FastSelect();
	void Finished_1257C116468AE40B4896299F7EB14947();
	void GetCategoryName(class FText* CategoryName);
	void Init();
	void IsEmpty(bool* Empty);
	void ItemCrafted(class UWBP_CraftItem_C* Item);
	void ItemDismantled(class UWBP_CraftItem_C* Item);
	void Need_Update_Model_Event(const struct FFItemInfo& NewModelInfo, bool bIsSketch);
	void OnFinishCraft__DelegateSignature();
	void OnItemCrafted__DelegateSignature(class UWBP_CraftCategory_C* Category, class UWBP_CraftItem_C* Item);
	void OnItemDismantled__DelegateSignature(class UWBP_CraftCategory_C* Category, class UWBP_CraftItem_C* Item);
	void OnNeedUpdateModel__DelegateSignature(const struct FFItemInfo& NewModelInfo, bool bIsSketch);
	void OnSelectedCategory__DelegateSignature(class UWBP_CraftCategory_C* Category);
	void OnSelectedCategoryItem__DelegateSignature(class UWBP_CraftCategory_C* Category, class UWBP_CraftItem_C* Item);
	void OnSelectedItem(class UWBP_CraftItem_C* Item);
	void PreConstruct(bool IsDesignTime);
	void RemoveItem(class UWBP_CraftItem_C* Item);
	void Select();
	void SetScrollable(bool Param_IsScrollable);
	void StartCraftSelected(class ABP_CraftStation_C* WorkbenchRef);
	void StartDismantleSelected(class ABP_CraftStation_C* WorkbenchRef);
	void StopCraftSelected(class ABP_CraftStation_C* WorkbenchRef);
	void StopDismantleSelected(class ABP_CraftStation_C* WorkbenchRef);
	void UpdateCounts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CraftCategory_C">();
	}
	static class UWBP_CraftCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CraftCategory_C>();
	}
};
static_assert(alignof(UWBP_CraftCategory_C) == 0x000008, "Wrong alignment on UWBP_CraftCategory_C");
static_assert(sizeof(UWBP_CraftCategory_C) == 0x000398, "Wrong size on UWBP_CraftCategory_C");
static_assert(offsetof(UWBP_CraftCategory_C, UberGraphFrame) == 0x000280, "Member 'UWBP_CraftCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, ChangeContent_Anim) == 0x000288, "Member 'UWBP_CraftCategory_C::ChangeContent_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Deselect_Anim) == 0x000290, "Member 'UWBP_CraftCategory_C::Deselect_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Select_Anim) == 0x000298, "Member 'UWBP_CraftCategory_C::Select_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Hover_Anim) == 0x0002A0, "Member 'UWBP_CraftCategory_C::Hover_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Button_Category) == 0x0002A8, "Member 'UWBP_CraftCategory_C::Button_Category' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Image_114) == 0x0002B0, "Member 'UWBP_CraftCategory_C::Image_114' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Image_CategoryIcon_Selected) == 0x0002B8, "Member 'UWBP_CraftCategory_C::Image_CategoryIcon_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Text_CategoryName) == 0x0002C0, "Member 'UWBP_CraftCategory_C::Text_CategoryName' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, VerticalBox_Items) == 0x0002C8, "Member 'UWBP_CraftCategory_C::VerticalBox_Items' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Items) == 0x0002D0, "Member 'UWBP_CraftCategory_C::Items' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, CurrentSelectionCraftItem) == 0x0002E0, "Member 'UWBP_CraftCategory_C::CurrentSelectionCraftItem' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnSelectedCategory) == 0x0002E8, "Member 'UWBP_CraftCategory_C::OnSelectedCategory' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnSelectedCategoryItem) == 0x0002F8, "Member 'UWBP_CraftCategory_C::OnSelectedCategoryItem' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, Name_WBP_CraftCategory_C) == 0x000308, "Member 'UWBP_CraftCategory_C::Name_WBP_CraftCategory_C' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, DismantleItems) == 0x000310, "Member 'UWBP_CraftCategory_C::DismantleItems' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, IsScrollable) == 0x000320, "Member 'UWBP_CraftCategory_C::IsScrollable' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, VisibleEntries) == 0x000324, "Member 'UWBP_CraftCategory_C::VisibleEntries' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, To) == 0x000328, "Member 'UWBP_CraftCategory_C::To' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, IsAnimating) == 0x000330, "Member 'UWBP_CraftCategory_C::IsAnimating' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, AnimTimer) == 0x000338, "Member 'UWBP_CraftCategory_C::AnimTimer' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, IsRight) == 0x000340, "Member 'UWBP_CraftCategory_C::IsRight' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, FirstVisibleIndex) == 0x000344, "Member 'UWBP_CraftCategory_C::FirstVisibleIndex' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnItemCrafted) == 0x000348, "Member 'UWBP_CraftCategory_C::OnItemCrafted' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnItemDismantled) == 0x000358, "Member 'UWBP_CraftCategory_C::OnItemDismantled' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, RefDataTable) == 0x000368, "Member 'UWBP_CraftCategory_C::RefDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnNeedUpdateModel) == 0x000370, "Member 'UWBP_CraftCategory_C::OnNeedUpdateModel' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, WorkBenchCraftRef) == 0x000380, "Member 'UWBP_CraftCategory_C::WorkBenchCraftRef' has a wrong offset!");
static_assert(offsetof(UWBP_CraftCategory_C, OnFinishCraft) == 0x000388, "Member 'UWBP_CraftCategory_C::OnFinishCraft' has a wrong offset!");

}

