#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuBarShopSlot

#include "Basic.hpp"

#include "E_MenuBarShopSlot_structs.hpp"
#include "F_MenuBarShopItem_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.ExecuteUbergraph_WBP_MenuBarShopSlot
// 0x0030 (0x0030 - 0x0000)
struct WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot");
static_assert(sizeof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot) == 0x000030, "Wrong size on WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, EntryPoint) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000022, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000023, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot, CallFunc_PlayEvent2D_ReturnValue) == 0x000028, "Member 'WBP_MenuBarShopSlot_C_ExecuteUbergraph_WBP_MenuBarShopSlot::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.GetSlotInfo
// 0x0048 (0x0048 - 0x0000)
struct WBP_MenuBarShopSlot_C_GetSlotInfo final
{
public:
	struct FF_MenuBarShopItem                     Param_InfoSlot;                                    // 0x0000(0x0048)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_GetSlotInfo) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_GetSlotInfo");
static_assert(sizeof(WBP_MenuBarShopSlot_C_GetSlotInfo) == 0x000048, "Wrong size on WBP_MenuBarShopSlot_C_GetSlotInfo");
static_assert(offsetof(WBP_MenuBarShopSlot_C_GetSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_GetSlotInfo::Param_InfoSlot' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.GetSlotStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuBarShopSlot_C_GetSlotStatus final
{
public:
	E_MenuBarShopSlot                             Param_SlotStatus;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_GetSlotStatus) == 0x000001, "Wrong alignment on WBP_MenuBarShopSlot_C_GetSlotStatus");
static_assert(sizeof(WBP_MenuBarShopSlot_C_GetSlotStatus) == 0x000001, "Wrong size on WBP_MenuBarShopSlot_C_GetSlotStatus");
static_assert(offsetof(WBP_MenuBarShopSlot_C_GetSlotStatus, Param_SlotStatus) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_GetSlotStatus::Param_SlotStatus' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.OnSelectedSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature final
{
public:
	class UWBP_MenuBarShopSlot_C*                 PressedMenuBarSlot;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature");
static_assert(sizeof(WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature");
static_assert(offsetof(WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature, PressedMenuBarSlot) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_OnSelectedSlot__DelegateSignature::PressedMenuBarSlot' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.OnShowErrorMessage__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature final
{
public:
	class FText                                   ErrorMessage;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature");
static_assert(sizeof(WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature) == 0x000018, "Wrong size on WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature");
static_assert(offsetof(WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature, ErrorMessage) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_OnShowErrorMessage__DelegateSignature::ErrorMessage' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuBarShopSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuBarShopSlot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MenuBarShopSlot_C_PreConstruct");
static_assert(sizeof(WBP_MenuBarShopSlot_C_PreConstruct) == 0x000001, "Wrong size on WBP_MenuBarShopSlot_C_PreConstruct");
static_assert(offsetof(WBP_MenuBarShopSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.ResetTextForDeutchLocalization
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
};
static_assert(alignof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization");
static_assert(sizeof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization) == 0x0000A0, "Wrong size on WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_GetText_ReturnValue_1) == 0x000018, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000040, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Replace_ReturnValue) == 0x000050, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Replace_ReturnValue_1) == 0x000060, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'WBP_MenuBarShopSlot_C_ResetTextForDeutchLocalization::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_MenuBarShopSlot.WBP_MenuBarShopSlot_C.SetSlotInfo
// 0x0068 (0x0068 - 0x0000)
struct WBP_MenuBarShopSlot_C_SetSlotInfo final
{
public:
	struct FF_MenuBarShopItem                     Param_InfoSlot;                                    // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0050(0x0018)()
};
static_assert(alignof(WBP_MenuBarShopSlot_C_SetSlotInfo) == 0x000008, "Wrong alignment on WBP_MenuBarShopSlot_C_SetSlotInfo");
static_assert(sizeof(WBP_MenuBarShopSlot_C_SetSlotInfo) == 0x000068, "Wrong size on WBP_MenuBarShopSlot_C_SetSlotInfo");
static_assert(offsetof(WBP_MenuBarShopSlot_C_SetSlotInfo, Param_InfoSlot) == 0x000000, "Member 'WBP_MenuBarShopSlot_C_SetSlotInfo::Param_InfoSlot' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_SetSlotInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_MenuBarShopSlot_C_SetSlotInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuBarShopSlot_C_SetSlotInfo, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000050, "Member 'WBP_MenuBarShopSlot_C_SetSlotInfo::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

}

