#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BinocularUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BinocularUI.WBP_BinocularUI_C
// 0x0030 (0x02B0 - 0x0280)
class UWBP_BinocularUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut_Anim;                                      // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn_Anim;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BinocularView;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BlackScreen;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BinocularUI(int32 EntryPoint);
	void Finished_430AD60F466F24595F797CB449A17642();
	void Hide();
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BinocularUI_C">();
	}
	static class UWBP_BinocularUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BinocularUI_C>();
	}
};
static_assert(alignof(UWBP_BinocularUI_C) == 0x000008, "Wrong alignment on UWBP_BinocularUI_C");
static_assert(sizeof(UWBP_BinocularUI_C) == 0x0002B0, "Wrong size on UWBP_BinocularUI_C");
static_assert(offsetof(UWBP_BinocularUI_C, UberGraphFrame) == 0x000280, "Member 'UWBP_BinocularUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularUI_C, FadeOut_Anim) == 0x000288, "Member 'UWBP_BinocularUI_C::FadeOut_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularUI_C, FadeIn_Anim) == 0x000290, "Member 'UWBP_BinocularUI_C::FadeIn_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularUI_C, Image_BinocularView) == 0x000298, "Member 'UWBP_BinocularUI_C::Image_BinocularView' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularUI_C, Image_BlackScreen) == 0x0002A0, "Member 'UWBP_BinocularUI_C::Image_BlackScreen' has a wrong offset!");
static_assert(offsetof(UWBP_BinocularUI_C, Showed) == 0x0002A8, "Member 'UWBP_BinocularUI_C::Showed' has a wrong offset!");

}

