#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponRow

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "BPS_WeaponData_structs.hpp"
#include "BPS_SupportedAttachments_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_WeaponRow.WBP_WeaponRow_C.CreateModeCategoryRows
// 0x0750 (0x0750 - 0x0000)
struct WBP_WeaponRow_C_CreateModeCategoryRows final
{
public:
	struct FFItemInfo                             WeaponInfo;                                        // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_WeaponData                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0228(0x04C0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EA[0x6];                                      // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPS_SupportedAttachments              CallFunc_Array_Get_Item;                           // 0x06F0(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x3];                                      // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x2];                                      // 0x071A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModeCategoryRow_C*                 CallFunc_Create_ReturnValue;                       // 0x0738(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0748(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_CreateModeCategoryRows) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_CreateModeCategoryRows");
static_assert(sizeof(WBP_WeaponRow_C_CreateModeCategoryRows) == 0x000750, "Wrong size on WBP_WeaponRow_C_CreateModeCategoryRows");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, WeaponInfo) == 0x000000, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::WeaponInfo' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, Temp_int_Array_Index_Variable) == 0x000220, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_GetDataTableRowFromName_OutRow) == 0x000228, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0006E8, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0006E9, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Array_Get_Item) == 0x0006F0, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Array_Length_ReturnValue) == 0x000708, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, Temp_int_Loop_Counter_Variable) == 0x00070C, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Less_IntInt_ReturnValue) == 0x000710, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Add_IntInt_ReturnValue) == 0x000714, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000718, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000719, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Array_Length_ReturnValue_1) == 0x00071C, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Array_Length_ReturnValue_2) == 0x000720, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Subtract_IntInt_ReturnValue) == 0x000724, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_GetOwningPlayer_ReturnValue) == 0x000728, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000730, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Create_ReturnValue) == 0x000738, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_Array_Add_ReturnValue) == 0x000740, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_CreateModeCategoryRows, CallFunc_AddChild_ReturnValue) == 0x000748, "Member 'WBP_WeaponRow_C_CreateModeCategoryRows::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.Deselect
// 0x0001 (0x0001 - 0x0000)
struct WBP_WeaponRow_C_Deselect final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_Deselect) == 0x000001, "Wrong alignment on WBP_WeaponRow_C_Deselect");
static_assert(sizeof(WBP_WeaponRow_C_Deselect) == 0x000001, "Wrong size on WBP_WeaponRow_C_Deselect");
static_assert(offsetof(WBP_WeaponRow_C_Deselect, Instant) == 0x000000, "Member 'WBP_WeaponRow_C_Deselect::Instant' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.DeselectMods
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponRow_C_DeselectMods final
{
public:
	class UObject*                                B;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_DeselectMods) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_DeselectMods");
static_assert(sizeof(WBP_WeaponRow_C_DeselectMods) == 0x000008, "Wrong size on WBP_WeaponRow_C_DeselectMods");
static_assert(offsetof(WBP_WeaponRow_C_DeselectMods, B) == 0x000000, "Member 'WBP_WeaponRow_C_DeselectMods::B' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.ExecuteUbergraph_WBP_WeaponRow
// 0x0308 (0x0308 - 0x0000)
struct WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponRow_C*                       K2Node_CustomEvent_NewActiveWeaponRow;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_WeaponRow_C* NewActiveWeaponRow)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFItemInfo                             K2Node_CustomEvent_Weapon_Info;                    // 0x0038(0x0220)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Instant;                        // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_B;                              // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModeCategoryRow_C*                 CallFunc_Array_Get_Item;                           // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModeCategoryRow_C*                 CallFunc_Array_Get_Item_1;                         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow");
static_assert(sizeof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow) == 0x000308, "Wrong size on WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, EntryPoint) == 0x000000, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_CustomEvent_NewActiveWeaponRow) == 0x000018, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_CustomEvent_NewActiveWeaponRow' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_CustomEvent_Weapon_Info) == 0x000038, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_CustomEvent_Weapon_Info' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Array_Length_ReturnValue) == 0x000258, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Less_IntInt_ReturnValue) == 0x00025C, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayEvent2D_ReturnValue) == 0x000260, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_CustomEvent_Instant) == 0x000268, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_CustomEvent_Instant' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimationForward_ReturnValue) == 0x000270, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_CustomEvent_B) == 0x000278, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_CustomEvent_B' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Array_Length_ReturnValue_1) == 0x000280, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, K2Node_MakeArray_Array) == 0x000288, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_IsValid_ReturnValue_2) == 0x000298, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayEvent2D_ReturnValue_1) == 0x0002A0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, Temp_int_Array_Index_Variable) == 0x0002A8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Array_Get_Item) == 0x0002B0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002B8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0002C0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0002C8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x0002D0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimation_ReturnValue) == 0x0002D8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, Temp_int_Loop_Counter_Variable_1) == 0x0002E0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E4, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002E8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x0002F0, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, Temp_int_Array_Index_Variable_1) == 0x0002F8, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'WBP_WeaponRow_C_ExecuteUbergraph_WBP_WeaponRow::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.GetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_WeaponRow_C_GetIsSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_GetIsSelected) == 0x000001, "Wrong alignment on WBP_WeaponRow_C_GetIsSelected");
static_assert(sizeof(WBP_WeaponRow_C_GetIsSelected) == 0x000001, "Wrong size on WBP_WeaponRow_C_GetIsSelected");
static_assert(offsetof(WBP_WeaponRow_C_GetIsSelected, Param_IsSelected) == 0x000000, "Member 'WBP_WeaponRow_C_GetIsSelected::Param_IsSelected' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.OnActiveModeCategoryRowChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature final
{
public:
	class UWBP_ModeCategoryRow_C*                 NewActiveModeCategory;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature");
static_assert(sizeof(WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature");
static_assert(offsetof(WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature, NewActiveModeCategory) == 0x000000, "Member 'WBP_WeaponRow_C_OnActiveModeCategoryRowChanged__DelegateSignature::NewActiveModeCategory' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.OnActiveWeaponRowChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponRow_C_OnActiveWeaponRowChanged final
{
public:
	class UWBP_WeaponRow_C*                       NewActiveWeaponRow;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_OnActiveWeaponRowChanged) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_OnActiveWeaponRowChanged");
static_assert(sizeof(WBP_WeaponRow_C_OnActiveWeaponRowChanged) == 0x000008, "Wrong size on WBP_WeaponRow_C_OnActiveWeaponRowChanged");
static_assert(offsetof(WBP_WeaponRow_C_OnActiveWeaponRowChanged, NewActiveWeaponRow) == 0x000000, "Member 'WBP_WeaponRow_C_OnActiveWeaponRowChanged::NewActiveWeaponRow' has a wrong offset!");

// Function WBP_WeaponRow.WBP_WeaponRow_C.UpdateInfo
// 0x0220 (0x0220 - 0x0000)
struct WBP_WeaponRow_C_UpdateInfo final
{
public:
	struct FFItemInfo                             Param_Weapon_Info;                                 // 0x0000(0x0220)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponRow_C_UpdateInfo) == 0x000008, "Wrong alignment on WBP_WeaponRow_C_UpdateInfo");
static_assert(sizeof(WBP_WeaponRow_C_UpdateInfo) == 0x000220, "Wrong size on WBP_WeaponRow_C_UpdateInfo");
static_assert(offsetof(WBP_WeaponRow_C_UpdateInfo, Param_Weapon_Info) == 0x000000, "Member 'WBP_WeaponRow_C_UpdateInfo::Param_Weapon_Info' has a wrong offset!");

}

