#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewLocationBanner

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"
#include "E_NewLocation_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_NewLocation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_NewLocationBanner.WBP_NewLocationBanner_C.ExecuteUbergraph_WBP_NewLocationBanner
// 0x0200 (0x0200 - 0x0000)
struct WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_NewLocation                                 K2Node_CustomEvent_Location;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_NewLocation                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0150)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0198(0x0014)()
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner) == 0x000008, "Wrong alignment on WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner");
static_assert(sizeof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner) == 0x000200, "Wrong size on WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, EntryPoint) == 0x000000, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, K2Node_CustomEvent_Location) == 0x000004, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000170, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_K2_GetPawn_ReturnValue) == 0x000180, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_SelectColor_ReturnValue) == 0x000188, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, K2Node_MakeStruct_SlateColor) == 0x000198, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001B0, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x0001B8, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x0001C0, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, K2Node_CreateDelegate_OutputDelegate) == 0x0001CC, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001DC, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F0, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0001F8, "Member 'WBP_NewLocationBanner_C_ExecuteUbergraph_WBP_NewLocationBanner::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_NewLocationBanner.WBP_NewLocationBanner_C.Play Phrase
// 0x0020 (0x0020 - 0x0000)
struct WBP_NewLocationBanner_C_Play_Phrase final
{
public:
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             K2Node_DynamicCast_AsFMODEvent;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_NewLocationBanner_C_Play_Phrase) == 0x000008, "Wrong alignment on WBP_NewLocationBanner_C_Play_Phrase");
static_assert(sizeof(WBP_NewLocationBanner_C_Play_Phrase) == 0x000020, "Wrong size on WBP_NewLocationBanner_C_Play_Phrase");
static_assert(offsetof(WBP_NewLocationBanner_C_Play_Phrase, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000000, "Member 'WBP_NewLocationBanner_C_Play_Phrase::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_Play_Phrase, K2Node_DynamicCast_AsFMODEvent) == 0x000008, "Member 'WBP_NewLocationBanner_C_Play_Phrase::K2Node_DynamicCast_AsFMODEvent' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_Play_Phrase, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_NewLocationBanner_C_Play_Phrase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_NewLocationBanner_C_Play_Phrase, CallFunc_PlayEvent2D_ReturnValue) == 0x000018, "Member 'WBP_NewLocationBanner_C_Play_Phrase::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");

// Function WBP_NewLocationBanner.WBP_NewLocationBanner_C.ShowBanner
// 0x0001 (0x0001 - 0x0000)
struct WBP_NewLocationBanner_C_ShowBanner final
{
public:
	E_NewLocation                                 Location;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewLocationBanner_C_ShowBanner) == 0x000001, "Wrong alignment on WBP_NewLocationBanner_C_ShowBanner");
static_assert(sizeof(WBP_NewLocationBanner_C_ShowBanner) == 0x000001, "Wrong size on WBP_NewLocationBanner_C_ShowBanner");
static_assert(offsetof(WBP_NewLocationBanner_C_ShowBanner, Location) == 0x000000, "Member 'WBP_NewLocationBanner_C_ShowBanner::Location' has a wrong offset!");

}

