#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VehicleStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VehicleStats.WBP_VehicleStats_C
// 0x0050 (0x02D0 - 0x0280)
class UWBP_VehicleStats_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show_Anim;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentDurability;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentFuel;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxDurability;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxFuel;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Fuel_Max;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Durability_Max;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FuelDivideValue;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DurabilityUpdate(double CurrentValue);
	void ExecuteUbergraph_WBP_VehicleStats(int32 EntryPoint);
	void FuelUpdate(double CurrentValue);
	void SetDurabilitylMaxLevel(double DurabilityLevel);
	void SetFuelMaxLevel(double FuelLevel);
	void Show(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VehicleStats_C">();
	}
	static class UWBP_VehicleStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VehicleStats_C>();
	}
};
static_assert(alignof(UWBP_VehicleStats_C) == 0x000008, "Wrong alignment on UWBP_VehicleStats_C");
static_assert(sizeof(UWBP_VehicleStats_C) == 0x0002D0, "Wrong size on UWBP_VehicleStats_C");
static_assert(offsetof(UWBP_VehicleStats_C, UberGraphFrame) == 0x000280, "Member 'UWBP_VehicleStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, Show_Anim) == 0x000288, "Member 'UWBP_VehicleStats_C::Show_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, TextBlock_CurrentDurability) == 0x000290, "Member 'UWBP_VehicleStats_C::TextBlock_CurrentDurability' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, TextBlock_CurrentFuel) == 0x000298, "Member 'UWBP_VehicleStats_C::TextBlock_CurrentFuel' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, TextBlock_MaxDurability) == 0x0002A0, "Member 'UWBP_VehicleStats_C::TextBlock_MaxDurability' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, TextBlock_MaxFuel) == 0x0002A8, "Member 'UWBP_VehicleStats_C::TextBlock_MaxFuel' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, Fuel_Max) == 0x0002B0, "Member 'UWBP_VehicleStats_C::Fuel_Max' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, Durability_Max) == 0x0002B8, "Member 'UWBP_VehicleStats_C::Durability_Max' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, Showed) == 0x0002C0, "Member 'UWBP_VehicleStats_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_VehicleStats_C, FuelDivideValue) == 0x0002C8, "Member 'UWBP_VehicleStats_C::FuelDivideValue' has a wrong offset!");

}

