#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TipsUI1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TipsUI1.WBP_TipsUI1_C
// 0x0018 (0x0298 - 0x0280)
class UWBP_TipsUI1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BlackScreenAbove;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TipActualText;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TipsUI1(int32 EntryPoint);
	void TipVisible(const class FText& TipName, const class FText& ActualTip, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TipsUI1_C">();
	}
	static class UWBP_TipsUI1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TipsUI1_C>();
	}
};
static_assert(alignof(UWBP_TipsUI1_C) == 0x000008, "Wrong alignment on UWBP_TipsUI1_C");
static_assert(sizeof(UWBP_TipsUI1_C) == 0x000298, "Wrong size on UWBP_TipsUI1_C");
static_assert(offsetof(UWBP_TipsUI1_C, UberGraphFrame) == 0x000280, "Member 'UWBP_TipsUI1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TipsUI1_C, Image_BlackScreenAbove) == 0x000288, "Member 'UWBP_TipsUI1_C::Image_BlackScreenAbove' has a wrong offset!");
static_assert(offsetof(UWBP_TipsUI1_C, TipActualText) == 0x000290, "Member 'UWBP_TipsUI1_C::TipActualText' has a wrong offset!");

}

