#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RUSure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RUSure.WBP_RUSure_C
// 0x0028 (0x02A8 - 0x0280)
class UWBP_RUSure_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_39;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_24;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Name_WBP_RUSure_C;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_RUSure_Button_39_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RUSure_Button_39_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_RUSure_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_RUSure_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_RUSure(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RUSure_C">();
	}
	static class UWBP_RUSure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RUSure_C>();
	}
};
static_assert(alignof(UWBP_RUSure_C) == 0x000008, "Wrong alignment on UWBP_RUSure_C");
static_assert(sizeof(UWBP_RUSure_C) == 0x0002A8, "Wrong size on UWBP_RUSure_C");
static_assert(offsetof(UWBP_RUSure_C, UberGraphFrame) == 0x000280, "Member 'UWBP_RUSure_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RUSure_C, Button) == 0x000288, "Member 'UWBP_RUSure_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_RUSure_C, Button_39) == 0x000290, "Member 'UWBP_RUSure_C::Button_39' has a wrong offset!");
static_assert(offsetof(UWBP_RUSure_C, TextBlock_24) == 0x000298, "Member 'UWBP_RUSure_C::TextBlock_24' has a wrong offset!");
static_assert(offsetof(UWBP_RUSure_C, Name_WBP_RUSure_C) == 0x0002A0, "Member 'UWBP_RUSure_C::Name_WBP_RUSure_C' has a wrong offset!");

}

