#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StaticWeapons

#include "Basic.hpp"

#include "TypeStaticWeapon_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "S_Attachment_structs.hpp"
#include "AttachmentInfo_structs.hpp"
#include "ST_WeaponMaxValue_structs.hpp"


namespace SDK::Params
{

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.AddPercent
// 0x0090 (0x0090 - 0x0000)
struct WBP_StaticWeapons_C_AddPercent final
{
public:
	ETypeStaticWeapon                             NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InPercent;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_3;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_2;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_3;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_AddPercent) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_AddPercent");
static_assert(sizeof(WBP_StaticWeapons_C_AddPercent) == 0x000090, "Wrong size on WBP_StaticWeapons_C_AddPercent");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, NewParam) == 0x000000, "Member 'WBP_StaticWeapons_C_AddPercent::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, InPercent) == 0x000004, "Member 'WBP_StaticWeapons_C_AddPercent::InPercent' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_StaticWeapons_C_AddPercent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000028, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x000038, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x000040, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_B_ImplicitCast_3) == 0x000048, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000058, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000060, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000068, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_A_ImplicitCast_2) == 0x000070, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x000078, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_Add_DoubleDouble_A_ImplicitCast_3) == 0x000080, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_Add_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_AddPercent, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x000088, "Member 'WBP_StaticWeapons_C_AddPercent::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.CalculateAttachments
// 0x02E8 (0x02E8 - 0x0000)
struct WBP_StaticWeapons_C_CalculateAttachments final
{
public:
	struct FFItemInfo                             FItemInfo;                                         // 0x0000(0x0220)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttachmentInfo                        CallFunc_Array_Get_Item;                           // 0x0224(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_Attachment                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0240(0x0080)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_CalculateAttachments) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_CalculateAttachments");
static_assert(sizeof(WBP_StaticWeapons_C_CalculateAttachments) == 0x0002E8, "Wrong size on WBP_StaticWeapons_C_CalculateAttachments");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, FItemInfo) == 0x000000, "Member 'WBP_StaticWeapons_C_CalculateAttachments::FItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, Temp_int_Array_Index_Variable) == 0x000220, "Member 'WBP_StaticWeapons_C_CalculateAttachments::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Array_Get_Item) == 0x000224, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, Temp_int_Loop_Counter_Variable) == 0x000238, "Member 'WBP_StaticWeapons_C_CalculateAttachments::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_GetDataTableRowFromName_OutRow) == 0x000240, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002C0, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Less_IntInt_ReturnValue) == 0x0002C1, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Add_IntInt_ReturnValue) == 0x0002C4, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002C8, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002D0, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0002D8, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_CalculateAttachments, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x0002E0, "Member 'WBP_StaticWeapons_C_CalculateAttachments::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.ClearPercent
// 0x0002 (0x0002 - 0x0000)
struct WBP_StaticWeapons_C_ClearPercent final
{
public:
	ETypeStaticWeapon                             Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_ClearPercent) == 0x000001, "Wrong alignment on WBP_StaticWeapons_C_ClearPercent");
static_assert(sizeof(WBP_StaticWeapons_C_ClearPercent) == 0x000002, "Wrong size on WBP_StaticWeapons_C_ClearPercent");
static_assert(offsetof(WBP_StaticWeapons_C_ClearPercent, Selection) == 0x000000, "Member 'WBP_StaticWeapons_C_ClearPercent::Selection' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_ClearPercent, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_StaticWeapons_C_ClearPercent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.ExecuteUbergraph_WBP_StaticWeapons
// 0x0030 (0x0030 - 0x0000)
struct WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_WeaponMaxValue                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons");
static_assert(sizeof(WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons) == 0x000030, "Wrong size on WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons");
static_assert(offsetof(WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons, EntryPoint) == 0x000000, "Member 'WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000028, "Member 'WBP_StaticWeapons_C_ExecuteUbergraph_WBP_StaticWeapons::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.GetPercent
// 0x000C (0x000C - 0x0000)
struct WBP_StaticWeapons_C_GetPercent final
{
public:
	ETypeStaticWeapon                             Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_Rate;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_GetPercent) == 0x000004, "Wrong alignment on WBP_StaticWeapons_C_GetPercent");
static_assert(sizeof(WBP_StaticWeapons_C_GetPercent) == 0x00000C, "Wrong size on WBP_StaticWeapons_C_GetPercent");
static_assert(offsetof(WBP_StaticWeapons_C_GetPercent, Selection) == 0x000000, "Member 'WBP_StaticWeapons_C_GetPercent::Selection' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_GetPercent, Param_Rate) == 0x000004, "Member 'WBP_StaticWeapons_C_GetPercent::Param_Rate' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_GetPercent, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_StaticWeapons_C_GetPercent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.MinusPercent
// 0x0078 (0x0078 - 0x0000)
struct WBP_StaticWeapons_C_MinusPercent final
{
public:
	ETypeStaticWeapon                             Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Percent;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_MinusPercent) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_MinusPercent");
static_assert(sizeof(WBP_StaticWeapons_C_MinusPercent) == 0x000078, "Wrong size on WBP_StaticWeapons_C_MinusPercent");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, Selection) == 0x000000, "Member 'WBP_StaticWeapons_C_MinusPercent::Selection' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, Percent) == 0x000008, "Member 'WBP_StaticWeapons_C_MinusPercent::Percent' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_StaticWeapons_C_MinusPercent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000030, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000040, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000048, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000050, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2) == 0x000058, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x000060, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3) == 0x000068, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_MinusPercent, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x000070, "Member 'WBP_StaticWeapons_C_MinusPercent::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.Set Percent for All
// 0x0070 (0x0070 - 0x0000)
struct WBP_StaticWeapons_C_Set_Percent_for_All final
{
public:
	float                                         Param_Power;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Range;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Stability;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Rate;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_3;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_Set_Percent_for_All) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_Set_Percent_for_All");
static_assert(sizeof(WBP_StaticWeapons_C_Set_Percent_for_All) == 0x000070, "Wrong size on WBP_StaticWeapons_C_Set_Percent_for_All");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, Param_Power) == 0x000000, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::Param_Power' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, Param_Range) == 0x000004, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::Param_Range' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, Param_Stability) == 0x000008, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::Param_Stability' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, Param_Rate) == 0x00000C, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::Param_Rate' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000028, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000030, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000038, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x000050, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_Divide_DoubleDouble_A_ImplicitCast_2) == 0x000058, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_Divide_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000060, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000064, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x000068, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_for_All, CallFunc_SetPercent_InPercent_ImplicitCast_3) == 0x00006C, "Member 'WBP_StaticWeapons_C_Set_Percent_for_All::CallFunc_SetPercent_InPercent_ImplicitCast_3' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.Set Percent Power Attachments
// 0x0038 (0x0038 - 0x0000)
struct WBP_StaticWeapons_C_Set_Percent_Power_Attachments final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_Set_Percent_Power_Attachments");
static_assert(sizeof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments) == 0x000038, "Wrong size on WBP_StaticWeapons_C_Set_Percent_Power_Attachments");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000030, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Power_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000034, "Member 'WBP_StaticWeapons_C_Set_Percent_Power_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.Set Percent Range Attachments
// 0x0038 (0x0038 - 0x0000)
struct WBP_StaticWeapons_C_Set_Percent_Range_Attachments final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_Set_Percent_Range_Attachments");
static_assert(sizeof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments) == 0x000038, "Wrong size on WBP_StaticWeapons_C_Set_Percent_Range_Attachments");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000030, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Range_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000034, "Member 'WBP_StaticWeapons_C_Set_Percent_Range_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.Set Percent Rate Attachments
// 0x0058 (0x0058 - 0x0000)
struct WBP_StaticWeapons_C_Set_Percent_Rate_Attachments final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_Set_Percent_Rate_Attachments");
static_assert(sizeof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments) == 0x000058, "Wrong size on WBP_StaticWeapons_C_Set_Percent_Rate_Attachments");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000020, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000029, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000038, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x00003C, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000048, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Rate_Attachments, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_StaticWeapons_C_Set_Percent_Rate_Attachments::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_StaticWeapons.WBP_StaticWeapons_C.Set Percent Stability Attachments
// 0x0038 (0x0038 - 0x0000)
struct WBP_StaticWeapons_C_Set_Percent_Stability_Attachments final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StaticWeapons_C_Set_Percent_Stability_Attachments) == 0x000008, "Wrong alignment on WBP_StaticWeapons_C_Set_Percent_Stability_Attachments");
static_assert(sizeof(WBP_StaticWeapons_C_Set_Percent_Stability_Attachments) == 0x000038, "Wrong size on WBP_StaticWeapons_C_Set_Percent_Stability_Attachments");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Stability_Attachments, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'WBP_StaticWeapons_C_Set_Percent_Stability_Attachments::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StaticWeapons_C_Set_Percent_Stability_Attachments, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_StaticWeapons_C_Set_Percent_Stability_Attachments::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
