#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Surrender

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Surrender.WBP_Surrender_C.ExecuteUbergraph_WBP_Surrender
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_KillerName;                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetReviveTime_ReviveTime;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x00D0(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0110(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_1;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetKnockdownTime_KnockdownTime;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayerName;                     // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSurrenderTime_SurrenderTime;           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue_2;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0204(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_227[0x1];                                      // 0x0227(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SurvPC_C>         K2Node_DynamicCast_AsBPI_Surv_PC;                  // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      CallFunc_GetPlayerRef_SurvivalPlayer;              // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBleedingProgress_Value_ImplicitCast;   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_1;       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SurrenderTime_ImplicitCast;     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast_1;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast_2;       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetReviveProgress_Value_ImplicitCast;     // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBleedingProgress_Value_ImplicitCast_1; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender) == 0x000008, "Wrong alignment on WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender");
static_assert(sizeof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender) == 0x0002D0, "Wrong size on WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, EntryPoint) == 0x000000, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, Temp_bool_True_if_break_was_hit_Variable) == 0x000034, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CustomEvent_KillerName) == 0x000040, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CustomEvent_KillerName' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_ReturnValue) == 0x000070, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetReviveTime_ReviveTime) == 0x000080, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetReviveTime_ReviveTime' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000098, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000A0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x0000B0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000B8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_2) == 0x0000C0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetInputSettings_ReturnValue) == 0x0000C8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetActionMappingByName_OutMappings) == 0x0000D0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Key_IsKeyboardKey_ReturnValue) == 0x00010C, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Key_IsKeyboardKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000110, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000128, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_4) == 0x000130, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_ReturnValue_1) == 0x000140, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000148, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_MapRangeClamped_ReturnValue) == 0x000150, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_3) == 0x000158, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetKnockdownTime_KnockdownTime) == 0x000160, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetKnockdownTime_KnockdownTime' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000168, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CustomEvent_PlayerName) == 0x000170, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CustomEvent_PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetSurrenderTime_SurrenderTime) == 0x000180, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetSurrenderTime_SurrenderTime' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001A0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001A8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0001B8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x0001C0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x0001C8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_4) == 0x0001D0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_ReturnValue_2) == 0x0001E0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0001E8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x0001F0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x0001F8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_5) == 0x000200, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_CreateDelegate_OutputDelegate_6) == 0x000204, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000214, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, Temp_int_Loop_Counter_Variable) == 0x000218, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Less_IntInt_ReturnValue) == 0x00021C, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_IntInt_ReturnValue) == 0x000220, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_BooleanAND_ReturnValue) == 0x000224, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000225, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Not_PreBool_ReturnValue_1) == 0x000226, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetPlayerController_ReturnValue) == 0x000228, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_DynamicCast_AsBPI_Surv_PC) == 0x000230, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_DynamicCast_AsBPI_Surv_PC' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GetPlayerRef_SurvivalPlayer) == 0x000248, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GetPlayerRef_SurvivalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_IsValid_ReturnValue_6) == 0x000250, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_Current_ImplicitCast) == 0x000258, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000260, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000268, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000270, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_SetBleedingProgress_Value_ImplicitCast) == 0x000278, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_SetBleedingProgress_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000280, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_DeltaTime_ImplicitCast_1) == 0x000288, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000290, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, K2Node_VariableSet_SurrenderTime_ImplicitCast) == 0x000298, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::K2Node_VariableSet_SurrenderTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0002A0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_Current_ImplicitCast_1) == 0x0002A8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_Current_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_FInterpTo_DeltaTime_ImplicitCast_2) == 0x0002B8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_FInterpTo_DeltaTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0002C0, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_SetReviveProgress_Value_ImplicitCast) == 0x0002C8, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_SetReviveProgress_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender, CallFunc_SetBleedingProgress_Value_ImplicitCast_1) == 0x0002CC, "Member 'WBP_Surrender_C_ExecuteUbergraph_WBP_Surrender::CallFunc_SetBleedingProgress_Value_ImplicitCast_1' has a wrong offset!");

// Function WBP_Surrender.WBP_Surrender_C.ReviveStart
// 0x0010 (0x0010 - 0x0000)
struct WBP_Surrender_C_ReviveStart final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Surrender_C_ReviveStart) == 0x000008, "Wrong alignment on WBP_Surrender_C_ReviveStart");
static_assert(sizeof(WBP_Surrender_C_ReviveStart) == 0x000010, "Wrong size on WBP_Surrender_C_ReviveStart");
static_assert(offsetof(WBP_Surrender_C_ReviveStart, PlayerName) == 0x000000, "Member 'WBP_Surrender_C_ReviveStart::PlayerName' has a wrong offset!");

// Function WBP_Surrender.WBP_Surrender_C.SetBleedingProgress
// 0x0048 (0x0048 - 0x0000)
struct WBP_Surrender_C_SetBleedingProgress final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0008(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Surrender_C_SetBleedingProgress) == 0x000008, "Wrong alignment on WBP_Surrender_C_SetBleedingProgress");
static_assert(sizeof(WBP_Surrender_C_SetBleedingProgress) == 0x000048, "Wrong size on WBP_Surrender_C_SetBleedingProgress");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, Value) == 0x000000, "Member 'WBP_Surrender_C_SetBleedingProgress::Value' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000008, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000030, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000038, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetBleedingProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'WBP_Surrender_C_SetBleedingProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Surrender.WBP_Surrender_C.SetReviveProgress
// 0x0028 (0x0028 - 0x0000)
struct WBP_Surrender_C_SetReviveProgress final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Surrender_C_SetReviveProgress) == 0x000008, "Wrong alignment on WBP_Surrender_C_SetReviveProgress");
static_assert(sizeof(WBP_Surrender_C_SetReviveProgress) == 0x000028, "Wrong size on WBP_Surrender_C_SetReviveProgress");
static_assert(offsetof(WBP_Surrender_C_SetReviveProgress, Value) == 0x000000, "Member 'WBP_Surrender_C_SetReviveProgress::Value' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetReviveProgress, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WBP_Surrender_C_SetReviveProgress::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetReviveProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_Surrender_C_SetReviveProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetReviveProgress, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000018, "Member 'WBP_Surrender_C_SetReviveProgress::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Surrender_C_SetReviveProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000020, "Member 'WBP_Surrender_C_SetReviveProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Surrender.WBP_Surrender_C.Show
// 0x0010 (0x0010 - 0x0000)
struct WBP_Surrender_C_Show final
{
public:
	class FString                                 KillerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Surrender_C_Show) == 0x000008, "Wrong alignment on WBP_Surrender_C_Show");
static_assert(sizeof(WBP_Surrender_C_Show) == 0x000010, "Wrong size on WBP_Surrender_C_Show");
static_assert(offsetof(WBP_Surrender_C_Show, KillerName) == 0x000000, "Member 'WBP_Surrender_C_Show::KillerName' has a wrong offset!");

}

