#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ChatType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chat.WBP_Chat_C
// 0x0050 (0x02D0 - 0x0280)
class UWBP_Chat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        ComboBoxString_48;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_35;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              MultiLineEditableTextBox_0;                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      PlayerRef;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NumberOfLines;                                     // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvPC_C*                              SurvPC;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EChatType                                     ChatType;                                          // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxCount;                                          // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddText(class UWidget* Content);
	void ChangeChatType();
	void Construct();
	void ExecuteUbergraph_WBP_Chat(int32 EntryPoint);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Close_Chat(ESlateVisibility InVisibility, EChatType Param_ChatType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chat_C">();
	}
	static class UWBP_Chat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chat_C>();
	}
};
static_assert(alignof(UWBP_Chat_C) == 0x000008, "Wrong alignment on UWBP_Chat_C");
static_assert(sizeof(UWBP_Chat_C) == 0x0002D0, "Wrong size on UWBP_Chat_C");
static_assert(offsetof(UWBP_Chat_C, UberGraphFrame) == 0x000280, "Member 'UWBP_Chat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, ComboBoxString_48) == 0x000288, "Member 'UWBP_Chat_C::ComboBoxString_48' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, HorizontalBox_35) == 0x000290, "Member 'UWBP_Chat_C::HorizontalBox_35' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, Image_0) == 0x000298, "Member 'UWBP_Chat_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, MultiLineEditableTextBox_0) == 0x0002A0, "Member 'UWBP_Chat_C::MultiLineEditableTextBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, ScrollBox_0) == 0x0002A8, "Member 'UWBP_Chat_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, PlayerRef) == 0x0002B0, "Member 'UWBP_Chat_C::PlayerRef' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, NumberOfLines) == 0x0002B8, "Member 'UWBP_Chat_C::NumberOfLines' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, SurvPC) == 0x0002C0, "Member 'UWBP_Chat_C::SurvPC' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, ChatType) == 0x0002C8, "Member 'UWBP_Chat_C::ChatType' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, MaxCount) == 0x0002CC, "Member 'UWBP_Chat_C::MaxCount' has a wrong offset!");

}

