#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KilledByNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KilledByNotification.WBP_KilledByNotification_C
// 0x0028 (0x02A8 - 0x0280)
class UWBP_KilledByNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Nickname;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Showed;                                            // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValid;                                            // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_KilledByNotification(int32 EntryPoint);
	void Finished_F02B79744A8A4DEBFFC41695BD46D4B0();
	void PreConstruct(bool IsDesignTime);
	void SetInfo(TSoftObjectPtr<class UPaperSprite> Icon, const class FString& Param_Name, bool Param_bValid);
	void ShowNotification(bool Param_Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KilledByNotification_C">();
	}
	static class UWBP_KilledByNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KilledByNotification_C>();
	}
};
static_assert(alignof(UWBP_KilledByNotification_C) == 0x000008, "Wrong alignment on UWBP_KilledByNotification_C");
static_assert(sizeof(UWBP_KilledByNotification_C) == 0x0002A8, "Wrong size on UWBP_KilledByNotification_C");
static_assert(offsetof(UWBP_KilledByNotification_C, UberGraphFrame) == 0x000280, "Member 'UWBP_KilledByNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KilledByNotification_C, Show) == 0x000288, "Member 'UWBP_KilledByNotification_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_KilledByNotification_C, Image_Icon) == 0x000290, "Member 'UWBP_KilledByNotification_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_KilledByNotification_C, TextBlock_Nickname) == 0x000298, "Member 'UWBP_KilledByNotification_C::TextBlock_Nickname' has a wrong offset!");
static_assert(offsetof(UWBP_KilledByNotification_C, Showed) == 0x0002A0, "Member 'UWBP_KilledByNotification_C::Showed' has a wrong offset!");
static_assert(offsetof(UWBP_KilledByNotification_C, bValid) == 0x0002A1, "Member 'UWBP_KilledByNotification_C::bValid' has a wrong offset!");

}

