#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SimpleFadeIn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SimpleFadeIn.WBP_SimpleFadeIn_C
// 0x0020 (0x02A0 - 0x0280)
class UWBP_SimpleFadeIn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFadeIn;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_SimpleFadeIn(int32 EntryPoint);
	void Finished_56305D484C9B5D02B533788B2C143742();
	void OnFadeIn__DelegateSignature(bool Showed);
	void ShowFadeIn(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SimpleFadeIn_C">();
	}
	static class UWBP_SimpleFadeIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SimpleFadeIn_C>();
	}
};
static_assert(alignof(UWBP_SimpleFadeIn_C) == 0x000008, "Wrong alignment on UWBP_SimpleFadeIn_C");
static_assert(sizeof(UWBP_SimpleFadeIn_C) == 0x0002A0, "Wrong size on UWBP_SimpleFadeIn_C");
static_assert(offsetof(UWBP_SimpleFadeIn_C, UberGraphFrame) == 0x000280, "Member 'UWBP_SimpleFadeIn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleFadeIn_C, FadeIn) == 0x000288, "Member 'UWBP_SimpleFadeIn_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleFadeIn_C, OnFadeIn) == 0x000290, "Member 'UWBP_SimpleFadeIn_C::OnFadeIn' has a wrong offset!");

}

