#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FItemInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WeaponRow.WBP_WeaponRow_C
// 0x0360 (0x05E0 - 0x0280)
class UWBP_WeaponRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnselectRow;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectRow;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DeselectAnim;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectAnim;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_Weapon;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Line;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemBG_Default;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ItemBG_Selected;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line1;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line2;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line3;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line4;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_line5;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Hover;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ModeCategories;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModeCategoryRow_C*                 WBP_ModeCategoryComboBox;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Weapon_Name;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnActiveModeCategoryRowChanged;                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_MainWeaponTab_C*                   Parent_Widget_Ref;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsExpanded;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Pickup_Index;                                      // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFItemInfo                             Weapon_Info;                                       // 0x0338(0x0220)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UWBP_ModeCategoryRow_C*>         ArrayOfModeCategoris;                              // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnActiveModeChanged;                               // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnWeaponRowCollapsed;                              // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEquepped;                                        // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedsResource;                                     // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Workbench_C*                       Workbench_Ref;                                     // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkbenchRepairTab_C*              ParentRef;                                         // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         LineArray;                                         // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         HiddenLine;                                        // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHidden;                                     // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFake;                                            // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WeaponCategory_C*                  WeaponCategoryRef;                                 // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseVanillaMode_;                                   // 0x05C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x05C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmptySlot;                                       // 0x05CA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5CB[0x5];                                      // 0x05CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWeaponRowPressed;                                // 0x05D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_WeaponComboBox_Button_ExpandedCombobox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_WeaponRow_Button_Weapon_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_WeaponRow_Button_Weapon_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void CollapseCombobox();
	void Construct();
	void CreateModeCategoryRows(const struct FFItemInfo& WeaponInfo);
	void Deselect(bool Instant);
	void DeselectMods(class UObject* B);
	void ExecuteUbergraph_WBP_WeaponRow(int32 EntryPoint);
	void Expand_Combobox();
	void FindFakeButton();
	void GetIsSelected(bool* Param_IsSelected);
	void OnActiveModeCategoryRowChanged__DelegateSignature(class UWBP_ModeCategoryRow_C* NewActiveModeCategory);
	void OnActiveModeChanged__DelegateSignature();
	void OnActiveWeaponRowChanged(class UWBP_WeaponRow_C* NewActiveWeaponRow);
	void OnWeaponRowCollapsed__DelegateSignature();
	void OnWeaponRowPressed__DelegateSignature();
	void Select();
	void UpdateInfo(const struct FFItemInfo& Param_Weapon_Info);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WeaponRow_C">();
	}
	static class UWBP_WeaponRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WeaponRow_C>();
	}
};
static_assert(alignof(UWBP_WeaponRow_C) == 0x000008, "Wrong alignment on UWBP_WeaponRow_C");
static_assert(sizeof(UWBP_WeaponRow_C) == 0x0005E0, "Wrong size on UWBP_WeaponRow_C");
static_assert(offsetof(UWBP_WeaponRow_C, UberGraphFrame) == 0x000280, "Member 'UWBP_WeaponRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, UnselectRow) == 0x000288, "Member 'UWBP_WeaponRow_C::UnselectRow' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, SelectRow) == 0x000290, "Member 'UWBP_WeaponRow_C::SelectRow' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, DeselectAnim) == 0x000298, "Member 'UWBP_WeaponRow_C::DeselectAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, SelectAnim) == 0x0002A0, "Member 'UWBP_WeaponRow_C::SelectAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, HoverAnim) == 0x0002A8, "Member 'UWBP_WeaponRow_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Button_Weapon) == 0x0002B0, "Member 'UWBP_WeaponRow_C::Button_Weapon' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, CanvasPanel_Line) == 0x0002B8, "Member 'UWBP_WeaponRow_C::CanvasPanel_Line' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_ItemBG_Default) == 0x0002C0, "Member 'UWBP_WeaponRow_C::Image_ItemBG_Default' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_ItemBG_Selected) == 0x0002C8, "Member 'UWBP_WeaponRow_C::Image_ItemBG_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_line1) == 0x0002D0, "Member 'UWBP_WeaponRow_C::Image_line1' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_line2) == 0x0002D8, "Member 'UWBP_WeaponRow_C::Image_line2' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_line3) == 0x0002E0, "Member 'UWBP_WeaponRow_C::Image_line3' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_line4) == 0x0002E8, "Member 'UWBP_WeaponRow_C::Image_line4' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Image_line5) == 0x0002F0, "Member 'UWBP_WeaponRow_C::Image_line5' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Overlay_Hover) == 0x0002F8, "Member 'UWBP_WeaponRow_C::Overlay_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, VerticalBox_ModeCategories) == 0x000300, "Member 'UWBP_WeaponRow_C::VerticalBox_ModeCategories' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, WBP_ModeCategoryComboBox) == 0x000308, "Member 'UWBP_WeaponRow_C::WBP_ModeCategoryComboBox' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Weapon_Name) == 0x000310, "Member 'UWBP_WeaponRow_C::Weapon_Name' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, OnActiveModeCategoryRowChanged) == 0x000318, "Member 'UWBP_WeaponRow_C::OnActiveModeCategoryRowChanged' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Parent_Widget_Ref) == 0x000328, "Member 'UWBP_WeaponRow_C::Parent_Widget_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, bIsExpanded) == 0x000330, "Member 'UWBP_WeaponRow_C::bIsExpanded' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Pickup_Index) == 0x000334, "Member 'UWBP_WeaponRow_C::Pickup_Index' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Weapon_Info) == 0x000338, "Member 'UWBP_WeaponRow_C::Weapon_Info' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, ArrayOfModeCategoris) == 0x000558, "Member 'UWBP_WeaponRow_C::ArrayOfModeCategoris' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, OnActiveModeChanged) == 0x000568, "Member 'UWBP_WeaponRow_C::OnActiveModeChanged' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, OnWeaponRowCollapsed) == 0x000578, "Member 'UWBP_WeaponRow_C::OnWeaponRowCollapsed' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, IsEquepped) == 0x000588, "Member 'UWBP_WeaponRow_C::IsEquepped' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, NeedsResource) == 0x00058C, "Member 'UWBP_WeaponRow_C::NeedsResource' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, Workbench_Ref) == 0x000590, "Member 'UWBP_WeaponRow_C::Workbench_Ref' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, ParentRef) == 0x000598, "Member 'UWBP_WeaponRow_C::ParentRef' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, LineArray) == 0x0005A0, "Member 'UWBP_WeaponRow_C::LineArray' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, HiddenLine) == 0x0005B0, "Member 'UWBP_WeaponRow_C::HiddenLine' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, CurrentHidden) == 0x0005B4, "Member 'UWBP_WeaponRow_C::CurrentHidden' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, IsFake) == 0x0005B8, "Member 'UWBP_WeaponRow_C::IsFake' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, WeaponCategoryRef) == 0x0005C0, "Member 'UWBP_WeaponRow_C::WeaponCategoryRef' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, UseVanillaMode_) == 0x0005C8, "Member 'UWBP_WeaponRow_C::UseVanillaMode_' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, IsSelected) == 0x0005C9, "Member 'UWBP_WeaponRow_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, IsEmptySlot) == 0x0005CA, "Member 'UWBP_WeaponRow_C::IsEmptySlot' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponRow_C, OnWeaponRowPressed) == 0x0005D0, "Member 'UWBP_WeaponRow_C::OnWeaponRowPressed' has a wrong offset!");

}

