#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDG_Map

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WDG_Map.WDG_Map_C.AddIcon
// 0x0030 (0x0030 - 0x0000)
struct WDG_Map_C_AddIcon final
{
public:
	class UWDG_MapIcon_C*                         Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              A;                                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InSize;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_Map_C_AddIcon) == 0x000008, "Wrong alignment on WDG_Map_C_AddIcon");
static_assert(sizeof(WDG_Map_C_AddIcon) == 0x000030, "Wrong size on WDG_Map_C_AddIcon");
static_assert(offsetof(WDG_Map_C_AddIcon, Content) == 0x000000, "Member 'WDG_Map_C_AddIcon::Content' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIcon, A) == 0x000008, "Member 'WDG_Map_C_AddIcon::A' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIcon, InSize) == 0x000018, "Member 'WDG_Map_C_AddIcon::InSize' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIcon, Angle) == 0x000028, "Member 'WDG_Map_C_AddIcon::Angle' has a wrong offset!");

// Function WDG_Map.WDG_Map_C.AddIconQuest
// 0x0030 (0x0030 - 0x0000)
struct WDG_Map_C_AddIconQuest final
{
public:
	class UWDG_MapIconQuest_C*                    Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              A;                                                 // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InSize;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_Map_C_AddIconQuest) == 0x000008, "Wrong alignment on WDG_Map_C_AddIconQuest");
static_assert(sizeof(WDG_Map_C_AddIconQuest) == 0x000030, "Wrong size on WDG_Map_C_AddIconQuest");
static_assert(offsetof(WDG_Map_C_AddIconQuest, Content) == 0x000000, "Member 'WDG_Map_C_AddIconQuest::Content' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIconQuest, A) == 0x000008, "Member 'WDG_Map_C_AddIconQuest::A' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIconQuest, InSize) == 0x000018, "Member 'WDG_Map_C_AddIconQuest::InSize' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_AddIconQuest, Angle) == 0x000028, "Member 'WDG_Map_C_AddIconQuest::Angle' has a wrong offset!");

// Function WDG_Map.WDG_Map_C.ExecuteUbergraph_WDG_Map
// 0x0660 (0x0660 - 0x0000)
struct WDG_Map_C_ExecuteUbergraph_WDG_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDG_MapIcon_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0070(0x0020)(NoDestructor)
	class UWDG_MapIcon_C*                         K2Node_CustomEvent_Content_1;                      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_A_1;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_InSize_1;                       // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle_1;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_In_Out;                               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00F0(0x00D0)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_3;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_2;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_In_Out;                         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_Position;                             // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_MapItem_C>        K2Node_DynamicCast_AsBPI_Map_Item;                 // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestAreaIcon_C*                    K2Node_DynamicCast_AsBP_Quest_Area_Icon;           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMapIconData_Location;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetMapIconData_Icon;                      // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMapIconData_IconSize;                  // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMapIconData_RotationYaw;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapIconData_WorldActor;                // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMapIconData_Name;                      // 0x0280(0x0018)()
	class FText                                   CallFunc_GetMapIconData_Description;               // 0x0298(0x0018)()
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2;           // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIconQuest_C*                    CallFunc_Create_ReturnValue_1;                     // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIcon_C*                         CallFunc_Create_ReturnValue_2;                     // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIconQuest_C*                    K2Node_CustomEvent_Content;                        // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_A;                              // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_InSize;                         // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle;                          // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0370(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIconQuest_C*                    CallFunc_Array_Get_Item_1;                         // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIcon_C*                         CallFunc_Array_Get_Item_2;                         // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_QuestOnly_1;                    // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDG_MapIcon_C*                         CallFunc_Array_Get_Item_3;                         // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvPC_C*                              K2Node_DynamicCast_AsSurv_PC;                      // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_X;                              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Y;                              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_4;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_5;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDG_MapIconQuest_C*                    CallFunc_Array_Get_Item_4;                         // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Track;                          // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player_1;            // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDG_MapIconQuest_C*                    CallFunc_Array_Get_Item_5;                         // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue_1;                 // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AB[0x1];                                      // 0x04AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Track)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x04AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_GS_TDB_C>         K2Node_DynamicCast_AsBPI_GS_TDB;                   // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_QuestItemsSpawnZone_C*              CallFunc_GetQuestZone_Zone;                        // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapIcon_Location;                      // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetMapIcon_Icon;                          // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMapIcon_IconSize;                      // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapIcon_WorldActor;                    // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMapIcon_Rotation;                      // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0530(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_QuestOnly;                      // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x0548(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_MapItem_C>        K2Node_DynamicCast_AsBPI_Map_Item_1;               // 0x0570(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMapIconData_Location_1;                // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetMapIconData_Icon_1;                    // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMapIconData_IconSize_1;                // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMapIconData_RotationYaw_1;             // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetMapIconData_WorldActor_1;              // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMapIconData_Name_1;                    // 0x05C8(0x0018)()
	class FText                                   CallFunc_GetMapIconData_Description_1;             // 0x05E0(0x0018)()
	class ASurvivalPlayer_V2_C*                   K2Node_DynamicCast_AsSurvival_Player_V2_1;         // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0608(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetIconRotation_Angle_ImplicitCast;       // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddIcon_Angle_ImplicitCast;               // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_1; // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_2; // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_3; // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_4; // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast_5; // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddIconQuest_Angle_ImplicitCast;          // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddIcon_Angle_ImplicitCast_1;             // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_Map_C_ExecuteUbergraph_WDG_Map) == 0x000010, "Wrong alignment on WDG_Map_C_ExecuteUbergraph_WDG_Map");
static_assert(sizeof(WDG_Map_C_ExecuteUbergraph_WDG_Map) == 0x000660, "Wrong size on WDG_Map_C_ExecuteUbergraph_WDG_Map");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, EntryPoint) == 0x000000, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000010, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_Event_MyGeometry) == 0x000024, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_MakeStruct_Anchors) == 0x000070, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_Content_1) == 0x000090, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_Content_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_A_1) == 0x000098, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_A_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_InSize_1) == 0x0000A8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_InSize_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_Angle_1) == 0x0000B8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_Angle_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_Event_In_Out) == 0x0000BC, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_Event_In_Out' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000C8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x0000D0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000D8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x0000DC, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000E0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000E8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0000F0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MakeVector2D_ReturnValue) == 0x0001C0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_InputAxisEvent_AxisValue_3) == 0x0001D0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_InputAxisEvent_AxisValue_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_InputAxisEvent_AxisValue_2) == 0x0001D4, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_InputAxisEvent_AxisValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_In_Out) == 0x0001D8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_In_Out' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_SelectFloat_ReturnValue) == 0x0001E0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001E8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_BooleanOR_ReturnValue) == 0x0001F0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_Event_Position) == 0x0001F8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_Event_Position' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable) == 0x000208, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable_1) == 0x00020C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Get_Item) == 0x000210, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_AsBPI_Map_Item) == 0x000218, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_AsBPI_Map_Item' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_AsBP_Quest_Area_Icon) == 0x000230, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_AsBP_Quest_Area_Icon' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_bSuccess_1) == 0x000238, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_Location) == 0x000240, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_Location' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_Icon) == 0x000258, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_Icon' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_IconSize) == 0x000260, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_IconSize' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_RotationYaw) == 0x000270, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_RotationYaw' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_WorldActor) == 0x000278, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_WorldActor' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_Name) == 0x000280, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_Name' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_GetMapIconData_Description) == 0x000298, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_GetMapIconData_Description' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_AsSurvival_Player_V2) == 0x0002B0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_AsSurvival_Player_V2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_IsLocallyControlled_ReturnValue) == 0x0002B9, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0002BA, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0002C0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Loop_Counter_Variable) == 0x0002D0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Less_IntInt_ReturnValue) == 0x0002D4, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_IntInt_ReturnValue) == 0x0002D8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Loop_Counter_Variable_1) == 0x0002DC, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable_2) == 0x0002E0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002E4, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Create_ReturnValue_1) == 0x0002E8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable_3) == 0x0002F0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Loop_Counter_Variable_2) == 0x0002F4, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Create_ReturnValue_2) == 0x0002F8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MapRangeClamped_ReturnValue) == 0x000300, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000308, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MakeVector2D_ReturnValue_1) == 0x000310, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Add_ReturnValue_1) == 0x000320, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_IntInt_ReturnValue_2) == 0x000324, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable_4) == 0x000328, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Loop_Counter_Variable_3) == 0x00032C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_Content) == 0x000330, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_Content' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_A) == 0x000338, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_A' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_InSize) == 0x000348, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_InSize' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_Angle) == 0x000358, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_Angle' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_IsValid_ReturnValue) == 0x00035C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000360, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_IntInt_ReturnValue_3) == 0x000368, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_MakeStruct_Anchors_1) == 0x000370, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_AddChildToCanvas_ReturnValue_1) == 0x000390, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_AddChildToCanvas_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Add_ReturnValue_2) == 0x000398, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Loop_Counter_Variable_4) == 0x00039C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Get_Item_1) == 0x0003A0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Add_IntInt_ReturnValue_4) == 0x0003A8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Length_ReturnValue_2) == 0x0003AC, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, Temp_int_Array_Index_Variable_5) == 0x0003B0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0003B8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Get_Item_2) == 0x0003C0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0003C8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0003D0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_AsSurvival_Player) == 0x0003D8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_DynamicCast_bSuccess_3) == 0x0003E0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x0003E1, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_FClamp_ReturnValue) == 0x0003E8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0003F0, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, K2Node_CustomEvent_QuestOnly_1) == 0x0003F1, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::K2Node_CustomEvent_QuestOnly_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Length_ReturnValue_3) == 0x0003F4, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Less_IntInt_ReturnValue_1) == 0x0003F8, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Get_Item_3) == 0x000400, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Array_Length_ReturnValue_4) == 0x000408, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WDG_Map_C_ExecuteUbergraph_WDG_Map, CallFunc_Less_IntInt_ReturnValue_2) == 0x00040C, "Member 'WDG_Map_C_ExecuteUbergraph_WDG_Map::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
