#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDG_MapIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDG_MapIcon.WDG_MapIcon_C
// 0x0080 (0x0300 - 0x0280)
class UWDG_MapIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Desc;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_260;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NamePOI;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 WorldActor;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CanvasPanelSlot;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultShiftX;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultShiftY;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurPosX;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurPosY;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldXOfMapCenter;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldYOfMapCenter;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldXScale;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldYScale;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ActualYPos;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestractX(double Zoom);
	void DestractY(double Zoom);
	void ExecuteUbergraph_WDG_MapIcon(int32 EntryPoint);
	void InitIcon(class UTexture2D* Texture, class AActor* Param_WorldActor, const class FText& Param_Name, const class FText& Description);
	void SetIconPosition(double A, double Zoom, const struct FVector2D& MapSize);
	void SetIconRotation(double Angle);
	void TestMapShift(double ShiftX, double ShiftY);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WDG_MapIcon_C">();
	}
	static class UWDG_MapIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDG_MapIcon_C>();
	}
};
static_assert(alignof(UWDG_MapIcon_C) == 0x000008, "Wrong alignment on UWDG_MapIcon_C");
static_assert(sizeof(UWDG_MapIcon_C) == 0x000300, "Wrong size on UWDG_MapIcon_C");
static_assert(offsetof(UWDG_MapIcon_C, UberGraphFrame) == 0x000280, "Member 'UWDG_MapIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, Desc) == 0x000288, "Member 'UWDG_MapIcon_C::Desc' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, Icon) == 0x000290, "Member 'UWDG_MapIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, Image_260) == 0x000298, "Member 'UWDG_MapIcon_C::Image_260' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, NamePOI) == 0x0002A0, "Member 'UWDG_MapIcon_C::NamePOI' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, WorldActor) == 0x0002A8, "Member 'UWDG_MapIcon_C::WorldActor' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, CanvasPanelSlot) == 0x0002B0, "Member 'UWDG_MapIcon_C::CanvasPanelSlot' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, DefaultShiftX) == 0x0002B8, "Member 'UWDG_MapIcon_C::DefaultShiftX' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, DefaultShiftY) == 0x0002C0, "Member 'UWDG_MapIcon_C::DefaultShiftY' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, CurPosX) == 0x0002C8, "Member 'UWDG_MapIcon_C::CurPosX' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, CurPosY) == 0x0002D0, "Member 'UWDG_MapIcon_C::CurPosY' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, WorldXOfMapCenter) == 0x0002D8, "Member 'UWDG_MapIcon_C::WorldXOfMapCenter' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, WorldYOfMapCenter) == 0x0002E0, "Member 'UWDG_MapIcon_C::WorldYOfMapCenter' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, WorldXScale) == 0x0002E8, "Member 'UWDG_MapIcon_C::WorldXScale' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, WorldYScale) == 0x0002F0, "Member 'UWDG_MapIcon_C::WorldYScale' has a wrong offset!");
static_assert(offsetof(UWDG_MapIcon_C, ActualYPos) == 0x0002F8, "Member 'UWDG_MapIcon_C::ActualYPos' has a wrong offset!");

}

