#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDG_MapIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WDG_MapIcon.WDG_MapIcon_C.DestractX
// 0x0010 (0x0010 - 0x0000)
struct WDG_MapIcon_C_DestractX final
{
public:
	double                                        Zoom;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_DestractX) == 0x000008, "Wrong alignment on WDG_MapIcon_C_DestractX");
static_assert(sizeof(WDG_MapIcon_C_DestractX) == 0x000010, "Wrong size on WDG_MapIcon_C_DestractX");
static_assert(offsetof(WDG_MapIcon_C_DestractX, Zoom) == 0x000000, "Member 'WDG_MapIcon_C_DestractX::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WDG_MapIcon_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'WDG_MapIcon_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'WDG_MapIcon_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x00000B, "Member 'WDG_MapIcon_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.DestractY
// 0x0010 (0x0010 - 0x0000)
struct WDG_MapIcon_C_DestractY final
{
public:
	double                                        Zoom;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_DestractY) == 0x000008, "Wrong alignment on WDG_MapIcon_C_DestractY");
static_assert(sizeof(WDG_MapIcon_C_DestractY) == 0x000010, "Wrong size on WDG_MapIcon_C_DestractY");
static_assert(offsetof(WDG_MapIcon_C_DestractY, Zoom) == 0x000000, "Member 'WDG_MapIcon_C_DestractY::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WDG_MapIcon_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'WDG_MapIcon_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'WDG_MapIcon_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x00000B, "Member 'WDG_MapIcon_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.ExecuteUbergraph_WDG_MapIcon
// 0x01A0 (0x01A0 - 0x0000)
struct WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_ShiftX;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ShiftY;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_WorldActor;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x00B0(0x0018)()
	class FText                                   K2Node_CustomEvent_Description;                    // 0x00C8(0x0018)()
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_A;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Zoom;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_MapSize;                        // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon) == 0x000008, "Wrong alignment on WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon");
static_assert(sizeof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon) == 0x0001A0, "Wrong size on WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, EntryPoint) == 0x000000, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_bool_Variable) == 0x000004, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable) == 0x000005, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable_1) == 0x000006, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_bool_Variable_1) == 0x000007, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable_2) == 0x000008, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable_3) == 0x000009, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_ShiftX) == 0x000010, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_ShiftX' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_ShiftY) == 0x000018, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_ShiftY' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_DynamicCast_AsSurvival_Player) == 0x000020, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_IsLocallyControlled_ReturnValue) == 0x000029, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable_4) == 0x000048, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000050, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_X) == 0x000060, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_byte_Variable_5) == 0x000080, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000088, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000098, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, Temp_bool_Variable_2) == 0x000099, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_Texture) == 0x0000A0, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_WorldActor) == 0x0000A8, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_WorldActor' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_Name) == 0x0000B0, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_Description) == 0x0000C8, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000E0, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E8, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_IsEmpty_ReturnValue) == 0x0000F8, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_Select_Default) == 0x0000F9, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000100, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_IsEmpty_ReturnValue_1) == 0x000110, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000111, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_Select_Default_1) == 0x000112, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_Select_Default_2) == 0x000113, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_A) == 0x000118, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_A' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_Zoom) == 0x000120, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, K2Node_CustomEvent_MapSize) == 0x000128, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::K2Node_CustomEvent_MapSize' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_X_1) == 0x000138, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_Y_1) == 0x000140, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000148, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_MakeVector2D_ReturnValue_1) == 0x000158, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000168, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_X_2) == 0x000178, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_BreakVector2D_Y_2) == 0x000180, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000188, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon, CallFunc_MakeVector2D_ReturnValue_2) == 0x000190, "Member 'WDG_MapIcon_C_ExecuteUbergraph_WDG_MapIcon::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.InitIcon
// 0x0040 (0x0040 - 0x0000)
struct WDG_MapIcon_C_InitIcon final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_WorldActor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WDG_MapIcon_C_InitIcon) == 0x000008, "Wrong alignment on WDG_MapIcon_C_InitIcon");
static_assert(sizeof(WDG_MapIcon_C_InitIcon) == 0x000040, "Wrong size on WDG_MapIcon_C_InitIcon");
static_assert(offsetof(WDG_MapIcon_C_InitIcon, Texture) == 0x000000, "Member 'WDG_MapIcon_C_InitIcon::Texture' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_InitIcon, Param_WorldActor) == 0x000008, "Member 'WDG_MapIcon_C_InitIcon::Param_WorldActor' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_InitIcon, Param_Name) == 0x000010, "Member 'WDG_MapIcon_C_InitIcon::Param_Name' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_InitIcon, Description) == 0x000028, "Member 'WDG_MapIcon_C_InitIcon::Description' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.SetIconPosition
// 0x0020 (0x0020 - 0x0000)
struct WDG_MapIcon_C_SetIconPosition final
{
public:
	double                                        A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Zoom;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapSize;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_SetIconPosition) == 0x000008, "Wrong alignment on WDG_MapIcon_C_SetIconPosition");
static_assert(sizeof(WDG_MapIcon_C_SetIconPosition) == 0x000020, "Wrong size on WDG_MapIcon_C_SetIconPosition");
static_assert(offsetof(WDG_MapIcon_C_SetIconPosition, A) == 0x000000, "Member 'WDG_MapIcon_C_SetIconPosition::A' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_SetIconPosition, Zoom) == 0x000008, "Member 'WDG_MapIcon_C_SetIconPosition::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_SetIconPosition, MapSize) == 0x000010, "Member 'WDG_MapIcon_C_SetIconPosition::MapSize' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.SetIconRotation
// 0x0010 (0x0010 - 0x0000)
struct WDG_MapIcon_C_SetIconRotation final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_SetIconRotation) == 0x000008, "Wrong alignment on WDG_MapIcon_C_SetIconRotation");
static_assert(sizeof(WDG_MapIcon_C_SetIconRotation) == 0x000010, "Wrong size on WDG_MapIcon_C_SetIconRotation");
static_assert(offsetof(WDG_MapIcon_C_SetIconRotation, Angle) == 0x000000, "Member 'WDG_MapIcon_C_SetIconRotation::Angle' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_SetIconRotation, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000008, "Member 'WDG_MapIcon_C_SetIconRotation::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WDG_MapIcon.WDG_MapIcon_C.TestMapShift
// 0x0010 (0x0010 - 0x0000)
struct WDG_MapIcon_C_TestMapShift final
{
public:
	double                                        ShiftX;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShiftY;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIcon_C_TestMapShift) == 0x000008, "Wrong alignment on WDG_MapIcon_C_TestMapShift");
static_assert(sizeof(WDG_MapIcon_C_TestMapShift) == 0x000010, "Wrong size on WDG_MapIcon_C_TestMapShift");
static_assert(offsetof(WDG_MapIcon_C_TestMapShift, ShiftX) == 0x000000, "Member 'WDG_MapIcon_C_TestMapShift::ShiftX' has a wrong offset!");
static_assert(offsetof(WDG_MapIcon_C_TestMapShift, ShiftY) == 0x000008, "Member 'WDG_MapIcon_C_TestMapShift::ShiftY' has a wrong offset!");

}

