#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDG_MapIconQuest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDG_MapIconQuest.WDG_MapIconQuest_C.DestractX
// 0x0010 (0x0010 - 0x0000)
struct WDG_MapIconQuest_C_DestractX final
{
public:
	double                                        Zoom;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIconQuest_C_DestractX) == 0x000008, "Wrong alignment on WDG_MapIconQuest_C_DestractX");
static_assert(sizeof(WDG_MapIconQuest_C_DestractX) == 0x000010, "Wrong size on WDG_MapIconQuest_C_DestractX");
static_assert(offsetof(WDG_MapIconQuest_C_DestractX, Zoom) == 0x000000, "Member 'WDG_MapIconQuest_C_DestractX::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WDG_MapIconQuest_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'WDG_MapIconQuest_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'WDG_MapIconQuest_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractX, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x00000B, "Member 'WDG_MapIconQuest_C_DestractX::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");

// Function WDG_MapIconQuest.WDG_MapIconQuest_C.DestractY
// 0x02D0 (0x02D0 - 0x0000)
struct WDG_MapIconQuest_C_DestractY final
{
public:
	double                                        Zoom;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_3;    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0xD];                                       // 0x0023(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x00D0)()
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0110(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01E0(0x00D0)()
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_1;        // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_2;        // 0x02C0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIconQuest_C_DestractY) == 0x000010, "Wrong alignment on WDG_MapIconQuest_C_DestractY");
static_assert(sizeof(WDG_MapIconQuest_C_DestractY) == 0x0002D0, "Wrong size on WDG_MapIconQuest_C_DestractY");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, Zoom) == 0x000000, "Member 'WDG_MapIconQuest_C_DestractY::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000010, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000021, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_EqualEqual_DoubleDouble_ReturnValue_3) == 0x000022, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_EqualEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000100, "Member 'WDG_MapIconQuest_C_DestractY::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_SlateBrush_1) == 0x000110, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_SlateBrush_2) == 0x0001E0, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x0002B0, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_ImageSize_ImplicitCast_1) == 0x0002B8, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_ImageSize_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_DestractY, K2Node_MakeStruct_ImageSize_ImplicitCast_2) == 0x0002C0, "Member 'WDG_MapIconQuest_C_DestractY::K2Node_MakeStruct_ImageSize_ImplicitCast_2' has a wrong offset!");

// Function WDG_MapIconQuest.WDG_MapIconQuest_C.ExecuteUbergraph_WDG_MapIconQuest
// 0x0320 (0x0320 - 0x0000)
struct WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_A;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Zoom;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_MapSize;                        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASurvivalPlayer_C*                      K2Node_DynamicCast_AsSurvival_Player;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_WorldActor;                     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_Name;                           // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_NameQuest;                      // 0x01F8(0x0018)()
	class FText                                   K2Node_CustomEvent_DescQuest;                      // 0x0210(0x0018)()
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0230(0x00D0)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest) == 0x000010, "Wrong alignment on WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest");
static_assert(sizeof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest) == 0x000320, "Wrong size on WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, EntryPoint) == 0x000000, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000008, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x000028, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000058, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_A) == 0x000068, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_A' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_Zoom) == 0x000070, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_MapSize) == 0x000078, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_MapSize' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_X) == 0x000088, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_Y) == 0x000090, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, Temp_bool_Has_Been_Initd_Variable) == 0x000098, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, Temp_bool_IsClosed_Variable) == 0x000099, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_DynamicCast_AsSurvival_Player) == 0x0000A0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_DynamicCast_AsSurvival_Player' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000C8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000D0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_X_1) == 0x0000E0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_Y_1) == 0x0000E8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_MakeVector2D_ReturnValue) == 0x000100, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000110, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000118, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_MakeVector2D_ReturnValue_1) == 0x000128, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_GetSize_ReturnValue) == 0x000138, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000148, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_X_2) == 0x000158, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_Y_2) == 0x000160, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_X_3) == 0x000168, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_Y_3) == 0x000170, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000178, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000180, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000188, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_GetSize_ReturnValue_1) == 0x000190, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, Temp_byte_Variable) == 0x0001A0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_X_4) == 0x0001A8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_BreakVector2D_Y_4) == 0x0001B0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0001B8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x0001C0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0001C8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x0001D0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_Texture) == 0x0001D8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_WorldActor) == 0x0001E0, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_WorldActor' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_Name) == 0x0001E8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_NameQuest) == 0x0001F8, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_NameQuest' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_CustomEvent_DescQuest) == 0x000210, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_CustomEvent_DescQuest' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_MakeStruct_SlateBrush) == 0x000230, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000300, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, Temp_byte_Variable_1) == 0x000301, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, Temp_bool_Variable) == 0x000302, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_Select_Default) == 0x000303, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, CallFunc_MakeVector2D_ReturnValue_2) == 0x000308, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000318, "Member 'WDG_MapIconQuest_C_ExecuteUbergraph_WDG_MapIconQuest::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");

// Function WDG_MapIconQuest.WDG_MapIconQuest_C.InitIcon
// 0x0050 (0x0050 - 0x0000)
struct WDG_MapIconQuest_C_InitIcon final
{
public:
	class UTexture2D*                             Param_Texture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_WorldActor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_Name;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NameQuest;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DescQuest;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WDG_MapIconQuest_C_InitIcon) == 0x000008, "Wrong alignment on WDG_MapIconQuest_C_InitIcon");
static_assert(sizeof(WDG_MapIconQuest_C_InitIcon) == 0x000050, "Wrong size on WDG_MapIconQuest_C_InitIcon");
static_assert(offsetof(WDG_MapIconQuest_C_InitIcon, Param_Texture) == 0x000000, "Member 'WDG_MapIconQuest_C_InitIcon::Param_Texture' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_InitIcon, Param_WorldActor) == 0x000008, "Member 'WDG_MapIconQuest_C_InitIcon::Param_WorldActor' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_InitIcon, Param_Name) == 0x000010, "Member 'WDG_MapIconQuest_C_InitIcon::Param_Name' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_InitIcon, NameQuest) == 0x000020, "Member 'WDG_MapIconQuest_C_InitIcon::NameQuest' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_InitIcon, DescQuest) == 0x000038, "Member 'WDG_MapIconQuest_C_InitIcon::DescQuest' has a wrong offset!");

// Function WDG_MapIconQuest.WDG_MapIconQuest_C.SetIconPosition
// 0x0020 (0x0020 - 0x0000)
struct WDG_MapIconQuest_C_SetIconPosition final
{
public:
	double                                        A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Zoom;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapSize;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WDG_MapIconQuest_C_SetIconPosition) == 0x000008, "Wrong alignment on WDG_MapIconQuest_C_SetIconPosition");
static_assert(sizeof(WDG_MapIconQuest_C_SetIconPosition) == 0x000020, "Wrong size on WDG_MapIconQuest_C_SetIconPosition");
static_assert(offsetof(WDG_MapIconQuest_C_SetIconPosition, A) == 0x000000, "Member 'WDG_MapIconQuest_C_SetIconPosition::A' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_SetIconPosition, Zoom) == 0x000008, "Member 'WDG_MapIconQuest_C_SetIconPosition::Zoom' has a wrong offset!");
static_assert(offsetof(WDG_MapIconQuest_C_SetIconPosition, MapSize) == 0x000010, "Member 'WDG_MapIconQuest_C_SetIconPosition::MapSize' has a wrong offset!");

}

