#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponUniqueInfo

#include "Basic.hpp"

#include "PickupAttachments_structs.hpp"
#include "BPE_FireMode_structs.hpp"


namespace SDK
{

// UserDefinedStruct WeaponUniqueInfo.WeaponUniqueInfo
// 0x0028 (0x0028 - 0x0000)
struct FWeaponUniqueInfo final
{
public:
	int32                                         UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPickupAttachments                     AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B; // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_FireMode                                 FireMode_207_5BA61B7947DB36053B7BEF847E822460;     // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Durability_134_8F07298842FAE8804B3788B5ECCCFEE6;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWeaponUniqueInfo) == 0x000008, "Wrong alignment on FWeaponUniqueInfo");
static_assert(sizeof(FWeaponUniqueInfo) == 0x000028, "Wrong size on FWeaponUniqueInfo");
static_assert(offsetof(FWeaponUniqueInfo, UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A) == 0x000000, "Member 'FWeaponUniqueInfo::UniqueServerID_83_19E6C8FE42B778BAE918F79F1D85AE2A' has a wrong offset!");
static_assert(offsetof(FWeaponUniqueInfo, AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B) == 0x000008, "Member 'FWeaponUniqueInfo::AttachmentsInfo_91_2F6158F24439C5DBAD74F798FE8DB22B' has a wrong offset!");
static_assert(offsetof(FWeaponUniqueInfo, WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027) == 0x000018, "Member 'FWeaponUniqueInfo::WeaponAmmoCount_127_B1B113B84D74B28D56B83EB337E5D027' has a wrong offset!");
static_assert(offsetof(FWeaponUniqueInfo, FireMode_207_5BA61B7947DB36053B7BEF847E822460) == 0x00001C, "Member 'FWeaponUniqueInfo::FireMode_207_5BA61B7947DB36053B7BEF847E822460' has a wrong offset!");
static_assert(offsetof(FWeaponUniqueInfo, Durability_134_8F07298842FAE8804B3788B5ECCCFEE6) == 0x000020, "Member 'FWeaponUniqueInfo::Durability_134_8F07298842FAE8804B3788B5ECCCFEE6' has a wrong offset!");

}

