#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WS_CharaterPerks

#include "Basic.hpp"

#include "PerkStatEnum_structs.hpp"


namespace SDK
{

// UserDefinedStruct WS_CharaterPerks.WS_CharaterPerks
// 0x00B8 (0x00B8 - 0x0000)
struct FWS_CharaterPerks final
{
public:
	TSoftClassPtr<class UClass>                   PerkClass_53_A8B951444652D8867E5912941A6584AA;     // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   Name_6_7762619C4291BEF93ABC3688701EF003;           // 0x0030(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description_8_B330672A4DBC9B13B9B02B8C198CDF06;    // 0x0048(0x0018)(Edit, BlueprintVisible)
	int32                                         Price_42_5F5D9C6C42923EC9C0FAE9954CA35A5C;         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           Icon_25_121F7276423E23FF48A82E8D9E94AE71;          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          PositivePerk__34_1D9374E0496B2B713524DCBC6ACD90C7; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   StatName_38_01C71C7840EE7F97C8AB298D00DD5EA3;      // 0x0078(0x0018)(Edit, BlueprintVisible)
	class FText                                   PercentageChange_41_AECD18EF4C35A6CC4C0ED8A6C68102EE; // 0x0090(0x0018)(Edit, BlueprintVisible)
	double                                        ChangeMultiplier_45_51EF840A444905A66B12C0A3BCADE062; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkStatEnum                                 StatType_56_FF8111984FDE0025462FBDA8FEE8EA1F;      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWS_CharaterPerks) == 0x000008, "Wrong alignment on FWS_CharaterPerks");
static_assert(sizeof(FWS_CharaterPerks) == 0x0000B8, "Wrong size on FWS_CharaterPerks");
static_assert(offsetof(FWS_CharaterPerks, PerkClass_53_A8B951444652D8867E5912941A6584AA) == 0x000000, "Member 'FWS_CharaterPerks::PerkClass_53_A8B951444652D8867E5912941A6584AA' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, Name_6_7762619C4291BEF93ABC3688701EF003) == 0x000030, "Member 'FWS_CharaterPerks::Name_6_7762619C4291BEF93ABC3688701EF003' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, Description_8_B330672A4DBC9B13B9B02B8C198CDF06) == 0x000048, "Member 'FWS_CharaterPerks::Description_8_B330672A4DBC9B13B9B02B8C198CDF06' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, Price_42_5F5D9C6C42923EC9C0FAE9954CA35A5C) == 0x000060, "Member 'FWS_CharaterPerks::Price_42_5F5D9C6C42923EC9C0FAE9954CA35A5C' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, Icon_25_121F7276423E23FF48A82E8D9E94AE71) == 0x000068, "Member 'FWS_CharaterPerks::Icon_25_121F7276423E23FF48A82E8D9E94AE71' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, PositivePerk__34_1D9374E0496B2B713524DCBC6ACD90C7) == 0x000070, "Member 'FWS_CharaterPerks::PositivePerk__34_1D9374E0496B2B713524DCBC6ACD90C7' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, StatName_38_01C71C7840EE7F97C8AB298D00DD5EA3) == 0x000078, "Member 'FWS_CharaterPerks::StatName_38_01C71C7840EE7F97C8AB298D00DD5EA3' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, PercentageChange_41_AECD18EF4C35A6CC4C0ED8A6C68102EE) == 0x000090, "Member 'FWS_CharaterPerks::PercentageChange_41_AECD18EF4C35A6CC4C0ED8A6C68102EE' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, ChangeMultiplier_45_51EF840A444905A66B12C0A3BCADE062) == 0x0000A8, "Member 'FWS_CharaterPerks::ChangeMultiplier_45_51EF840A444905A66B12C0A3BCADE062' has a wrong offset!");
static_assert(offsetof(FWS_CharaterPerks, StatType_56_FF8111984FDE0025462FBDA8FEE8EA1F) == 0x0000B0, "Member 'FWS_CharaterPerks::StatType_56_FF8111984FDE0025462FBDA8FEE8EA1F' has a wrong offset!");

}

