#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieDeadBodyLootPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function ZombieDeadBodyLootPoint.ZombieDeadBodyLootPoint_C.ExecuteUbergraph_ZombieDeadBodyLootPoint
// 0x0050 (0x0050 - 0x0000)
struct ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombie_C*                              K2Node_DynamicCast_AsZombie;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombieDeadBody_C*                      CallFunc_GetDeadBody_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombieDeadBody_C*                      K2Node_DynamicCast_AsZombie_Dead_Body;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint) == 0x000008, "Wrong alignment on ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint");
static_assert(sizeof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint) == 0x000050, "Wrong size on ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, EntryPoint) == 0x000000, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, K2Node_DynamicCast_AsZombie) == 0x000010, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::K2Node_DynamicCast_AsZombie' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000021, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_GetDeadBody_ReturnValue) == 0x000038, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_GetDeadBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, K2Node_DynamicCast_AsZombie_Dead_Body) == 0x000040, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::K2Node_DynamicCast_AsZombie_Dead_Body' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint, CallFunc_HasAuthority_ReturnValue) == 0x00004A, "Member 'ZombieDeadBodyLootPoint_C_ExecuteUbergraph_ZombieDeadBodyLootPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function ZombieDeadBodyLootPoint.ZombieDeadBodyLootPoint_C.Reattach Loot Point
// 0x0018 (0x0018 - 0x0000)
struct ZombieDeadBodyLootPoint_C_Reattach_Loot_Point final
{
public:
	class AZombieDeadBody_C*                      CallFunc_GetDeadBody_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AZombieDeadBody_C*                      CallFunc_GetDeadBody_ReturnValue_1;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point) == 0x000008, "Wrong alignment on ZombieDeadBodyLootPoint_C_Reattach_Loot_Point");
static_assert(sizeof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point) == 0x000018, "Wrong size on ZombieDeadBodyLootPoint_C_Reattach_Loot_Point");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point, CallFunc_GetDeadBody_ReturnValue) == 0x000000, "Member 'ZombieDeadBodyLootPoint_C_Reattach_Loot_Point::CallFunc_GetDeadBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point, CallFunc_GetDeadBody_ReturnValue_1) == 0x000008, "Member 'ZombieDeadBodyLootPoint_C_Reattach_Loot_Point::CallFunc_GetDeadBody_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ZombieDeadBodyLootPoint_C_Reattach_Loot_Point::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieDeadBodyLootPoint_C_Reattach_Loot_Point, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000011, "Member 'ZombieDeadBodyLootPoint_C_Reattach_Loot_Point::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

