#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieCarHit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ZombieCarHit.ZombieCarHit_C
// 0x0040 (0x02C0 - 0x0280)
class UZombieCarHit_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation_0;                                    // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          GetingDamage;                                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_ZombieCarHit_C;                              // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ZombieCarHit(int32 EntryPoint);
	void Get();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ZombieCarHit_C">();
	}
	static class UZombieCarHit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombieCarHit_C>();
	}
};
static_assert(alignof(UZombieCarHit_C) == 0x000008, "Wrong alignment on UZombieCarHit_C");
static_assert(sizeof(UZombieCarHit_C) == 0x0002C0, "Wrong size on UZombieCarHit_C");
static_assert(offsetof(UZombieCarHit_C, UberGraphFrame) == 0x000280, "Member 'UZombieCarHit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, NewAnimation_1) == 0x000288, "Member 'UZombieCarHit_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, NewAnimation_0) == 0x000290, "Member 'UZombieCarHit_C::NewAnimation_0' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, NewAnimation) == 0x000298, "Member 'UZombieCarHit_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, Image) == 0x0002A0, "Member 'UZombieCarHit_C::Image' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, Image_1) == 0x0002A8, "Member 'UZombieCarHit_C::Image_1' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, Image_12) == 0x0002B0, "Member 'UZombieCarHit_C::Image_12' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, GetingDamage) == 0x0002B8, "Member 'UZombieCarHit_C::GetingDamage' has a wrong offset!");
static_assert(offsetof(UZombieCarHit_C, Index_ZombieCarHit_C) == 0x0002BC, "Member 'UZombieCarHit_C::Index_ZombieCarHit_C' has a wrong offset!");

}

