#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Survival_structs.hpp"


namespace SDK::Params
{

// Function ZombieController.ZombieController_C.ActivateAI
// 0x0068 (0x0068 - 0x0000)
struct ZombieController_C_ActivateAI final
{
public:
	struct FVector                                Param_HomeLocation;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               ZombieAnimType;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPathFollowingComponent*                CallFunc_GetPathFollowingComponent_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCrowdFollowingComponent*               K2Node_DynamicCast_AsCrowd_Following_Component;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_ActivateAI) == 0x000008, "Wrong alignment on ZombieController_C_ActivateAI");
static_assert(sizeof(ZombieController_C_ActivateAI) == 0x000068, "Wrong size on ZombieController_C_ActivateAI");
static_assert(offsetof(ZombieController_C_ActivateAI, Param_HomeLocation) == 0x000000, "Member 'ZombieController_C_ActivateAI::Param_HomeLocation' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, ZombieAnimType) == 0x000018, "Member 'ZombieController_C_ActivateAI::ZombieAnimType' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable) == 0x00001C, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable_1) == 0x000020, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable_2) == 0x000024, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable_3) == 0x000028, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable_4) == 0x00002C, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_real_Variable_5) == 0x000030, "Member 'ZombieController_C_ActivateAI::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, Temp_byte_Variable) == 0x000034, "Member 'ZombieController_C_ActivateAI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, CallFunc_IsValid_ReturnValue) == 0x000035, "Member 'ZombieController_C_ActivateAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, K2Node_Select_Default) == 0x000038, "Member 'ZombieController_C_ActivateAI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, K2Node_SwitchEnum_CmpSuccess) == 0x00003C, "Member 'ZombieController_C_ActivateAI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, CallFunc_GetPathFollowingComponent_ReturnValue) == 0x000040, "Member 'ZombieController_C_ActivateAI::CallFunc_GetPathFollowingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, CallFunc_GetBlackboard_ReturnValue) == 0x000048, "Member 'ZombieController_C_ActivateAI::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, K2Node_DynamicCast_AsCrowd_Following_Component) == 0x000050, "Member 'ZombieController_C_ActivateAI::K2Node_DynamicCast_AsCrowd_Following_Component' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ZombieController_C_ActivateAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, CallFunc_MakeLiteralName_ReturnValue) == 0x00005C, "Member 'ZombieController_C_ActivateAI::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ActivateAI, CallFunc_RunBehaviorTree_ReturnValue) == 0x000064, "Member 'ZombieController_C_ActivateAI::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");

// Function ZombieController.ZombieController_C.ExecuteUbergraph_ZombieController
// 0x0008 (0x0008 - 0x0000)
struct ZombieController_C_ExecuteUbergraph_ZombieController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_ExecuteUbergraph_ZombieController) == 0x000004, "Wrong alignment on ZombieController_C_ExecuteUbergraph_ZombieController");
static_assert(sizeof(ZombieController_C_ExecuteUbergraph_ZombieController) == 0x000008, "Wrong size on ZombieController_C_ExecuteUbergraph_ZombieController");
static_assert(offsetof(ZombieController_C_ExecuteUbergraph_ZombieController, EntryPoint) == 0x000000, "Member 'ZombieController_C_ExecuteUbergraph_ZombieController::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ExecuteUbergraph_ZombieController, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ZombieController_C_ExecuteUbergraph_ZombieController::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ZombieController.ZombieController_C.Reset All Params
// 0x0028 (0x0028 - 0x0000)
struct ZombieController_C_Reset_All_Params final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_Reset_All_Params) == 0x000008, "Wrong alignment on ZombieController_C_Reset_All_Params");
static_assert(sizeof(ZombieController_C_Reset_All_Params) == 0x000028, "Wrong size on ZombieController_C_Reset_All_Params");
static_assert(offsetof(ZombieController_C_Reset_All_Params, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ZombieController_C_Reset_All_Params::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ZombieController_C_Reset_All_Params::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ZombieController_C_Reset_All_Params::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'ZombieController_C_Reset_All_Params::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, CallFunc_Array_Get_Item) == 0x000018, "Member 'ZombieController_C_Reset_All_Params::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ZombieController_C_Reset_All_Params::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_Reset_All_Params, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'ZombieController_C_Reset_All_Params::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ZombieController.ZombieController_C.ResetAllParamsFix
// 0x000C (0x000C - 0x0000)
struct ZombieController_C_ResetAllParamsFix final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_ResetAllParamsFix) == 0x000004, "Wrong alignment on ZombieController_C_ResetAllParamsFix");
static_assert(sizeof(ZombieController_C_ResetAllParamsFix) == 0x00000C, "Wrong size on ZombieController_C_ResetAllParamsFix");
static_assert(offsetof(ZombieController_C_ResetAllParamsFix, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'ZombieController_C_ResetAllParamsFix::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ResetAllParamsFix, Temp_int_Variable) == 0x000004, "Member 'ZombieController_C_ResetAllParamsFix::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ZombieController_C_ResetAllParamsFix, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'ZombieController_C_ResetAllParamsFix::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ZombieController.ZombieController_C.SetHomeLocation
// 0x0018 (0x0018 - 0x0000)
struct ZombieController_C_SetHomeLocation final
{
public:
	struct FVector                                Param_HomeLocation;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_SetHomeLocation) == 0x000008, "Wrong alignment on ZombieController_C_SetHomeLocation");
static_assert(sizeof(ZombieController_C_SetHomeLocation) == 0x000018, "Wrong size on ZombieController_C_SetHomeLocation");
static_assert(offsetof(ZombieController_C_SetHomeLocation, Param_HomeLocation) == 0x000000, "Member 'ZombieController_C_SetHomeLocation::Param_HomeLocation' has a wrong offset!");

// Function ZombieController.ZombieController_C.SwitchPerception
// 0x0001 (0x0001 - 0x0000)
struct ZombieController_C_SwitchPerception final
{
public:
	bool                                          TurnOn;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_SwitchPerception) == 0x000001, "Wrong alignment on ZombieController_C_SwitchPerception");
static_assert(sizeof(ZombieController_C_SwitchPerception) == 0x000001, "Wrong size on ZombieController_C_SwitchPerception");
static_assert(offsetof(ZombieController_C_SwitchPerception, TurnOn) == 0x000000, "Member 'ZombieController_C_SwitchPerception::TurnOn' has a wrong offset!");

// Function ZombieController.ZombieController_C.GetActorPerceptionViewpoint
// 0x0150 (0x0150 - 0x0000)
struct ZombieController_C_GetActorPerceptionViewpoint final
{
public:
	struct FVector                                Out_Location;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Out_Rotation;                                      // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpecialZombie_IsSpecial;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZombieController_C_GetActorPerceptionViewpoint) == 0x000010, "Wrong alignment on ZombieController_C_GetActorPerceptionViewpoint");
static_assert(sizeof(ZombieController_C_GetActorPerceptionViewpoint) == 0x000150, "Wrong size on ZombieController_C_GetActorPerceptionViewpoint");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, Out_Location) == 0x000000, "Member 'ZombieController_C_GetActorPerceptionViewpoint::Out_Location' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, Out_Rotation) == 0x000018, "Member 'ZombieController_C_GetActorPerceptionViewpoint::Out_Rotation' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_IsSpecialZombie_IsSpecial) == 0x000030, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_IsSpecialZombie_IsSpecial' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000038, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_GetSocketTransform_ReturnValue) == 0x000050, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x0000B0, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_BreakTransform_Location) == 0x0000B8, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_BreakTransform_Rotation) == 0x0000D0, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_BreakTransform_Scale) == 0x0000E8, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_MakeVector_ReturnValue) == 0x000100, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieController_C_GetActorPerceptionViewpoint, CallFunc_MakeVector_Z_ImplicitCast) == 0x000148, "Member 'ZombieController_C_GetActorPerceptionViewpoint::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

}

