#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie

#include "Basic.hpp"

#include "FItemInfo_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_AttackingArm_structs.hpp"
#include "Survival_structs.hpp"
#include "Engine_structs.hpp"
#include "ELootTypes_structs.hpp"
#include "SlotRarity_structs.hpp"
#include "F_MovementSettings_structs.hpp"
#include "CountChance_structs.hpp"
#include "DefaultItemInfo_structs.hpp"
#include "GeneralChanceByType_structs.hpp"
#include "ItemIdGenerateChance_structs.hpp"
#include "VertexPaintDetectionPlugin_structs.hpp"
#include "F_WoundInfo_structs.hpp"
#include "F_ZombieSounds_structs.hpp"
#include "AngleMontage_structs.hpp"
#include "SpawnDecalStructure_structs.hpp"
#include "BPE_Weapon_Type_structs.hpp"
#include "DismembermentPart_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "Niagara_structs.hpp"
#include "DismembermentState_structs.hpp"
#include "DismembermentMeshCollection_structs.hpp"
#include "F_AgressiveMontage_structs.hpp"
#include "ZombiePartitionedMeshes_structs.hpp"
#include "E_ZombieAIState_structs.hpp"


namespace SDK::Params
{

// Function Zombie.Zombie_C.Activate Dismember Emitter
// 0x0170 (0x0170 - 0x0000)
struct Zombie_C_Activate_Dismember_Emitter final
{
public:
	EDismembermentPart                            DismembermentPart;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x00C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_Activate_Dismember_Emitter) == 0x000010, "Wrong alignment on Zombie_C_Activate_Dismember_Emitter");
static_assert(sizeof(Zombie_C_Activate_Dismember_Emitter) == 0x000170, "Wrong size on Zombie_C_Activate_Dismember_Emitter");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, DismembermentPart) == 0x000000, "Member 'Zombie_C_Activate_Dismember_Emitter::DismembermentPart' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, SocketName) == 0x000004, "Member 'Zombie_C_Activate_Dismember_Emitter::SocketName' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, BoneName) == 0x00000C, "Member 'Zombie_C_Activate_Dismember_Emitter::BoneName' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000068, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000070, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate_4) == 0x000078, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000088, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_Array_Add_ReturnValue_1) == 0x000090, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000094, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_K2_SetTimerDelegate_ReturnValue_5) == 0x0000A8, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_K2_SetTimerDelegate_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, K2Node_SwitchEnum_CmpSuccess) == 0x0000B0, "Member 'Zombie_C_Activate_Dismember_Emitter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_HasAuthority_ReturnValue) == 0x0000B1, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0000B8, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_GetSocketTransform_ReturnValue) == 0x0000C0, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_BreakTransform_Location) == 0x000120, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_BreakTransform_Rotation) == 0x000138, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_BreakTransform_Scale) == 0x000150, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Zombie_C_Activate_Dismember_Emitter, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000168, "Member 'Zombie_C_Activate_Dismember_Emitter::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function Zombie.Zombie_C.AddVertexBulletHole
// 0x0578 (0x0578 - 0x0000)
struct Zombie_C_AddVertexBulletHole final
{
public:
	struct FHitResult                             HitInfo;                                           // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVertexPaintAtLocationStruct           PaintAtLocationStruct;                             // 0x00E8(0x02B0)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FVertexPaintingLimitStruct             LimitPaintColor;                                   // 0x0398(0x0014)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVertexDetectRGBAStruct                ApplyVertexColorSettings;                          // 0x03B0(0x0100)(Edit, BlueprintVisible)
	struct FVertexDetectPaintAtLocationAreaSettings PaintAtAreaSettings;                               // 0x04B0(0x0014)(Edit, BlueprintVisible, NoDestructor)
	struct FVertexPaintMultiThreadSettingsStruct  MultiThreadSettings;                               // 0x04C4(0x0002)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_4C6[0x2];                                      // 0x04C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVertexDetectEventSettings             CallbackSettings;                                  // 0x04C8(0x0038)(Edit, BlueprintVisible)
	struct FVertexPaintOverridePaintUpToLOD       OverrideLOD;                                       // 0x0500(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FVertexDetectAndPaintFundementalsStruct HitFundamentals;                                   // 0x0508(0x0068)(Edit, BlueprintVisible)
	class UDecalComponent*                        SpawnedDecal;                                      // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AddVertexBulletHole) == 0x000008, "Wrong alignment on Zombie_C_AddVertexBulletHole");
static_assert(sizeof(Zombie_C_AddVertexBulletHole) == 0x000578, "Wrong size on Zombie_C_AddVertexBulletHole");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, HitInfo) == 0x000000, "Member 'Zombie_C_AddVertexBulletHole::HitInfo' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, PaintAtLocationStruct) == 0x0000E8, "Member 'Zombie_C_AddVertexBulletHole::PaintAtLocationStruct' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, LimitPaintColor) == 0x000398, "Member 'Zombie_C_AddVertexBulletHole::LimitPaintColor' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, ApplyVertexColorSettings) == 0x0003B0, "Member 'Zombie_C_AddVertexBulletHole::ApplyVertexColorSettings' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, PaintAtAreaSettings) == 0x0004B0, "Member 'Zombie_C_AddVertexBulletHole::PaintAtAreaSettings' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, MultiThreadSettings) == 0x0004C4, "Member 'Zombie_C_AddVertexBulletHole::MultiThreadSettings' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, CallbackSettings) == 0x0004C8, "Member 'Zombie_C_AddVertexBulletHole::CallbackSettings' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, OverrideLOD) == 0x000500, "Member 'Zombie_C_AddVertexBulletHole::OverrideLOD' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, HitFundamentals) == 0x000508, "Member 'Zombie_C_AddVertexBulletHole::HitFundamentals' has a wrong offset!");
static_assert(offsetof(Zombie_C_AddVertexBulletHole, SpawnedDecal) == 0x000570, "Member 'Zombie_C_AddVertexBulletHole::SpawnedDecal' has a wrong offset!");

// Function Zombie.Zombie_C.Adjust Server Movement Tickrate
// 0x0068 (0x0068 - 0x0000)
struct Zombie_C_Adjust_Server_Movement_Tickrate final
{
public:
	bool                                          High_tickrate;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NewTickInterval;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Survival::EMovementType                       Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Survival::EMovementType                       CallFunc_GetCPPMovementType_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_MaxSimulationTimeStep_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast_1; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_Adjust_Server_Movement_Tickrate) == 0x000008, "Wrong alignment on Zombie_C_Adjust_Server_Movement_Tickrate");
static_assert(sizeof(Zombie_C_Adjust_Server_Movement_Tickrate) == 0x000068, "Wrong size on Zombie_C_Adjust_Server_Movement_Tickrate");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, High_tickrate) == 0x000000, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::High_tickrate' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, NewTickInterval) == 0x000008, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::NewTickInterval' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, Temp_byte_Variable) == 0x000010, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000012, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_GetCPPMovementType_ReturnValue) == 0x000028, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_GetCPPMovementType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, K2Node_Select_Default) == 0x000038, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast) == 0x000048, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, K2Node_VariableSet_MaxSimulationTimeStep_ImplicitCast) == 0x00004C, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::K2Node_VariableSet_MaxSimulationTimeStep_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast_1) == 0x000058, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_SetComponentTickInterval_TickInterval_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_Adjust_Server_Movement_Tickrate, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'Zombie_C_Adjust_Server_Movement_Tickrate::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Zombie.Zombie_C.AdjustNetUpdateFrequency
// 0x0020 (0x0020 - 0x0000)
struct Zombie_C_AdjustNetUpdateFrequency final
{
public:
	float                                         Net_Update_Frequency;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_NetUpdateFrequency_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AdjustNetUpdateFrequency) == 0x000008, "Wrong alignment on Zombie_C_AdjustNetUpdateFrequency");
static_assert(sizeof(Zombie_C_AdjustNetUpdateFrequency) == 0x000020, "Wrong size on Zombie_C_AdjustNetUpdateFrequency");
static_assert(offsetof(Zombie_C_AdjustNetUpdateFrequency, Net_Update_Frequency) == 0x000000, "Member 'Zombie_C_AdjustNetUpdateFrequency::Net_Update_Frequency' has a wrong offset!");
static_assert(offsetof(Zombie_C_AdjustNetUpdateFrequency, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'Zombie_C_AdjustNetUpdateFrequency::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_AdjustNetUpdateFrequency, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'Zombie_C_AdjustNetUpdateFrequency::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Zombie_C_AdjustNetUpdateFrequency, K2Node_VariableSet_NetUpdateFrequency_ImplicitCast) == 0x000018, "Member 'Zombie_C_AdjustNetUpdateFrequency::K2Node_VariableSet_NetUpdateFrequency_ImplicitCast' has a wrong offset!");

// Function Zombie.Zombie_C.AfterDeath
// 0x0020 (0x0020 - 0x0000)
struct Zombie_C_AfterDeath final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AfterDeath) == 0x000008, "Wrong alignment on Zombie_C_AfterDeath");
static_assert(sizeof(Zombie_C_AfterDeath) == 0x000020, "Wrong size on Zombie_C_AfterDeath");
static_assert(offsetof(Zombie_C_AfterDeath, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'Zombie_C_AfterDeath::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_AfterDeath, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Zombie_C_AfterDeath::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Zombie_C_AfterDeath, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Zombie_C_AfterDeath::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function Zombie.Zombie_C.AIInteract
// 0x0010 (0x0010 - 0x0000)
struct Zombie_C_AIInteract final
{
public:
	class ABP_Door_C*                             Door;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AIInteract) == 0x000008, "Wrong alignment on Zombie_C_AIInteract");
static_assert(sizeof(Zombie_C_AIInteract) == 0x000010, "Wrong size on Zombie_C_AIInteract");
static_assert(offsetof(Zombie_C_AIInteract, Door) == 0x000000, "Member 'Zombie_C_AIInteract::Door' has a wrong offset!");
static_assert(offsetof(Zombie_C_AIInteract, Arrow) == 0x000008, "Member 'Zombie_C_AIInteract::Arrow' has a wrong offset!");

// Function Zombie.Zombie_C.AnimTypeConfiguration
// 0x0088 (0x0088 - 0x0000)
struct Zombie_C_AnimTypeConfiguration final
{
public:
	EZombieAnimType                               Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable_2;                              // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_3;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_4;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_5;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_6;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_7;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_8;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable_9;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_10;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_11;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_12;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_13;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_14;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_15;                             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               Temp_byte_Variable_16;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_6;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_10;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue_2;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue_3;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default_2;                           // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default_3;                           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZombieAnimType                               CallFunc_GetZombieAnimType_ReturnValue_4;          // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_4;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AdjustNetUpdateFrequency_Net_Update_Frequency_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AnimTypeConfiguration) == 0x000008, "Wrong alignment on Zombie_C_AnimTypeConfiguration");
static_assert(sizeof(Zombie_C_AnimTypeConfiguration) == 0x000088, "Wrong size on Zombie_C_AnimTypeConfiguration");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable) == 0x000000, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable) == 0x000008, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_1) == 0x000010, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_2) == 0x000018, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_3) == 0x000020, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_4) == 0x000028, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_5) == 0x000030, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_1) == 0x000038, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable) == 0x000039, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable_1) == 0x00003A, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable_2) == 0x00003B, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable_3) == 0x00003C, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable_4) == 0x00003D, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_bool_Variable_5) == 0x00003E, "Member 'Zombie_C_AnimTypeConfiguration::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_2) == 0x00003F, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_3) == 0x000040, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_4) == 0x000041, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_5) == 0x000042, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_6) == 0x000043, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_7) == 0x000044, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_8) == 0x000045, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_9) == 0x000046, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_10) == 0x000047, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_11) == 0x000048, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_12) == 0x000049, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_13) == 0x00004A, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_14) == 0x00004B, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_15) == 0x00004C, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_byte_Variable_16) == 0x00004D, "Member 'Zombie_C_AnimTypeConfiguration::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_6) == 0x000050, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_7) == 0x000054, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_8) == 0x000058, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_9) == 0x00005C, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_9' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_10) == 0x000060, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_10' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, Temp_real_Variable_11) == 0x000064, "Member 'Zombie_C_AnimTypeConfiguration::Temp_real_Variable_11' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_GetZombieAnimType_ReturnValue) == 0x000068, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_GetZombieAnimType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_GetZombieAnimType_ReturnValue_1) == 0x000069, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_GetZombieAnimType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, K2Node_Select_Default) == 0x000070, "Member 'Zombie_C_AnimTypeConfiguration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, K2Node_Select_Default_1) == 0x000078, "Member 'Zombie_C_AnimTypeConfiguration::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_GetZombieAnimType_ReturnValue_2) == 0x000079, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_GetZombieAnimType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_GetZombieAnimType_ReturnValue_3) == 0x00007A, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_GetZombieAnimType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, K2Node_Select_Default_2) == 0x00007B, "Member 'Zombie_C_AnimTypeConfiguration::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, K2Node_Select_Default_3) == 0x00007C, "Member 'Zombie_C_AnimTypeConfiguration::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_GetZombieAnimType_ReturnValue_4) == 0x00007D, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_GetZombieAnimType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, K2Node_Select_Default_4) == 0x000080, "Member 'Zombie_C_AnimTypeConfiguration::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(Zombie_C_AnimTypeConfiguration, CallFunc_AdjustNetUpdateFrequency_Net_Update_Frequency_ImplicitCast) == 0x000084, "Member 'Zombie_C_AnimTypeConfiguration::CallFunc_AdjustNetUpdateFrequency_Net_Update_Frequency_ImplicitCast' has a wrong offset!");

// Function Zombie.Zombie_C.ApplyWoundsAfterDismemberment
// 0x0018 (0x0018 - 0x0000)
struct Zombie_C_ApplyWoundsAfterDismemberment final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVertexDetectAndPaintFundementalsStruct> WoundsArray;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Zombie_C_ApplyWoundsAfterDismemberment) == 0x000008, "Wrong alignment on Zombie_C_ApplyWoundsAfterDismemberment");
static_assert(sizeof(Zombie_C_ApplyWoundsAfterDismemberment) == 0x000018, "Wrong size on Zombie_C_ApplyWoundsAfterDismemberment");
static_assert(offsetof(Zombie_C_ApplyWoundsAfterDismemberment, MeshComponent) == 0x000000, "Member 'Zombie_C_ApplyWoundsAfterDismemberment::MeshComponent' has a wrong offset!");
static_assert(offsetof(Zombie_C_ApplyWoundsAfterDismemberment, WoundsArray) == 0x000008, "Member 'Zombie_C_ApplyWoundsAfterDismemberment::WoundsArray' has a wrong offset!");

// Function Zombie.Zombie_C.ArmoredZombieParams
// 0x0030 (0x0030 - 0x0000)
struct Zombie_C_ArmoredZombieParams final
{
public:
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_ZombieFinal_Armored_C*             K2Node_DynamicCast_AsABP_Zombie_Final_Armored;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_ArmoredZombieParams) == 0x000008, "Wrong alignment on Zombie_C_ArmoredZombieParams");
static_assert(sizeof(Zombie_C_ArmoredZombieParams) == 0x000030, "Wrong size on Zombie_C_ArmoredZombieParams");
static_assert(offsetof(Zombie_C_ArmoredZombieParams, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000000, "Member 'Zombie_C_ArmoredZombieParams::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_ArmoredZombieParams, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Zombie_C_ArmoredZombieParams::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_ArmoredZombieParams, K2Node_DynamicCast_AsABP_Zombie_Final_Armored) == 0x000010, "Member 'Zombie_C_ArmoredZombieParams::K2Node_DynamicCast_AsABP_Zombie_Final_Armored' has a wrong offset!");
static_assert(offsetof(Zombie_C_ArmoredZombieParams, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Zombie_C_ArmoredZombieParams::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Zombie_C_ArmoredZombieParams, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'Zombie_C_ArmoredZombieParams::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function Zombie.Zombie_C.AttachLootPoint
// 0x0010 (0x0010 - 0x0000)
struct Zombie_C_AttachLootPoint final
{
public:
	class AActor*                                 LootPoint;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_C_AttachLootPoint) == 0x000008, "Wrong alignment on Zombie_C_AttachLootPoint");
static_assert(sizeof(Zombie_C_AttachLootPoint) == 0x000010, "Wrong size on Zombie_C_AttachLootPoint");
static_assert(offsetof(Zombie_C_AttachLootPoint, LootPoint) == 0x000000, "Member 'Zombie_C_AttachLootPoint::LootPoint' has a wrong offset!");
static_assert(offsetof(Zombie_C_AttachLootPoint, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Zombie_C_AttachLootPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_C_AttachLootPoint, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000009, "Member 'Zombie_C_AttachLootPoint::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function Zombie.Zombie_C.AttackInProgress
// 0x0350 (0x0350 - 0x0000)
struct Zombie_C_AttackInProgress final
{
public:
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class ABP_Door_C*                             K2Node_DynamicCast_AsBP_Door;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_4;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCPPVelocityValue_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
