#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ParentAIDetourController_classes.hpp"
#include "Survival_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ZombieController.ZombieController_C
// 0x0028 (0x0700 - 0x06D8)
class AZombieController_C final : public AParentAIDetourController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ZombieController_C;                 // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           AllBlackboardKeys;                                 // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           ResettingFixTimer;                                 // 0x06F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ResetCounter;                                      // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateAI(const struct FVector& Param_HomeLocation, EZombieAnimType ZombieAnimType);
	void ClearVariablesAfterSight();
	void DeactivateAI();
	void ExecuteUbergraph_ZombieController(int32 EntryPoint);
	void Reset_All_Params();
	void ResetAllParamsFix();
	void SetHomeLocation(const struct FVector& Param_HomeLocation);
	void SetupVariablesAfterSight();
	void SwitchPerception(bool TurnOn);

	void GetActorPerceptionViewpoint(struct FVector* Out_Location, struct FRotator* Out_Rotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ZombieController_C">();
	}
	static class AZombieController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombieController_C>();
	}
};
static_assert(alignof(AZombieController_C) == 0x000008, "Wrong alignment on AZombieController_C");
static_assert(sizeof(AZombieController_C) == 0x000700, "Wrong size on AZombieController_C");
static_assert(offsetof(AZombieController_C, UberGraphFrame_ZombieController_C) == 0x0006D8, "Member 'AZombieController_C::UberGraphFrame_ZombieController_C' has a wrong offset!");
static_assert(offsetof(AZombieController_C, AllBlackboardKeys) == 0x0006E0, "Member 'AZombieController_C::AllBlackboardKeys' has a wrong offset!");
static_assert(offsetof(AZombieController_C, ResettingFixTimer) == 0x0006F0, "Member 'AZombieController_C::ResettingFixTimer' has a wrong offset!");
static_assert(offsetof(AZombieController_C, ResetCounter) == 0x0006F8, "Member 'AZombieController_C::ResetCounter' has a wrong offset!");

}

